{"comp": "ER_LC", "month": "Jan", "feats": "sbert", "test": 0.8226, "summ1": ["Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Pelosi's 'Commonsense' Gun Bill Is Not Sensible", "Colorado Gun Owners Ignoring New Assault Weapons Ban", "When Guns Are Outlawed, Only Outlaws Will Have Guns"], "summ2": ["4 homicides in 1 day: 2 men dead after shootout in Jackson", "Sarah Sanders: God wanted Trump to become president", "3 dead, 4 injured in shooting at California bowling alley", "'Come together': US Dems introduce gun background check bill"]}
{"comp": "ER_LC", "month": "Jun", "feats": "bow", "test": 0.8118, "summ1": ["Democrat Debate: Joe Biden Says NRA Is Not 'Our Enemy'", "Barack Obama: The United States Was ‘Founded on Inequality’", "If Elected Kamala Harris Wants to Change Federal Gun Laws “By Presidential Fiat”", "The Failure of Gun Control in Virginia Beach"], "summ2": ["Salt Lake City mayoral candidates say young people must push City Hall to take ‘courageous steps’ in gun violence prevention", "At least 12 dead, including suspect, in Virginia Beach shooting", "The trade war is weighing on Chinese home buying in the US", "Gunman out on parole kills 4 in Australian city of Darwin"]}
{"comp": "ER_LC", "month": "Jun", "feats": "sbert", "test": 0.8094, "summ1": ["REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "Elderly Man Who Shot Two Burglars In His Home Charged With Felony Over Inherited Gun", "AP: Hillary Clinton’s Gun Control Claims ‘Unsupported on All Counts’", "New Gun Laws Have Sheriffs Pushing Back Against Restrictions"], "summ2": ["Editorial: Senate inaction on gun violence prevention is shameful", "At least 12 dead, including suspect, in Virginia Beach shooting", "Lawyers for Sandy Hook families say Alex Jones sent them child porn", "Shootings reported in Chicago, as new mayor pledges to tackle gun violence"]}
{"comp": "ER_RC", "month": "Jun", "feats": "sbert", "test": 0.8024, "summ1": ["REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "Politifact Gives Obama Generous Ruling After He Blatantly Lied About America’s Gun Laws", "Self-Defense Is A Basic Human Right: A Website That ENDS The Gun Control Debate For Good", "AP: Hillary Clinton’s Gun Control Claims ‘Unsupported on All Counts’"], "summ2": ["King: Why I'm proposing a handgun ban in the city of Ottawa", "Fired employee kills 2 at Ford dealership before killing himself", "Gun Makers Adjust Rifles to Skirt Bans", "2 children, 2 adults shot at Buckroe Beach in Hampton"]}
{"comp": "C_ER", "month": "Feb", "feats": "sbert", "test": 0.8002, "summ1": ["St. Louis de-escalation program draws praise across US", "NC lawmakers roll out gun control proposals on Parkland anniversary", "Chicago police Sgt. Lori Rice found dead in apparent suicide", "Gun control push complicates Sanders’s 2020 ambitions"], "summ2": ["Murder Rates Continue To Drop, But Pelosi Insists There Is An Epidemic Of Gun Violence", "MASS POPULATION REDUCTION is the underlying goal of the Democrat-Socialist agenda, from last-day abortions and deadly vaccines to illegal immigration and gun control", "Washington Sheriffs Decline to Enforce Gun Control", "Cory Booker Pushes Anti-Lynching Bill After Jussie Smollett Incident"]}
{"comp": "L_R", "month": "May", "feats": "sbert", "test": 0.7945, "summ1": ["‘This Was Not About Us’: Grieving Students Walk Out of Colorado School Shooting Vigil", "Trump Org. Blames Zika, Gun Violence for “Severely Underperforming” Hotels", "New NRA President Says Georgia Democrat Only Won Her Seat in Congress Because She’s Black", "Terror from the Right"], "summ2": ["Colorado Students Walk Out After Politicians Hijack STEM Vigil to Push Gun-Control", "Sorry SJW Nation: You're not anti-gun. You're pro-only the government having guns. »", "LA Legislators Make Strong Stance In Defense Of Second Amendment", "Booker Dodges on Jailing Gun Owners"]}
{"comp": "C_ER", "month": "Jun", "feats": "sbert", "test": 0.7941, "summ1": ["Chicago weekend gun violence injures 44, kills 4", "Virginia governor calls special session on gun control after Virginia Beach massacre", "Democrats set to use McConnell's legislative graveyard against him", "1 Tuesday Night in St. Paul: 20 Gunshots, 1 Person Injured, 3 Homes Struck, 6 Children Caught in Crossfire"], "summ2": ["Gun Owners of America Counsel Urges Trump to Avoid Passing Gun Control", "Barack Obama: The United States Was ‘Founded on Inequality’", "REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "Self-Defense Is A Basic Human Right: A Website That ENDS The Gun Control Debate For Good"]}
{"comp": "L_RC", "month": "Jun", "feats": "sbert", "test": 0.7906, "summ1": ["Democratic-led House votes to fund gun violence research for first time in history", "Gun Violence Is a National Security Threat: Janet Napolitano", "The Quiet Killer at the Core of Patriotism", "Trump Tweets ‘Condolences’ To Virginia Beach Without Even Acknowledging A Shooting Took Place"], "summ2": ["31 Shot and 4 Dead in Less Than 12 Hours in Chicago", "A look at 8 gun-control measures NJ lawmakers are considering", "State lawmaker 'outraged' over Lakeland woman's arrest for turning in husband's guns to police", "Liberals want to prohibit more assault weapons rather than ban handguns"]}
{"comp": "C_ER", "month": "Jan", "feats": "sbert", "test": 0.7904, "summ1": ["Stoneman Douglas commission calls for arming teachers, more school security spending in first report to state leaders", "U.S. student anti-gun activists to keep momentum alive over summer", "New Florida bill would repeal gun control measures passed in response to Parkland shooting", "Woman shot in Ames was unintended target, police say; suspect held on $500K cash"], "summ2": ["Poll: Gun Rights More Important Than Gun Control", "Tlaib Tirade, Impeachment Papers, Gun Control Promises", "In Memoriam: 12 Americans Allegedly Killed by Illegal Aliens in 2018", "Boston Mayor's Office to Force Doctors to Identify and Document Patients Who Own Guns"]}
{"comp": "ER_LC", "month": "Mar", "feats": "sbert", "test": 0.7889, "summ1": ["HR 1263 Adds semiautomatic Rifles and Shotguns to the National Firearms Act of 1986", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops.", "CNN Talking Heads Caught in a Downright Lie", "‘Restrictive’ Gun Control Did Not Prevent Christchurch Massacre"], "summ2": ["Texas High School Shorts Program Showcases a New Generation of Filmmakers at SXSW", "O'Rourke says owning, using guns taught him responsible use", "New Zealanders wear headscarves in display of solidarity after mosque attacks", "Ease of adopting gun laws in NZ begs question: why not here?"]}
{"comp": "C_R", "month": "May", "feats": "sbert", "test": 0.784, "summ1": ["Swiss to vote on tightening gun laws, with EU relations in the balance", "'He wanted to be a hero’: Parents of STEM School victim Kendrick Castillo mourn loss of son", "33 shot, 5 fatally, in Chicago Memorial Day weekend gun violence", "Gun control takes center stage in 2020 Democratic presidential race"], "summ2": ["Colorado students walk out and chant 'mental health' in protest at calls for gun control during shooting vigil", "Spartacus Booker’s Outrageous Gun Control Scheme Ignores Basic 2A Rights", "When It Comes to Gun Laws, Democrats and the Media Don’t Know What They Don’t Know", "If Australian Gun Laws Work So Well, Why Did Police Find Guns?"]}
{"comp": "LC_R", "month": "Jun", "feats": "sbert", "test": 0.7831, "summ1": ["Senate Republicans Must Act to Implement Sane Gun Reforms", "Woman whose dead babies were found in home cleared of murder", "'We can no longer wait': At 'Wear Orange' rally, young leaders call for action to reduce gun violence", "Inside the NRA’s finances: Deepening debt, increased spending on legal fees — and cuts to gun training"], "summ2": ["One man shot dead and at five are wounded at Philadelphia high school graduation party", "‘He was and IS the KING of Straw Men’! Dan Crenshaw calls Obama OUT for lying about gun laws in Brazil and oh HELL YEAH", "Scathing Response from Citizens Committee to VA Guv’s Gun Control Scheme", "Ohio Gun Control Group Proposes Universal Background Checks"]}
{"comp": "L_RC", "month": "May", "feats": "sbert", "test": 0.7821, "summ1": ["School shooting in suburban Denver, Colorado: what we know", "There is progressive momentum in America.", "The NRA Is Threatening An Activist Who Is Trying To Make America’s Kids Safer", "Hot Felon Jeremy Meeks Talks Love, Gun Violence and What He Learned From 'The Streets' in Rare Interview"], "summ2": ["Swiss voters OK tight gun laws, lining up with EU", "‘I’m embarrassed’: Mayor Ted Wheeler apologizes for testy exchange over police funding", "Boy killed, girl wounded in double-shooting near East Side elementary school", "1 year after Santa Fe shooting, Texas shuns tougher gun laws"]}
{"comp": "L_RC", "month": "May", "feats": "bow", "test": 0.7748, "summ1": ["Trump Laughs As A Supporter Calls For Immigrants To Be Shot", "New NRA President Says Georgia Democrat Only Won Her Seat in Congress Because She’s Black", "Highlands Ranch shooting: 1 student killed and 8 wounded after two suspects open fire near Columbine", "Cory Booker unveils his plan to curb gun violence: federal gun licenses, no more loopholes"], "summ2": ["Alberta man charged with murder of 'hero' Abbotsford Const. John Davidson", "Mayor Lightfoot must get Chicagoans to truly care about gun violence", "1 year after Santa Fe shooting, Texas shuns tougher gun laws", "Gun-loving Swiss agree to harsher firearms control to avoid Schengen tensions"]}
{"comp": "LC_R", "month": "Jan", "feats": "sbert", "test": 0.7715, "summ1": ["Background Check Bill Marks Gun Control as a Priority for House Democrats", "4 homicides in 1 day: 2 men dead after shootout in Jackson", "Trump storms out of meeting with congressional leaders, threatening to declare emergency at border", "Las Vegas shooting: What we know about suspect Stephen Paddock"], "summ2": ["Another Push for Draconian Gun Control", "Bill Would Require Lawmakers To Pass Test Before Pushing Gun Laws", "County Supervisors In NY Make Second Amendment Stand", "IED Found Outside Eugene Police Station Following Deadly Confrontation"]}
{"comp": "L_RC", "month": "Jan", "feats": "sbert", "test": 0.7669, "summ1": ["U.S. Child Gun Deaths: Firearms Are Second Biggest Killer in America", "The ‘Good Guy With the Gun’ Is Never Black", "WATCH: March for Our Lives Recuts Donald Trump’s Oval Office Speech As Though He Were Talking About the Crisis of Gun Violence", "NRA Appears to Have Broken Federals Laws by Coordinating with GOP Candidates"], "summ2": ["Problems with Pittsburgh's proposed gun control ordinance", "Suspect who killed California officer is in U.S. illegally, police say", "New Brazilian president moves to return gun rights to the people", "Three dead after fight breaks out at California bowling alley"]}
{"comp": "C_R", "month": "Jun", "feats": "sbert", "test": 0.7665, "summ1": ["Chicago weekend gun violence injures 44, kills 4", "‘People Don’t Come Out That Much No More’: Another Disturbing Weekend In Philadelphia Filled With Gun Violence", "Concord State Rep. Pleads Guilty To Assault Charge", "Virginia governor calls special session on gun control after attack"], "summ2": ["Sorry Mr. President, But Your Lies About America’s Gun Laws Were, In Fact, Lies", "LILLEY: Trudeau's rifle ban idea won't hurt the criminals", "Ohio Gun Control Group Proposes Universal Background Checks", "Husband Of VA Beach Shooting Victim: I Wanted My Wife To Concealed Carry Her Firearm, But She Didn’t Want To Violate Gun-Free Zone Policy"]}
{"comp": "ER_L", "month": "Jun", "feats": "sbert", "test": 0.7654, "summ1": ["REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "Chicago Police Superintendent Makes Statement After 10 Killed Over The Weekend", "Self-Defense Is A Basic Human Right: A Website That ENDS The Gun Control Debate For Good", "Previously Deported Illegal Alien Charged with Drug Trafficking, Other Crimes"], "summ2": ["Democratic-led House votes to fund gun violence research for first time in history", "The Religious Right calls for a ‘special day of prayer’ devoted to Trump", "For Chuck Todd, the campaign is just cynical game of \"Gotcha.\" The candidates aren't playing.", "All but one of the 12 killed in the Virginia Beach shooting were city employees, official says"]}
{"comp": "C_ER", "month": "Sep", "feats": "sbert", "test": 0.7616, "summ1": ["McConnell says he’s waiting on Trump to chart path on guns", "Looser gun laws go into effect in Texas one day after mass shooting", "36 shot, 7 fatally, in Chicago Labor Day weekend violence", "Hurricane Dorian: Bahamas says 43 dead as hundreds still missing"], "summ2": ["Watch: Jerome Hudson Calls Out the Left’s Climate Hypocrisy, Gun Control Hysteria on ‘Waters World’", "Liberals Cheer Beto's Gun Line: 'We're Gonna Take Your AR-15'", "France: One Killed, Nine Wounded by Knife-wielding Afghan Migrant", "Chicago Mayor Shoots Herself In The Foot Trying To Prove Her FAILED Gun Control Laws Work"]}
{"comp": "C_ER", "month": "Aug", "feats": "sbert", "test": 0.7597, "summ1": ["Nashville lawmakers, activists rally for gun control on capitol steps after mass shootings in Texas, Ohio", "20 dead, more wounded after gunman attacks Texas shoppers", "Buttigieg unveils plan to strengthen mental health care, fight addiction", "Trump tells NRA chief that universal background checks are off the table"], "summ2": ["Liberals, 2020 Democrats Waste No Time Politicizing El Paso Mass Tragedy To Push Gun Control – Sons of 1776", "Dayton Shooter Identified: 24-Year-Old Connor Betts from Bellbrook, Ohio -- Wore Heavy Metal Band Hoodie", "Scalise Turns The Tables After Reporter Insinuates Trump’s ‘Language’ Causes Gun Violence: ‘[Trump] Is No More Responsible As Bernie Is For My Shooting’", "Must See: 5 Specific Times Democrats Wanted To Confiscate Your Guns"]}
{"comp": "L_R", "month": "Jan", "feats": "sbert", "test": 0.7559999999999999, "summ1": ["US Gun Deaths Reach Highest Level in Nearly 20 Years", "Sarah Sanders’s strangely unconservative argument for the wall", "Grieving father of Jazmine Barnes speaks on the arrest of two suspects in fatal shooting", "Comedian Louis C.K. mocks Parkland shooting survivors in leaked audio"], "summ2": ["U.S. Supreme Court Takes Second Amendment Challenge To A Gun Control Law", "Virginia Governor Announce Anti-Gun Legislation", "School & Church Shootings, FIGHTING BACK!", "New Hampshire Dems Try Again To Allow School Districts To Ban Guns"]}
{"comp": "C_ER", "month": "Apr", "feats": "sbert", "test": 0.7556, "summ1": ["Gun-maker to ask Supreme Court to hear Sandy Hook appeal", "15 shot, 3 fatally, in Chicago Monday", "House move roils gun control debate at Minnesota Legislature", "Cuomo responds to Trump criticism: New York will remember NRA 'in our thoughts and prayers'"], "summ2": ["Lindsey Graham Shoots America In The Back, Begins Drafting Gun Confiscation Bill", "Gun Controllers Demand Banks Refuse Service", "Ocasio Cortez Already Pushing For Gun Control After Deadly Shooting By Anti-Trump Lunatic At Synagogue", "NYT: Breaking gun control law is a “victimless crime,” assuming you are black"]}
{"comp": "C_ER", "month": "Jun", "feats": "bow", "test": 0.7549, "summ1": ["Chicago weekend gun violence injures 47, kills 4", "Parkland deputy arrested, charged for failing to act during shooting", "Virginia governor calls special session on gun control after attack", "Democratic debate: 10 candidates discuss immigration, gun control, health care in first night"], "summ2": ["REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "More Gun Control: Trump Says He’s “Seriously” Considering Banning Silencers", "If Elected Kamala Harris Wants to Change Federal Gun Laws “By Presidential Fiat”", "On Second Night of Presidential Debate Dems Supported Massive Gun Control"]}
{"comp": "C_L", "month": "Jul", "feats": "bow", "test": 0.7534, "summ1": ["63 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "Armed Utah teachers practice responding to school shootings", "12 people shot at old timers' day party in Brooklyn, New York", "Wrentham man was making home-assembled AR-15 style firearms, state police say; Rifles, ammunition and bump stocks seized"], "summ2": ["Truck attacks -- a frightening tool of terror, with a history", "Virginia held a special legislative session to address gun control. It was a mess.", "At the Democratic Debate, Pete Buttigieg Addresses the Age Issue", "Gilroy Garlic Festival shooting: Gunman opens fire during the last day of this annual California festival."]}
{"comp": "C_R", "month": "Sep", "feats": "sbert", "test": 0.7515, "summ1": ["GOP faces new pressure to act on guns", "Trump eyes mental institutions as answer to gun violence", "Text - S.2449 - 116th Congress (2019-2020): Federal Firearm Licensing Act", "4 dead after Sunday shooting in Beaumont's South End"], "summ2": ["O’Rourke’s False Claims About Texans’ Interest In Abandoning AR-15s", "Democrats don’t want red flag laws applied to gang members", "You’ll Never Guess Who Chicago’s Mayor is Blaming for Gun Control’s Failures", "Trump Will Announce Gun Bills as Early as This Week. Is the Second Amendment Safe?"]}
{"comp": "ER_RC", "month": "Jul", "feats": "sbert", "test": 0.7515, "summ1": ["CEO Ed Stack is okay with Dick’s Sporting Goods’ $150M loss from gun control stance", "GANGLAND: Chicago Mayor Blames INDIANA for City’s Unprecedented Gun Violence", "Tacoma ICE Facility Terror Attacker IDed as Antifa Activist", "California has all the gun laws gun grabbers want, but Democrats call for (surprise!) more gun laws in wake of Gilroy shooting"], "summ2": ["Virginia County Stands Up to Gun Control", "Why did a 74-year-old substitute teacher’s gun discharge in an Alabama 1st-grade classroom?", "US reels after shootings leave five dead, dozens injured", "Gun ban debate leads board to ask Ottawa police for report on how to curb gun violence"]}
{"comp": "C_ER", "month": "Jul", "feats": "sbert", "test": 0.7511, "summ1": ["Florida Democrats criticize state’s appeal of gun preemption ruling", "Norfolk Police engage with the community on gun violence", "12 shot, 2 fatally in Fourth of July gun violence across Chicago", "North Side Shelter Employee Fatally Shot"], "summ2": ["MAGA BEAUTY Stripped Of Miss MI Title Over Refusal To Wear Hijab…Tweet Sharing Stats About Black On Black Gun Violence", "9 Killed & Four Dozen Injured In Gun-Controlled Chicago, Liberal Narrative Goes Bust (Details)", "Tacoma ICE Facility Terror Attacker IDed as Antifa Activist", "California has all the gun laws gun grabbers want, but Democrats call for (surprise!) more gun laws in wake of Gilroy shooting"]}
{"comp": "C_L", "month": "May", "feats": "sbert", "test": 0.7483, "summ1": ["Juvenile suspect in STEM School Highlands Ranch shooting charged as adult", "33 shot, 5 fatally, in Chicago Memorial Day weekend gun violence", "Swiss voters approve stricter gun control laws to fit with EU rules: national broadcaster", "Gun control takes centre stage in 2020 Democratic presidential race"], "summ2": ["Grieving Students Walk Out of Colorado School Shooting Vigil: ‘This Was Not About Us’", "Trump-loving Kentucky Republican shoots a TV in campaign rant against ‘illegals’ and black opponent", "Young People Call for End to Gun Violence as Shootings Surge in New Haven", "Miami Cop Who Accidentally Shot Publix Shopper Happens to be a Firearms Instructor"]}
{"comp": "C_ER", "month": "Mar", "feats": "sbert", "test": 0.747, "summ1": ["UPDATE 1-NZ PM Ardern targets gun reform laws after weekend of mourning", "Christchurch mosque shootings: Accused killer smirked as he appeared in court", "New Hampshire lawmakers consider 'red-flag' gun control bill", "Montgomery County students walkout of class to push for stricter gun laws"], "summ2": ["Gun Control After New Zealand Shooting: Why it Won’t Work Here. May Not be Working There.", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops.", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill", "CNN Talking Heads Caught in a Downright Lie"]}
{"comp": "ER_RC", "month": "Feb", "feats": "sbert", "test": 0.7431, "summ1": ["Democrats Give a Preview of the Gun Control You’re Going to Get When Trump is Out", "WATCH: CNN's Chris Cuomo Claims Republicans WANT Illegal Aliens to Kill American Citizens So They Can Talk About Immigration", "[Warning] House Dems pass radical anti-gun legislation", "Another Gladio-style Mass Shooting Outside of Chicago to Push Gun Control; 5 Cops Injured – The Millennium Report"], "summ2": ["Trump referred to ‘gun violence’ in his Parkland remembrance. Hours later, he changed it to ‘school violence.’", "One Deadly Drug Raid and Two Red Herrings", "Gun measure inspired by slain Utah student stalls at Capitol", "Shock as gunman kills 5 at Aurora plant: 'I’ve seen it on the news happening someplace else. But never here in Aurora.'"]}
{"comp": "ER_L", "month": "Jan", "feats": "sbert", "test": 0.7416, "summ1": ["Harris Urges Gun Control: Put Members of Congress in a Locked Room With Autopsy Photos of Babies", "Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "European Private Gun Ownership Rises 32%", "Full Court Press for Your Guns ⋆ Conservative Firing Line"], "summ2": ["'I Don't Like Laws': UCF Student Arrested For Having Illegally Modified AR-15 Rifle on Campus, Police Say", "6 Mass Shootings In 4 Days, And Americans Didn’t Even Notice", "Trump’s judicial nominees have declared war on abortion rights and gun control.", "Amid shutdown, House Democrats push forward with sensible gun safety legislation"]}
{"comp": "L_R", "month": "Jun", "feats": "sbert", "test": 0.7415, "summ1": ["NRA dumps its ad firm, TV crew and Dana Loesch", "Booker and Warren Make Case for Gun Control Reform: 'We're Not Helpless to Stop' It", "Colorado school shooting suspect targeted those who mocked him, police say", "Mitch McConnell is the second worst human being on the planet"], "summ2": ["Two teen boys murdered in south London 12 minutes apart and three stabbed in Clapham", "Sorry Mr. President, But Your Lies About America’s Gun Laws Were, In Fact, Lies", "VA Legislator Suggests Measure That May Actually Impact Gun Violence", "Ohio Gun Control Group Proposes Universal Background Checks"]}
{"comp": "ER_L", "month": "Jul", "feats": "bow", "test": 0.7394, "summ1": ["MAGA BEAUTY Stripped Of Miss MI Title Over Refusal To Wear Hijab…Tweet Sharing Stats About Black On Black Gun Violence", "3 dead 12 hurt at Garlic Festival, 9 dead 39 wounded in Chicago", "Democratic Congressman Introduces Gun Control Scheme To Allow Cities To Trample All Over Second Amendment Rights", "Civil Disobedience/Noncompliance Are Damaging"], "summ2": ["On-Duty Texas Police Officers Wore Pro-Trump Hats. That's A Problem.", "At the Democratic Debate, Pete Buttigieg Addresses the Age Issue", "Gilroy Garlic Festival shooting: Gunman opens fire during the last day of this annual California festival.", "Black Lives Matter activists respond to the NRA's terrifying propaganda ads"]}
{"comp": "ER_LC", "month": "May", "feats": "sbert", "test": 0.7383, "summ1": ["STEM Students Walk Out After Dem Vultures Turn Prayer Vigil Into Anti-Gun Campaign Event", "Booker's outrageous gun control scheme ignores second amendment right", "The Political Insider", "Moonbattery Does Suppressing Gun Rights Cure Mass Shootings?"], "summ2": ["The Supreme Court’s Worst Decision of My Tenure", "Teen Killed, Many Critical As 2 Fellow Pupils Open Fire In US School", "Florida to Let Teachers Carry Guns. Will Black Students Pay the Price?", "Justine Damond: US city of Minneapolis pays family $20m"]}
{"comp": "ER_LC", "month": "Mar", "feats": "bow", "test": 0.7377, "summ1": ["New Zealand is Ready to Double Down on Gun Control", "North Carolina County Declares ‘Gun Sanctuary’ Status", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops. ⋆ Conservative Firing Line", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill"], "summ2": ["Father of Sandy Hook victim latest apparent suicide after deadly school shootings", "5 people wounded Tuesday in gun violence across Chicago", "The NRA Coached An Australian Anti-Immigration Party In Fighting Gun Control Laws", "NZ bans types of semi-automatic weapons, high capacity magazines after mass shooting"]}
{"comp": "R_RC", "month": "Sep", "feats": "sbert", "test": 0.7375, "summ1": ["The Classical Tyranny of the Left’s Gun Policy", "Ocasio-Cortez Attacks Dan Crenshaw On Guns, Accuses His Friends Of Being Criminals", "If you think you support red flag gun laws, listen to Jim Jordan talking about them", "WARMINGTON: Illegal guns have become easy to buy in Toronto"], "summ2": ["Masked gunman killed by police in wild Brooklyn shootout", "After El Paso and Odessa shootings, even Texas GOP leaders appear ready to talk about gun control", "New Zealand tightens gun laws again after mosque massacre", "Federal election 2019 roundup: 'Trudeau is not dressed as Aladdin, he’s dressed as Aladdin doing blackface''"]}
{"comp": "L_RC", "month": "Jul", "feats": "sbert", "test": 0.7371, "summ1": ["State gun laws aren't enough", "The “Pro-Life” Movement Is Silent About Children Dying at the Border", "At Least 3 Killed, 15 Wounded By Gunman At California’s Gilroy Garlic Festival", "With a straight face, GOP leader says party was ‘respectful’ of Obama"], "summ2": ["New Zealand struggles to round up banned firearms under new gun control law", "Gilroy Garlic Festival gunman killed, manhunt underway for ‘second individual’", "July 6 Letters: Gun laws, press coverage and the U.S. Census", "Gun ban debate leads board to ask Ottawa police for report on how to curb gun violence"]}
{"comp": "C_R", "month": "Feb", "feats": "sbert", "test": 0.7365, "summ1": ["School massacre 1 year later: A time to remember the victims", "House passage of gun safety bills reflects political shift", "Aurora shooting: 5 dead, multiple wounded including officers at Henry Pratt Company; gunman Gary Martin also dead", "Stevens County sheriff vows to ignore voter-approved Initiative 1639"], "summ2": ["House and Senate Democrats Introduce Federal ‘High Capacity’ Magazine Ban Bill", "Chicago Mayor Candidate Plans to Sue Wisconsin, Indiana Over Less Restrictive Gun Laws", "Police: Aurora Shooter Was Not Allowed to Own Firearms Due To Criminal Past", "U.S. House of Representatives Passes Extreme Gun Control Bill"]}
{"comp": "L_R", "month": "Feb", "feats": "sbert", "test": 0.7339, "summ1": ["Oregon may lower the voting age to 16", "This vulnerable GOP senator just stood up to Trump — and gave an ominous warning to other Republicans", "In the year after Parkland, there was nearly one mass shooting a day", "GOP Lawmaker Just Proved How Disgusting Republicans Are At First Gun Control Hearing In 8 Years"], "summ2": ["House and Senate Democrats Introduce Federal ‘High Capacity’ Magazine Ban Bill", "Chicago Mayor Candidate Plans to Sue Wisconsin, Indiana Over Less Restrictive Gun Laws", "Police: Aurora Shooter Was Not Allowed to Own Firearms Due To Criminal Past", "U.S. House of Representatives Passes Extreme Gun Control Bill"]}
{"comp": "ER_L", "month": "Mar", "feats": "sbert", "test": 0.7336, "summ1": ["Gun Control After New Zealand Shooting: Why it Won’t Work Here. May Not be Working There.", "John Podesta Was In New Zealand Days Prior To The Mosque Terror Attacks", "North Carolina County Declares ‘Gun Sanctuary’ Status", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill"], "summ2": ["Less than 24 hours after mass shooting at mosques, New Zealand vows to ban semi-automatic rifles", "Being the anti-Trump isn't enough for Democratic candidates", "Male Republican says mom-led gun safety advocacy group needs to ‘get over themselves’", "28 Parkland Students Traveled to New Zealand to Attend a Summit on Youth Activism"]}
{"comp": "C_L", "month": "Sep", "feats": "sbert", "test": 0.7332, "summ1": ["McConnell wants Trump support before pledging to take up gun control", "Looser gun laws go into effect in Texas one day after mass shooting", "NRA slams Walmart's 'shameful' change to gun policies", "36 shot, 7 fatally, in Chicago Labor Day weekend violence"], "summ2": ["Debra Messing Urges Donald Trump to Focus on Gun Reform", "Dan Crenshaw Complains That Gun Control Means He Can't Lend Guns To His Buddies", "Combat the Climate Crisis", "2020 Candidates Raise Gun Control Issue After Odessa: ‘This Is F*cked Up!’"]}
{"comp": "LC_R", "month": "Mar", "feats": "sbert", "test": 0.7322, "summ1": ["The bump stock ban is just days away. What will owners do?", "New Zealand Prime Minister targets gun reform laws after weekend of mourning", "New Zealand mosques: Several dead after shootings in Christchurch", "Gun control: Gabby Giffords' activism is symbolic of the Democratic Party's shift on guns"], "summ2": ["Did USA Today Admit Gun Control Laws Aren’t Enforced?", "CO Logan County Sheriff Brett Powell: Fund Mental Health Instead of Taking Away Rights", "In ‘Emotional’ Meeting After ‘Embarrassing’ Gun Bill Vote, Democrats Learn Their 2018 Blue Wave Isn’t So Blue", "Shooter opens fire in New Zealand and ‘injures four people’ as witnesses say they heard ’20 shots’"]}
{"comp": "LC_R", "month": "Apr", "feats": "sbert", "test": 0.7296, "summ1": ["New Zealand passes new gun laws 26 days after mass shooting attacks on mosques", "Teacher 'would have taken the bullet' for Jackson middle schooler killed over a bike", "“Massive manhunt” underway for Florida woman “infatuated with Columbine” now armed with shotgun in Colorado", "The U.S. government's counterterrorism center doesn't track white supremacists. Some think it should."], "summ2": ["NRA Is Right About Violence Against Women Act: The House Version of the Reauthorization Bill Includes New Gun Restrictions That Sweep Too Broadly", "Several injured after 'gun man opens fire' in a San Diego Synagogue", "NRA, two other pro-Second Amendment groups file suit against Seattle's new 'gun violence tax'", "Swalwell: I Will Jail Those Who Defy My Gun Grabbing Agenda"]}
{"comp": "ER_RC", "month": "Mar", "feats": "sbert", "test": 0.7273, "summ1": ["Gun Control After New Zealand Shooting: Why it Won’t Work Here. May Not be Working There.", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops.", "CNN Talking Heads Caught in a Downright Lie"], "summ2": ["Christchurch mosque shooting gun laws John Howard New Zealand", "Dori: Man arrested in Seattle arson case a homeless frequent offender", "Bump Stock Rule Puts Constitution In The Crosshairs", "Mali violence: Men disguised as hunters kill at least 134 Muslim farmers"]}
{"comp": "L_R", "month": "Jan", "feats": "bow", "test": 0.7268, "summ1": ["Gun Violence Against Women In 2019 Has Barely Made The News Cycle", "David Hogg Says The 'National Emergency' Donald Trump Should Care About is Gun Violence, Not Border Wall", "The NRA may have illegally coordinated with GOP Senate campaigns", "A suspect killed five people inside a SunTrust bank branch in Florida. Just one employee escaped."], "summ2": ["DOJ Confirms: Guns Committed In Crimes Come From Black Market", "U.S. Supreme Court (Finally) Takes Another Second Amendment Challenge to a Gun Control Law", "Republicans Torpedo Virginia Democrats' Anti-Gun Package, But This Is Only Round One", "DA calls Pittsburgh Gun-Control Plan Illegal, City Council Moves Forward Anyway"]}
{"comp": "ER_L", "month": "Apr", "feats": "bow", "test": 0.7267, "summ1": ["Eric Swalwell, Notorious for Threatening Nuclear Attacks Against Gun Owners, Obsessing Over Trump-Russia, and Saying ‘Boo Hoo’ About Threats to a Republican Woman, Is Running for President", "Lindsey Graham is Now Drafting His Gun Confiscation Bill", "NOLA Murder Rate Remains Steady Despite New Gun Control Laws", "AOC Uses Synagogue Shooting to Call for Universal Gun Registration"], "summ2": ["The NRA Wants to Stop Congress From Renewing the Violence Against Women Act", "New polling shows that even Fox News viewers support universal background checks for guns", "FBI Arrests Leader Of Right-Wing Anti-Immigrant Militia In New Mexico", "Rep. Eric Swalwell to Trump After CA Synagogue Shooting: ‘Spare Us Your Thoughts and Prayers’"]}
{"comp": "LC_R", "month": "May", "feats": "sbert", "test": 0.7265, "summ1": ["Voters in Switzerland approve stronger gun control laws by nearly two-thirds despite resistance", "Two men armed with loaded guns ram police car: Police", "He has painted some of the city’s youngest victims of violence. In recent days, he added one more.", "At Least 7 Students Shot, 2 Suspects in Custody at Denver School Just Miles from Columbine"], "summ2": ["Joe Biden Joins the Goofy Brigade: In Lieu of More Gun Control for Colorado, He Calls the Offering of Prayers ‘Outrageous’", "Cory Booker's Gun Control Agenda Is Out...And It Looks Like Jailing Law-Abiding Gun Owners Is In It", "LA Legislators Make Strong Stance In Defense Of Second Amendment", "NZ Gun Grabbers Not Content With Assault Weapon Ban"]}
{"comp": "L_RC", "month": "Apr", "feats": "sbert", "test": 0.7264, "summ1": ["Is Your Bank Profiting From Gun Violence?", "Grammy-nominated US rapper Nipsey Hussle shot dead", "SPLC Action Fund: Florida bill seeking to arm teachers with guns jeopardizes school safety", "If elected president, Kamala Harris vows to take action on gun control, with or without Congress"], "summ2": ["‘He is messed up,’: Gang member’s granny doubtful his life will change", "Tough New Zealand gun laws easily pass first hurdle", "As cold weather breaks, violence returns: 24 shot in 30 hours over warmest weekend this year", "House move roils gun control debate at Minnesota Legislature"]}
{"comp": "LC_R", "month": "Jan", "feats": "bow", "test": 0.726, "summ1": ["The Democratic Party's public enemy No. 1: Howard Schultz", "3 killed, 4 injured in California bowling alley shooting", "Attempted robber killed, 3 others wounded in Tuesday gun violence", "Trump wall: President addresses nation on border 'crisis'"], "summ2": ["Barbra Streisand Wonders How Many Have To Die Before Gun Control", "Marco Rubio to Introduce Federal Red Flag Bill With Support From Republicans and Democrats", "Virginia Governor Announce Anti-Gun Legislation", "Supreme Court to hear challenge to New York City gun ordinance"]}
{"comp": "L_RC", "month": "Mar", "feats": "sbert", "test": 0.7258, "summ1": ["These students have developed technology to protect their high schools during a shooting", "The Potency of Republicans’ Hamburger Lie", "Less than 24 hours after mass shooting at mosques, New Zealand vows to ban semi-automatic rifles", "US Congressional Candidate Warned of the ‘Destructive’ Gay ‘Lifestyle’ and ‘Homosexual Recruitment’ of Children"], "summ2": ["Christchurch mosque shooting gun laws John Howard New Zealand", "Problems with Pittsburgh’s proposed gun control ordinance", "Bump Stock Rule Puts Constitution In The Crosshairs", "Mali violence: Men disguised as hunters kill at least 134 Muslim farmers"]}
{"comp": "ER_RC", "month": "Jan", "feats": "sbert", "test": 0.7258, "summ1": ["Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Pelosi's 'Commonsense' Gun Bill Is Not Sensible", "Colorado Gun Owners Ignoring New Assault Weapons Ban", "When Guns Are Outlawed, Only Outlaws Will Have Guns"], "summ2": ["Police search for gunman after one killed, another injured in Orland Park mall shooting", "'Sicario' review: On the border between the U.S. and Mexico, money talks and violence rules", "Judge acquits 3 Chicago cops of covering up Laquan McDonald's killing, backing police on each disputed point", "Gun control bills die in Richmond as Republican-led committees vote them down"]}
{"comp": "C_L", "month": "Apr", "feats": "sbert", "test": 0.7252, "summ1": ["New Zealand votes to amend gun laws after Christchurch attack", "7 Shot, 1 Killed At Cookout In West Baltimore: Police", "Father shot 2-year-old boy in the face intentionally, prosecutors say", "House move roils gun control debate at Minnesota Legislature"], "summ2": ["How a ‘missing’ movement made gun control a winning issue", "NRA Taunts Father Of Child Murdered At Marjory Stone Douglas High School", "Rep. Eric Swalwell to Trump After CA Synagogue Shooting: ‘Spare Us Your Thoughts and Prayers’", "If elected president, Kamala Harris vows to take action on gun control, with or without Congress"]}
{"comp": "ER_RC", "month": "Aug", "feats": "sbert", "test": 0.7251, "summ1": ["Dem Rep. Tim Ryan: ‘Ground Shifting’ Under Trump, McConnell on Gun Control", "Seth Rogen on ‘The Hunt’ Cancellation: ‘Sucks When an Evil World Leader Gets Your Movie Canceled’", "REPORT: El Paso Shooting ‘Gang-Related Terrorism,’ Say Police", "Must See: 5 Specific Times Democrats Wanted To Confiscate Your Guns"], "summ2": ["Seven wounded in two overnight shootings in Toronto", "Hundreds of Gun Control Bills Have Been Introduced Since Sandy Hook. Why Has Nothing Changed?", "Trump reassures NRA on gun control talks", "New Zealand buys back 10,000 firearms returned after Christchurch attack"]}
{"comp": "C_ER", "month": "Jan", "feats": "bow", "test": 0.725, "summ1": ["Supreme Court to hear biggest gun rights case since 2010", "Stoneman Douglas commission calls for arming teachers, more school security spending in first report to state leaders", "Dems to introduce gun background checks bill on anniversary of Gabby Giffords shooting", "Woman shot in Ames was unintended target, police say; suspect held on $500K cash"], "summ2": ["Kamala Harris Urges Gun Control: Put Members of Congress in Locked Room With Autopsy Photos of Babies", "Updated federal report explodes ‘gun show loophole’ myth ⋆ Conservative Firing Line", "Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Illinois: Gun Grabbers Introduce Two New Bills in One Day"]}
{"comp": "C_L", "month": "Jan", "feats": "sbert", "test": 0.7245, "summ1": ["Orland Park mall shooting: Victim ID'd as police search for gunman", "Trudeau blocks candidacy of ex-MP's wife over bullying complaints", "Supreme Court to hear biggest gun rights case since 2010", "More gun control bills announced as Va. lawmakers get to work"], "summ2": ["Donald Trump is walking into a ‘trap’ by threatening to declare a ‘national emergency’ to get his border wall", "NRA now officially part of Robert Mueller’s investigation into Russian election influence", "'Black Muslims' Made My Son Do It, Says Mother of Pro-Trump Boy Who Mocked Native American Veteran", "A researcher explains the sad truth: we know how to stop gun violence. But we don't do it."]}
{"comp": "ER_LC", "month": "Apr", "feats": "sbert", "test": 0.7236, "summ1": ["Davi: Trump vs. Hillary: Merry Christmas or May the Force Be With You? The Battle for the Soul of America", "Anti-Gun Candidate Arrested For Killing Her Campaign Treasurer", "Gun Controllers Demand Banks Refuse Service", "Lindsey Graham is Now Drafting His Gun Confiscation Bill"], "summ2": ["New Zealand passes new gun laws 26 days after mass shooting attacks on mosques", "‘We have to keep kids inside’: Father fears for safety of his son after Harvey triple shooting", "Officials in Colorado search for woman 'infatuated' with Columbine shooting", "The NRA’s finances should be investigated. Its actions prove why."]}
{"comp": "ER_L", "month": "Jan", "feats": "bow", "test": 0.7225, "summ1": ["Kamala Harris Urges Gun Control: Put Members of Congress in Locked Room With Autopsy Photos of Babies", "Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Senate Gets Dueling Gun Proposals, Dems Demand ‘Assault’ Ban, GOP Plans ‘Reciprocity’", "DOJ STUDY: Gun Control Laws Won’t Work Because Criminals Get Their Guns Illegally"], "summ2": ["Sebring, Florida, bank shooting: what we know", "Dem. Congressman Announces New Universal Background Check Legislation to Help Curtail Gun Violence", "Prosecutors name the second suspect in Jazmine Barnes' killing", "Fact-checking Trump's immigration speech"]}
{"comp": "ER_RC", "month": "Sep", "feats": "sbert", "test": 0.7221, "summ1": ["Watch: Conservative Reporter Calls Out The Left’s Climate Hypocrisy, Gun Control Hysteria", "AR-15's Are Flying Off The Shelf After AZ Gun Store Introduces The 'Beto Special'", "France: One Killed, Nine Wounded by Knife-wielding Afghan Migrant", "Chicago Mayor Shoots Herself In The Foot Trying To Prove Her FAILED Gun Control Laws Work"], "summ2": ["Justin Trudeau pledges tougher gun control in attempt to get campaign back on track", "Shots fired: San Francisco declares NRA ‘domestic terrorists’", "After El Paso and Odessa shootings, even Texas GOP leaders appear ready to talk about gun control", "Girl shot by stray bullet inside home dies on 12th birthday"]}
{"comp": "R_RC", "month": "Apr", "feats": "sbert", "test": 0.7213, "summ1": ["Avid Gun Control Congressman May Join Dem 2020 Field Next Week, Report Says", "This Sheriff Says He Will Go to Prison Before He Will Enforce Gun Laws", "The Second Amendment Stories the National Media Fail to Report...or Get Completely Wrong", "Gun Control Advocates Want Banks to Refuse Service to Gun Companies"], "summ2": ["Florida Senate approves bill to arm teachers", "A weekend of American gun violence again reveals our nation's great shame", "Tough New Zealand gun laws easily pass first hurdle", "As cold weather breaks, violence returns: 24 shot in 30 hours over warmest weekend this year"]}
{"comp": "R_RC", "month": "May", "feats": "sbert", "test": 0.7209, "summ1": ["CO shooters are a transgender & a boy who hates Trump & Christians", "Ohio House Democrats Unveil Package of Gun-Control Laws", "Column Claims Adults Don’t Face Mass Shootings, Ignores Reality", "Democrats Like Cory Booker Who Push Gun Control are Failing in the Polls"], "summ2": ["At least 7 injured in shooting at Colorado charter school, 2 suspects in custody", "1 year after Santa Fe shooting, Texas shuns tougher gun laws", "Minneapolis to pay $20M to family of woman shot dead by cop", "Swiss voters OK tighter gun laws, lining up with EU"]}
{"comp": "LC_R", "month": "Sep", "feats": "sbert", "test": 0.7205, "summ1": ["Republican activist who ran for Congress: Trump stole my party and my heart is breaking.", "John & Mary Sisk Family: 5 Fast Facts You Need to Know", "FBI alert cites mass shooting threat at Hawaii State Capitol", "Lines harden on gun policy after West Texas rampage"], "summ2": ["Chicago Mayor to Ted Cruz after Gun-Control Comments: 'Keep Our Name Out of Your Mouth'", "‘Surprising twist’! Vox accidentally serves up an ‘odd endorsement of the 2nd Amendment’ in global data about privately held firearms", "Beto O’Rourke Is a Disaster for the Gun-Control Movement", "If you think you support red flag gun laws, listen to Jim Jordan talking about them"]}
{"comp": "ER_RC", "month": "Apr", "feats": "sbert", "test": 0.7201, "summ1": ["Kamala Harris Lies About Gun Violence Statistics; Tripled the True Data!", "Lindsey Graham Shoots America In The Back, Begins Drafting Gun Confiscation Bill", "Gun Controllers Demand Banks Refuse Service", "Ocasio Cortez Already Pushing For Gun Control After Deadly Shooting By Anti-Trump Lunatic At Synagogue"], "summ2": ["Albuquerque police focus on countering gun violence", "Court Rules That Medical Marijuana Card Holders Can't Buy Firearms", "Gogglebox Australia recap: Cast lashes Pauline Hanson over NRA scandal", "House move roils gun control debate at Minnesota Legislature"]}
{"comp": "C_L", "month": "Jun", "feats": "bow", "test": 0.7191, "summ1": ["'I'm tired of seeing people's families hurt' | DC residents rally to end gun violence", "Man in country illegally charged with 11 murders in Texas", "Over 30 shot, 3 fatally, as weekend violence grips Chicago", "Virginia Governor Announces Special Session on Gun Control"], "summ2": ["NRA rallies support for Oregon state senator who threatened to shoot law enforcement", "Mayor Pete gets emotional talking to second grader about gun control", "New details emerge in the Virginia Beach mass shooting that left 12 people dead", "Trump says ‘vetting’ gun buyers would have made Texas shooting worse"]}
{"comp": "ER_L", "month": "May", "feats": "sbert", "test": 0.7179, "summ1": ["Dems Turn Vigil for Fallen Student into Anti-Gun Rally", "Khan’s London: 500 Knives Seized at Family Court in Just Four Months", "Booker's outrageous gun control scheme ignores second amendment right", "Moonbattery Does Suppressing Gun Rights Cure Mass Shootings?"], "summ2": ["‘This Was Not About Us’: Grieving Students Walk Out of Colorado School Shooting Vigil", "University of North Carolina at Charlotte shooting: what we know", "Trump Org. Blames Zika, Gun Violence for “Severely Underperforming” Hotels", "New NRA President Says Georgia Democrat Only Won Her Seat in Congress Because She’s Black"]}
{"comp": "R_RC", "month": "Feb", "feats": "sbert", "test": 0.7174, "summ1": ["Police: Aurora Shooter Was Not Allowed to Own Firearms Due To Criminal Past", "U.S. House Passes Extreme Gun Control Bill, President Threatens VETO", "Is a Push for Aggressive Gun Control on the Horizon for North Carolina?", "Media Won’t Admit Walls Work—Study Shows Otherwise"], "summ2": ["After Synagogue Attack, Pittsburgh’s Push for Stricter Gun Laws Sparks Backlash", "Bogus gun research underpins calls for overreaching gun control", "The Aurora victims' stories: Intern's 1st day on the job, a family patriarch, 'incredible' dad, Mississippi State fan", "Aurora mass shooting: 6 dead, including gunman, and 5 officers wounded in attack at Illinois manufacturing firm"]}
{"comp": "C_L", "month": "Jun", "feats": "sbert", "test": 0.7172, "summ1": ["Chicago weekend gun violence injures 44, kills 4", "Virginia governor calls special session on gun control after attack", "Democrats set to use McConnell's legislative graveyard against him", "1 Tuesday Night in St. Paul: 20 Gunshots, 1 Person Injured, 3 Homes Struck, 6 Children Caught in Crossfire"], "summ2": ["Pelosi Reminds America That McConnell Is Blocking Gun Control After Virginia Beach Shooting", "NRA’s internal civil war getting hotter with new lawsuits and accusations", "Can Sen. Doug Jones Do It Again In Deep Red Alabama?", "All but one of the 12 killed in the Virginia Beach shooting were city employees, official says"]}
{"comp": "ER_LC", "month": "Jan", "feats": "bow", "test": 0.7166, "summ1": ["Khan’s London: Violent Crime on Underground Up 43 Percent", "Tlaib Tirade, Impeachment Papers, Gun Control Promises,", "Will the Democrat Push for Gun Control Backfire? ⋆ Conservative Firing Line", "BREAKING: Oregon To Become STRICTEST State In America For Gun Laws After Announcing New Legislation… NOT GOOD"], "summ2": ["Uncontacted tribes face 'extinction' under Brazil's new president, advocates say", "House Democrats Pledge Passage Of Expanded Gun Background Checks Bill", "Attempted robber killed, 3 others wounded in Tuesday gun violence", "Florida Gunman Killed All 5 Women in Bank in 'Random' Mass Shooting, Police Say"]}
{"comp": "ER_L", "month": "Feb", "feats": "bow", "test": 0.7161, "summ1": ["Warns 'Next Dem President Can Declare a Gun Violence Emergency'", "The House Just Passed A “Sweeping” Gun Control Bill. Tomorrow They Vote On Another", "Liberal Pulls Gun Because He Allegedly Hated Man's MAGA Hat", "Washington Sheriffs Take Stand Against Gun Control, Refuse to Enforce Bad Law"], "summ2": ["Matt Gaetz's Pro-Wall Rant Shows How Republicans Will Avoid the Issue of Gun Violence", "WATCH: Nancy Pelosi Says ‘A Democratic President Can Declare a National Emergencies As Well’ About the Crisis of Gun Violence", "Parkland, One Year Later: Fred Guttenberg, a Father-­Turned-Activist", "1 Dead, 4 Police Wounded In Shooting At Factory In Illinois"]}
{"comp": "LC_R", "month": "Jun", "feats": "bow", "test": 0.716, "summ1": ["Donald Trump calls London Mayor Sadiq Khan a 'disaster' after spate of killings in British capital", "Florida woman charged after giving husband’s guns to police", "Boston Area Focuses On Gun Violence During National Awareness Weekend", "Virginia Beach shooting: 12 dead as city mourns 'the most devastating day'"], "summ2": ["2020 Dems call for action against 'gun violence' after Virginia Beach shooting", "New Jersey: Assembly Committee Passes Another Gun Control Package", "EDITORIAL: Forget handgun bans, focus on criminals", "Obama Speaking to Brazilians about gun laws in the US - Crime Prevention Research Center"]}
{"comp": "L_RC", "month": "Feb", "feats": "sbert", "test": 0.7158, "summ1": ["5 Young Black Activists Making History Right Now", "Florida Rep. Matt Gaetz Tries to Kick Parkland Parent out of Gun Violence Hearing", "GOP Lawmaker Just Proved How Disgusting Republicans Are At First Gun Control Hearing In 8 Years", "Trump will declare a national emergency — after signing bipartisan spending bill: McConnell"], "summ2": ["After Synagogue Attack, Pittsburgh’s Push for Stricter Gun Laws Sparks Backlash", "Two proposed Utah gun laws — including 'Lauren's Law' — stall, while others advance to House floor", "Aurora's 'Cross Man' travels the country honoring lives lost to gun violence. Now he's doing it in his hometown.", "Shock as gunman kills 5 at Aurora plant: 'I’ve seen it on the news happening someplace else. But never here in Aurora.'"]}
{"comp": "L_RC", "month": "Jun", "feats": "bow", "test": 0.7156, "summ1": ["Frank Rich: Harris’s Debate Performance Should Scare Trump", "A pro-Trump subreddit is full of calls for violence in support of Oregon Republicans", "Thoughts and prayers: NRA's second in command suspended amidst accusations of a coup", "All but one of the 12 killed in the Virginia Beach shooting were city employees, official says"], "summ2": ["Needles declared itself a “2nd Amendment Sanctuary” city; wants exemption to some state gun laws", "Democrats Reveal Their Hostility to the Second Amendment", "At least 12 people killed in Virginia Beach mass shooting; suspect dead", "Officials: 5-Year-Old Shoots Toddler in Head, Uncle Charged"]}
{"comp": "ER_RC", "month": "Jul", "feats": "bow", "test": 0.715, "summ1": ["MAGA BEAUTY Stripped Of Miss MI Title Over Refusal To Wear Hijab…Tweet Sharing Stats About Black On Black Gun Violence", "3 dead 12 hurt at Garlic Festival, 9 dead 39 wounded in Chicago", "Democratic Congressman Introduces Gun Control Scheme To Allow Cities To Trample All Over Second Amendment Rights", "Civil Disobedience/Noncompliance Are Damaging"], "summ2": ["California town wants to be a sanctuary — for gun owners", "Police fire officer who waited in hallway during Las Vegas massacre", "Va. Legislature abruptly ends gun session", "Stricter gun laws tied to fewer childhood gun deaths"]}
{"comp": "L_RC", "month": "Apr", "feats": "bow", "test": 0.7149, "summ1": ["20 years after Columbine, America sees roughly one mass shooting a day", "NRA busted giving Trump 9,259 times the legal limit: Bombshell campaign finance lawsuit", "157 Republicans, and 1 Democrat, Side With NRA as House Passes Updated Violence Against Women Act", "Ignoring gun policy used to be the safest bet for candidates. Now it’s a liability."], "summ2": ["Albuquerque police focus on countering gun violence", "New Zealand Shooters Back Gun Control After Massacre", "Here Is Why a Federal Judge Nixed California's Ban on 'Large Capacity Magazines'", "House move roils gun control debate at Minnesota Legislature"]}
{"comp": "C_R", "month": "Apr", "feats": "sbert", "test": 0.7141, "summ1": ["Gun-maker to ask Supreme Court to hear Sandy Hook appeal", "Police: Phoenix man kills 4 people, including wife, 2 young children", "House move roils gun control debate at Minnesota Legislature", "AP-NORC Poll: Bullying, not schools, blamed for shootings"], "summ2": ["CRS: Under 2 percent of gun crimes involve assault weapons", "Colorado Sheriff Says He Won’t Enforce ‘Red Flag’ Gun Control Law", "Hypocrite Much? Kamala Harris Admits To Owning A Gun For Personal Safety.", "Gun Control Advocates Want Banks to Refuse Service to Gun Companies"]}
{"comp": "R_RC", "month": "Jan", "feats": "sbert", "test": 0.7133, "summ1": ["Law for Thee But Not for Me: Pittsburgh Officials Defy DA’s Legal Advice in Gun Control Push", "Baltimore School Board Votes ‘No’ To Arming Officers In Schools", "Virginia Governor Announce Anti-Gun Legislation", "Why The Financial Assault On The 2A May Be Getting Worse"], "summ2": ["Police search for gunman after one killed, another injured in Orland Park mall shooting", "'Sicario' review: On the border between the U.S. and Mexico, money talks and violence rules", "Florida bank shooting suspect, who recently moved from Indiana, was fascinated with violence, ex-girlfriend says", "Gun control bills die in Richmond as Republican-led committees vote them down"]}
{"comp": "ER_LC", "month": "Aug", "feats": "sbert", "test": 0.7120000000000001, "summ1": ["Dem Rep. Tim Ryan: ‘Ground Shifting’ Under Trump, McConnell on Gun Control", "North Carolina College Student Planned To Commit Mass Murder; He Didn't See This Coming ⋆ Glad they caught him! ⋆ Flag And Cross 🇺🇸✟", "REPORT: El Paso Shooting ‘Gang-Related Terrorism,’ Say Police", "Must See: 5 Specific Times Democrats Wanted To Confiscate Your Guns"], "summ2": ["Gun control could be a defining issue for Democrats on the 2020 campaign trail", "'Oh well': Dayton mayor confused by Trump's criticism of how she described his visit", "California hotel employee 'prevents mass shooting'", "Calls for stricter gun control laws growing as America reels from two deadly mass shootings"]}
{"comp": "ER_LC", "month": "Sep", "feats": "sbert", "test": 0.7116, "summ1": ["Watch: Conservative Reporter Calls Out The Left’s Climate Hypocrisy, Gun Control Hysteria", "Trump Smashes Congress – Takes Away Dems’ September Game Plan", "AR-15's Are Flying Off The Shelf After AZ Gun Store Introduces The 'Beto Special'", "Chicago Mayor Shoots Herself In The Foot Trying To Prove Her FAILED Gun Control Laws Work"], "summ2": ["U.S. teenager shoots dead five family members in Alabama: police", "Editorial: Abbott's safety plan lacks resolve to prevent gun violence", "If E-Cigs Were Romaine Lettuce, They'd Be Off The Shelf, Vaper's Mom Tells Congress", "Lines harden on gun policy after West Texas rampage"]}
{"comp": "ER_LC", "month": "Feb", "feats": "sbert", "test": 0.7106, "summ1": ["Oscars: Celebrities Push Gun Control Surrounded by a Wall of 500 Armed Officers", "VETO THREAT: Trump Says He’ll Block Democrat Gun Control Scheme", "Washington Sheriffs Decline to Enforce Gun Control", "Bishop: Democrats Have Become ‘the Party of Infanticide’"], "summ2": ["Among top priorities are expanded background checks, gun violence report", "Illinois State Police acknowledge agency wrongly issued gun license to Aurora shooter", "Trump declares national emergency to bypass Congress over border wall funds – live news", "State of the Union: Democrats, Parkland parents rip Trump on guns"]}
{"comp": "L_R", "month": "Mar", "feats": "sbert", "test": 0.7101, "summ1": ["Indiana Teachers Shot “Execution-Style” With Pellets in Shooting Drill", "Midday open thread: Weak gun laws mean more mass shootings; non-Indian jewelry fakers indicted", "Christchurch massacre highlights lax New Zealand gun control laws", "Trump May Want to Be President Forever. Take the Threat Seriously."], "summ2": ["Media: New Zealanders are OK With Giving Up their Guns After Mosque Massacre", "Did USA Today Admit Gun Control Laws Aren’t Enforced?", "Bipartisan Attacks on the Second Amendment", "AOC Bullies Fellow Democrat House Members And Threatens Them. FOR REAL."]}
{"comp": "C_ER", "month": "May", "feats": "sbert", "test": 0.7087, "summ1": ["'A guitar case with guns made it into the school': DougCo commissioners allocate $10M toward school safety", "32 shot, 4 fatally in weekend shootings across Chicago", "Switzerland avoids clash with EU over gun laws", "Gun control takes center stage in 2020 Democratic presidential race"], "summ2": ["Colorado Students Walk Out On Dems Who Twisted Vigil Into Anti-Gun Platform", "Nolte: Debunking the Media’s Seven Latest Hysteria Hoaxes", "Anti-gun laws take hits in two states from three courts ⋆ Conservative Firing Line", "Moonbattery Does Suppressing Gun Rights Cure Mass Shootings?"]}
{"comp": "ER_RC", "month": "May", "feats": "sbert", "test": 0.7083, "summ1": ["Colorado Students Walk Out On Dems Who Twisted Vigil Into Anti-Gun Platform", "Cory Booker Compares the Fight for Gun Control to the Civil Rights Movement", "Russia hoax origins to be exposed as Trump authorizes AG Barr to declassify Russia probe documents", "Moonbattery Does Suppressing Gun Rights Cure Mass Shootings?"], "summ2": ["Boy killed, girl wounded in double-shooting near East Side elementary school", "Mayor Lightfoot must get Chicagoans to truly care about gun violence", "1 year after Santa Fe shooting, Texas shuns tougher gun laws", "Swiss voters appear set to align with EU on tighter gun laws"]}
{"comp": "R_RC", "month": "May", "feats": "bow", "test": 0.7072, "summ1": ["STEM students storm out, chant ‘mental health’ when gun-control activist, Dems politicize vigil for victims", "The Second Amendment Saved These Gun Owners’ Lives in April", "Cory Booker plans national gun registry", "Nevada: Omnibus Anti-Gun Bill Granted Waiver From Deadlines"], "summ2": ["Children run for their lives as gunman opens fire at basketball court", "Mayor Lightfoot must get Chicagoans to truly care about gun violence", "Gun-loving Swiss agree to harsher firearms control to avoid Schengen tensions", "Georgia teens made ‘kill list’ for school shooting plot: authorities"]}
{"comp": "LC_R", "month": "Feb", "feats": "sbert", "test": 0.7069, "summ1": ["Among top priorities are expanded background checks, gun violence report", "Illinois State Police acknowledge agency wrongly issued gun license to Aurora shooter", "School shooting victim hailed hero over gun control plea to teachers", "Intimidation, Pressure and Humiliation: Inside Trump’s Two-Year War on the Investigations Encircling Him"], "summ2": ["Washington Sheriffs Decline to Enforce Gun Control", "Huh: Despite Being Shot, Dems Blocked Steve Scalise From Testifying on Gun Violence", "New Mexico Background Check Bill Passes Despite Sheriff Protests", "FOIA Seeks ATF Documents after Technical Expert Admits ‘Machinegun’ Ruling Political"]}
{"comp": "ER_LC", "month": "Jul", "feats": "sbert", "test": 0.7068, "summ1": ["CEO Ed Stack is okay with Dick’s Sporting Goods’ $150M loss from gun control stance", "Children Taught to Hate: Thanks, Chicago", "Tacoma ICE Facility Terror Attacker IDed as Antifa Activist", "California has all the gun laws gun grabbers want, but Democrats call for (surprise!) more gun laws in wake of Gilroy shooting"], "summ2": ["‘Enough is enough’ — Democratic candidates respond to mass shooting at Gilroy festival", "Amid tragedy, anti-violence group continues with grand opening of pizza restaurant", "Walmart shooting in Mississippi: Police identify man who killed 2 and wounded 2", "Following the facts: The role of guns in suicide rates"]}
{"comp": "L_RC", "month": "Feb", "feats": "bow", "test": 0.7059, "summ1": ["WATCH: Nancy Pelosi Says ‘A Democratic President Can Declare a National Emergencies As Well’ About the Crisis of Gun Violence", "Parkland, One Year Later: Fred Guttenberg, a Father-­Turned-Activist", "Matt Gaetz's Pro-Wall Rant Shows How Republicans Will Avoid the Issue of Gun Violence", "The Most-Used Words in Trump's SOT"], "summ2": ["House Democrats examine ways to reduce gun violence", "UPDATE: 2 men, 2 teens arrested on drug, weapons charges in search of Champaign home", "A year after Parkland shootings, clamor for new gun restrictions has abated", "Police: Aurora attacker used gun he shouldn’t have owned"]}
{"comp": "C_L", "month": "Mar", "feats": "sbert", "test": 0.7059, "summ1": ["Judge tosses Chicago suburb's assault weapons ban", "Australia's One Nation sought funds from U.S. gun lobby: report", "‘Always happy;’ Community gathers for candlelight vigil in Dorchester to honor Jassy Correia, woman who was kidnapped from Boston nightclub", "Christchurch mosque shootings: Jacinda Ardern reveals more on changes to NZ's gun laws"], "summ2": ["Less than 24 hours after mass shooting at mosques, New Zealand vows to ban semi-automatic rifles", "Being the anti-Trump isn't enough for Democratic candidates", "What Happens to Survivors of Mass Shootings Like Las Vegas?", "Male N.H Legislators Don Pearls to Mock Gun Control Advocates"]}
{"comp": "ER_RC", "month": "Mar", "feats": "bow", "test": 0.7058, "summ1": ["Future Of Gun Control In Wake Of Muslim Massacre – DC Alert", "Next on the Gun Grab Agenda: HR 1263 Adds Semiautomatic Rifles and Shotguns to the National Firearms Act of 1986", "Maryland Sheriff on Gun Confiscation Bill: ‘We Will Not Comply’", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill"], "summ2": ["Any Study Of 'Gun Violence' Should Include How Guns Save Lives", "Melbourne boxing shooting: One shot dead at Kensington", "NZ adopts harsh gun control measures after Christchurch massacre… to cheers & jeers in US", "New Zealand prime minister says gun laws will change in response to terror attack"]}
{"comp": "L_LC", "month": "May", "feats": "sbert", "test": 0.7055, "summ1": ["Open thread for night owls: Gun control or climate crisis, the right-wing smears young activists", "The NRA Is Threatening An Activist Who Is Trying To Make America’s Kids Safer", "Highlands Ranch shooting: 1 student killed and 8 wounded after two suspects open fire near Columbine", "New NRA President Says McBath Only Won Race Because She’s A ‘Minority Female’"], "summ2": ["8 students injured, 2 suspects in custody after shooting at STEM School in Highlands Ranch", "Majority of Canadians want handguns and assault weapons banned: poll", "Florida to Let Teachers Carry Guns. Will Black Students Pay the Price?", "Justine Damond: US city of Minneapolis pays family $20m"]}
{"comp": "C_R", "month": "Mar", "feats": "sbert", "test": 0.7052, "summ1": ["PD: 17-year-old girl had baby with her when suspect opened fire", "New Zealand leader Jacinda Ardern targets gun reform laws after weekend of mourning", "Montgomery County students walkout of class to push for stricter gun laws", "Hanson's One Nation accused of begging U.S. gun lobby for cash to weaken Australia firearms laws"], "summ2": ["Pennsylvania Democrats Want To Register Your Guns", "All hell broke loose when Alexandria Ocasio-Cortez sent this tweet", "Did USA Today Admit Gun Control Laws Aren’t Enforced?", "MSNBC Host's Reason For Why We Should Ban AR-15s Blows Up In His Face"]}
{"comp": "C_ER", "month": "Jul", "feats": "bow", "test": 0.7048, "summ1": ["‘You’re Not Even Safe In Your Own Home’: 29-Year-Old Woman Struck By Stray Gunfire In Southwest Philadelphia, Police Say", "Gov. Northam calls for ‘common sense’ gun measures at Virginia church service", "43 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "12 people shot at old timers' day party in Brooklyn, New York"], "summ2": ["BREAKING: Miss World America Strips Conservative Activist Kathy Zhu of Miss Michigan Title Over Her Refusing to Wear Hijab", "'Borat’ Director Encourages Left to Arm Selves Against 'Maga People'", "3 dead 12 hurt at Garlic Festival, 9 dead 39 wounded in Chicago", "Civil Disobedience/Noncompliance Are Damaging"]}
{"comp": "L_R", "month": "Mar", "feats": "bow", "test": 0.7045, "summ1": ["Teachers Shot ‘Execution Style’ With Plastic Bullets In Active Shooter Drill", "New Zealand Promises ‘Changes to Our Gun Laws’ After Mosque Shootings", "Trump’s pick for Office on Violence Against Women doesn’t understand gun violence against women – ThinkProgress", "1 week. 3 suicides. 1 tragic connection to school massacres"], "summ2": ["PHOTO: Anti-Gun Activist Caught Texting She'd 'Blow Away' Pro-Gun State Senator, NRA Members", "San Jose police chief: Sanctuary policies shielded a suspected murderer from deportation six times", "New Zealand Prime Minister: Gun Confiscation ‘Just The Beginning’ Of Things To Come", "TRUMP JR: House Democrats Just Tried To Undermine The Second Amendment"]}
{"comp": "L_R", "month": "May", "feats": "bow", "test": 0.7044, "summ1": ["Manuel Oliver Creates Mural Comparing Gun Laws to Animal Protection Laws", "New NRA President Says Georgia Democrat Only Won Her Seat in Congress Because She’s Black", "Gun-loving Parkland teen busted for multiple racist rants after being hired by college GOP group", "Highlands Ranch shooting: 1 student killed and 8 wounded after two suspects open fire near Columbine"], "summ2": ["Gun-control group Brady apologizes to students at STEM School Highlands Ranch for politicizing vigil", "Cory Booker plans national gun registry", "LA Legislators Make Strong Stance In Defense Of Second Amendment", "Firearms Control: US Gun Rights Experts on Why Arms Laws Don't Work"]}
{"comp": "ER_LC", "month": "Jul", "feats": "bow", "test": 0.7035, "summ1": ["CEO Ed Stack is okay with Dick’s Sporting Goods’ $150M loss from gun control stance", "Civil Disobedience/Noncompliance are Damaging New Zealand’s Gun Control Efforts", "GANGLAND: Chicago Gun Violence Spikes, 9 Dead, 39 Wounded in ONE Weekend", "Tacoma ICE Facility Terror Attacker IDed as Antifa Activist"], "summ2": ["Man fatally shot after standoff in Eagan", "Osama bin Laden's son, Hamza, heir to al-Qaeda leadership, is dead, US officials say", "At least 3 killed, including 6-year-old, in shooting at garlic festival in California", "Virginia lawmakers to debate gun laws after mass shooting"]}
{"comp": "C_R", "month": "Sep", "feats": "bow", "test": 0.7032, "summ1": ["Looser gun laws go into effect in Texas one day after mass shooting", "Five killed, including gunman, 21 injured in West Texas shooting", "Trump-Putin phone calls in Democrats' sights: Schiff", "Poll: Most NRA members support comprehensive background checks"], "summ2": ["Booker: Stop “fearmongering” over what we clearly said would happen", "Here’s an Innovative Gun Safety Policy: Enforce the Law", "Alyssa Milano complains about Second Amendment rights: 'Which passage of the Bible' says it's a 'God-given right to own a gun?' Ted Cruz demolishes her argument.", "Pelosi Begs Trump For Help On Gun Control After Pushing Impeachment"]}
{"comp": "L_RC", "month": "Jan", "feats": "bow", "test": 0.7018, "summ1": ["Donald Trump is walking into a ‘trap’ by threatening to declare a ‘national emergency’ to get his border wall", "Gun Violence Against Women In 2019 Has Barely Made The News Cycle", "California preschooler shoots mom in completely preventable instance of 'family fire'", "Covington Catholic Students Claim Death Threats After D.C. Encounter"], "summ2": ["Judge acquits 3 Chicago cops of covering up Laquan McDonald's killing, backing police on each disputed point", "Only 21 per cent of long guns registered in Quebec ahead of Jan. 29 deadline", "APNewsBreak: Sheriff: Man admitted 2 slayings; gun used in 4", "Gun control bills die in Richmond as Republican-led committees vote them down"]}
{"comp": "C_L", "month": "Jul", "feats": "sbert", "test": 0.7017, "summ1": ["Young man stabbed to death in Shepherd's Bush in west London", "Florida Democrats criticize state’s appeal of gun preemption ruling", "Norfolk Police engage with the community on gun violence", "12 shot, 2 fatally in Fourth of July gun violence across Chicago"], "summ2": ["State gun laws aren't enough", "Why a Climate Debate Is a Terrible Idea", "‘We were screaming — we were praying’: Mother recalls parents carrying lifeless little boy after Gilroy shooting", "National Review Online Defends Intimidation By Heavily Armed \"Open Carry Texas\" Group"]}
{"comp": "ER_L", "month": "Apr", "feats": "sbert", "test": 0.7012, "summ1": ["In Chicago, 24 shot in 30 Hours Over Warmest Weekend of the Year", "Democrats React to Poway Synagogue Shooting by Denouncing ‘Gun Violence’", "The Latest Scheme to Turn Gun Owners into Criminals", "Lindsey Graham Shoots America In The Back, Begins Drafting Gun Confiscation Bill"], "summ2": ["LISTEN: Rep. Eric Swalwell Posts Violent Threatening Voicemail: 'You Wanna Go to War...? We're Going to War and You're Going to Be the First Mother****ing Casualty' LISTEN: Rep. Eric Swalwell Posts Vi", "Investigative report says NRA's internal dealings are dubious enough to end its tax-exempt status", "PFAW and AAMIA Renew Call for Federally Funded Gun Violence Research", "Gun control too often happens ‘on the backs’ of African Americans, Pittsburgh activists say"]}
{"comp": "C_R", "month": "Apr", "feats": "bow", "test": 0.6989, "summ1": ["New Zealand lawmakers pass tough gun laws over mosque attacks", "15 shot, 3 fatally, in Chicago Monday", "House move roils gun control debate at Minnesota Legislature", "Columbine threat by woman with gun shuts Denver-area schools"], "summ2": ["Kamala Harris wants to use executive action for gun control if she is elected president", "Latest News of Self-Defense With Firearms Contradicts Gun Control Rhetoric", "New Hampshire: Senate Committee to Hear Gun Control Bills", "California's AG: Gun Owners Who Have 'High Capacity' Magazines Are Going To..."]}
{"comp": "C_R", "month": "Aug", "feats": "sbert", "test": 0.6988, "summ1": ["Trump tells NRA universal background checks are off the table in gun control debate", "Nashville lawmakers, activists rally for gun control on capitol steps after mass shootings in Texas, Ohio", "20 dead, more wounded after gunman attacks Texas shoppers", "Progressive Queens DA candidate concedes in tight race"], "summ2": ["‘Have A Million Seats’: Dana Loesch Blasts Philly Mayor’s Attempts To Blame ‘Law Abiding People’ For Criminal’s Actions", "After Mass Shooting, Interest In Concealed Carry Soars In El Paso", "Warning: How the VA 'Red-Flags' Patriots", "Andrew Yang breaks down in tears while addressing woman who lost her 4-year-old to gun violence"]}
{"comp": "L_LC", "month": "Mar", "feats": "sbert", "test": 0.6986, "summ1": ["Queer Teenage Girls Are Leading the Gun Control Movement", "Being the anti-Trump isn't enough for Democratic candidates", "New Zealand PM promises 'our gun laws will change'", "Male N.H Legislators Don Pearls to Mock Gun Control Advocates"], "summ2": ["Maryland lawmakers work to meet crossover deadline", "'I’m disappointed': Scott Morrison confirms Liberals will preference One Nation below Labor after gun scandal", "1 dead, 4 wounded Friday in Chicago gun violence", "New Zealand pledges reforms as relaxed gun laws scrutinised"]}
{"comp": "L_LC", "month": "Apr", "feats": "sbert", "test": 0.6984, "summ1": ["How a ‘missing’ movement made gun control a winning issue", "For Students in Dublin, Ga., Armed Teachers Aren't an Anomaly, They're an Expectation", "LISTEN: Rep. Eric Swalwell Posts Violent Threatening Voicemail: 'You Wanna Go to War...? We're Going to War and You're Going to Be the First Mother****ing Casualty' LISTEN: Rep. Eric Swalwell Posts Vi", "Texas Militia Leader Planned to Kill Barack Obama, Hillary Clinton & George Soros, According to FBI"], "summ2": ["New Zealand passes new gun laws 26 days after mass shooting attacks on mosques", "NYC's Gang Raids Are About Vengeance, Not Justice", "‘We have to keep kids inside’: Father fears for safety of his son after Harvey triple shooting", "Officials in Colorado search for woman 'infatuated' with Columbine shooting"]}
{"comp": "LC_R", "month": "Apr", "feats": "bow", "test": 0.6981, "summ1": ["New Zealand Parliament votes to ban semi-automatic weapons", "Grammy-nominated US rapper Nipsey Hussle shot dead", "Columbine 20 years later: This map shows every school shooting since", "20-year-old arrested in road-rage shooting that killed 10-year old girl in Phoenix"], "summ2": ["Kamala Harris wants to use executive action for gun control if she is elected president", "Latest News of Self-Defense With Firearms Contradicts Gun Control Rhetoric", "New Hampshire: Senate Committee to Hear Gun Control Bills", "Swalwell Argues Gun Control Somehow Defends Second Amendment"]}
{"comp": "C_R", "month": "Jul", "feats": "sbert", "test": 0.6969, "summ1": ["Man shouting ‘You die!’ kills 33 in Japan anime studio fire", "Florida Democrats criticize state’s appeal of gun preemption ruling", "57 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "Norfolk Police engage with the community on gun violence"], "summ2": ["Newsom: Trump and Republicans to Blame for Gilroy Gun Violence", "Civil Disobedience/Noncompliance are Damaging New Zealand’s Gun Control Efforts", "Harris Seizes California Shooting to Promote Gun Control", "Man in his 20s becomes the second person to be shot dead in London in less than 48 hours"]}
{"comp": "ER_L", "month": "Jun", "feats": "bow", "test": 0.6966, "summ1": ["Illegals Get Minimum Sentences for Killing Couple, Raping 12-Year-Old", "REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "WATCH: Obama Gets Paid $600,000 to Lie to Foreign Crowd About U.S. Gun Laws - Repeatedly", "On Second Night of Presidential Debate Dems Supported Massive Gun Control"], "summ2": ["Democratic-led House votes to fund gun violence research for first time in history", "Chuck Schumer: It's Possible To Shame Mitch McConnell Into Action", "Family of Slain University of Utah Student Lauren McCluskey Files $56 Million Lawsuit Against School", "All but one of the 12 killed in the Virginia Beach shooting were city employees, official says"]}
{"comp": "ER_L", "month": "Feb", "feats": "sbert", "test": 0.6961, "summ1": ["Why Does the MSM Keep Falling for Obvious Hoaxes?", "Democrats Are the Party of Destruction", "Washington Sheriffs Decline to Enforce Gun Control", "Mark Kelly Testifies in Favor of Gun Control, Then Goes Shooting"], "summ2": ["National Emergency? Here Are the Real Emergencies an Outraged Nation Tells President Trump", "Shooter in deadly Illinois rampage was not supposed to own a gun, police say", "‘Columbine’ Author Dave Cullen on Parkland's ‘Remarkable’ Heroes: ‘They Won’t Take No for an Answer’", "NRA, Republicans team up to bash gun reform on Parkland anniversary"]}
{"comp": "ER_L", "month": "Jul", "feats": "sbert", "test": 0.6957, "summ1": ["California Senate Votes 28-8 to Exempt Itself from California Gun Laws: Can you blame them?", "MAGA BEAUTY Stripped Of Miss MI Title Over Refusal To Wear Hijab…Tweet Sharing Stats About Black On Black Gun Violence", "Khan's London: Deadly Shootings and Child Stabbings Blight Weekend", "Chicago Mayor is in Denial About Chicago’s Gun Control Failure"], "summ2": ["State gun laws aren't enough", "Can the NRA Defeat Florida’s Gun Law?", "CNN Anchor Chokes Up While Defending Baltimore From Trump's Racist Attacks", "Three killed, including a 6-year-old boy, in mass shooting at popular California Garlic Festival"]}
{"comp": "LC_R", "month": "May", "feats": "bow", "test": 0.6956, "summ1": ["School shooting in Colorado kills one, wounds eight students, two suspects in custody", "During discussion about guns in church, man accidentally shoots himself, wife: Police", "Swiss voters approve tighter gun laws, lining up with the EU", "Will the Liberals' 'common sense' gun law changes do anything to address the spike in gun violence?"], "summ2": ["No Hogg-like props: Students walking out of vigil-turned-gun control rally is a good sign", "New Zealand prime minister: 'I do not understand' Americans' lack of action on gun control", "Cory Booker plans national gun registry", "Firearms Control: US Gun Rights Experts on Why Arms Laws Don't Work"]}
{"comp": "R_RC", "month": "Mar", "feats": "sbert", "test": 0.6955, "summ1": ["Did USA Today Admit Gun Control Laws Aren’t Enforced?", "Man Shoots Himself In Scrotum Due To Unholstered Pistol", "There It Is...Ocasio-Cortez Pushes For A Gun Ban", "Deja Vu! Moms Demand Action Give INACCURATE Testimony AGAIN"], "summ2": ["AP-NORC Poll: Majority of Americans favor stricter gun laws", "Christchurch mosque shooting gun laws John Howard New Zealand", "Bump Stock Rule Puts Constitution In The Crosshairs", "Christchurch mosque shooting: New Zealand searching for answers"]}
{"comp": "C_ER", "month": "Mar", "feats": "bow", "test": 0.6955, "summ1": ["Victims of gun violence launch effort pressuring Senate to take up legislation", "Pottstown Shooting Linked To School Bullying Incidents, Mom Says", "Police: Sebewaing man shot at Michigan State Police, who returned fire and killed him", "New Zealand bans types of semi-automatic weapons used in mosque mass shooting"], "summ2": ["New Zealand Prime Minister Proposes Extreme Gun Control In Wake Of Deadly Shooting", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops. ⋆ Conservative Firing Line", "Alexandria Ocasio-Cortez Uses New Zealand Mosque Terror to Attack NRA", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill"]}
{"comp": "R_RC", "month": "Feb", "feats": "bow", "test": 0.6955, "summ1": ["The Democrat Shift To A Pure Anti-Gun Party", "Gun Background Checks -- House Passes Bill Requiring Federal Criminal Checks on Buyers", "FBI Investigating Threats to Shoot Washington Sheriffs Over I-1639 Enforcement", "Illinois workplace shooting leaves 5 dead, shooter killed, officials say"], "summ2": ["U.S. provides $8.3 million for California victims of Las Vegas mass shooting", "Trump referred to ‘gun violence’ in his Parkland remembrance. Hours later, he changed it to ‘school violence.’", "Police: Aurora attacker used gun he shouldn't have owned", "'Second Amendment Sanctuary County' movement spreads in New Mexico"]}
{"comp": "L_R", "month": "Jul", "feats": "sbert", "test": 0.6952, "summ1": ["State gun laws aren't enough", "Cameron Boyce’s Loved Ones Launching Social Media Campaign", "Gilroy Garlic Festival shooting: Gunman opens fire during the last day of this annual California festival.", "With a straight face, GOP leader says party was ‘respectful’ of Obama"], "summ2": ["Mexico’s Gun Control Works So Well 3,000 People Killed In June Alone", "Gov. Northam Wrote An Op-Ed After VA GOP Torched His Anti-Gun Push, He Should Have Just Shut His Face", "Harris Seizes California Shooting to Promote Gun Control", "Shooting at Brooklyn ‘Oldtimers Week’ Leaves 11 Injured and One Dead"]}
{"comp": "R_RC", "month": "Jun", "feats": "sbert", "test": 0.6940000000000001, "summ1": ["Sorry Mr. President, But Your Lies About America’s Gun Laws Were, In Fact, Lies", "Virginia: Special General Assembly Session Pushing Gun Control Starts July 9th", "Ohio Gun Control Group Proposes Universal Background Checks", "Three years of whitewashing the jihadism driving the Pulse nightclub terror"], "summ2": ["Shock in south London after pregnant woman stabbed to death in broad daylight", "At Hampton Roads gun violence discussion, talk turns to counseling and programs for youth", "Needles declared itself a “2nd Amendment Sanctuary” city; wants exemption to some state gun laws", "Murphy says top Democrat is holding up gun control plan"]}
{"comp": "LC_R", "month": "Feb", "feats": "bow", "test": 0.6924, "summ1": ["Parkland victim's father and congressman have heated exchange at gun-violence hearing", "Emergency powers: None used in the past looks like Trump’s situation", "Coast Guard officer wanted to kill Democrats, TV hosts, say prosecutors", "At least five dead, six officers injured as gunman opens fire at Aurora, Ill., plant"], "summ2": ["Anti-Gun Outrage Over American Rifleman Cover", "Top 9 Reasons House Democrats’ Latest Gun Control Bill Is A Terrible Idea", "The Stakes in 2020", "Washington law enforcement is refusing to enforce new gun laws"]}
{"comp": "C_ER", "month": "Sep", "feats": "bow", "test": 0.6920000000000001, "summ1": ["O'Rourke responds to 'death threat' from Texas lawmaker", "26 shot, 8 fatally, in Labor Day weekend violence", "Streetwear brand faces backlash over school shooting-themed sweatshirts", "Trump says gun background checks would not have prevented recent gun violence"], "summ2": ["UPDATE: Odessa Shooter Had been \"Calling FBI and Police FOR YEARS\" Leaving Incoherent Messages Before Mass Shooting", "Liberals Cheer Beto's Gun Line: 'We're Gonna Take Your AR-15'", "Senate Promising To Pass A WAVE Of Gun Control Laws This Month – The Times Of America", "Chicago Mayor Gets TRIGGERED When Ted Cruz Tweets Gun Control In That City Doesn't Work"]}
{"comp": "L_R", "month": "Jul", "feats": "bow", "test": 0.6917, "summ1": ["Cameron Boyce’s Loved Ones Launching Social Media Campaign", "At Least 3 Killed, 15 Wounded By Gunman At California’s Gilroy Garlic Festival", "Republicans dominate state legislatures. That decides political power in America.", "CNN Anchor Chokes Up While Defending Baltimore From Trump's Racist Attacks"], "summ2": ["At Fox News: Dems and gun control - they want it whether it works or not - Crime Prevention Research Center", "FIFTY SIX people shot in Chicago over the weekend - four fatally", "New Zealand Prime Minister: Gun Ownership A Privilege, Not A Right", "Northam Offers Anti-Gun Wish List, None Would Have Stopped Va Beach"]}
{"comp": "C_L", "month": "Jan", "feats": "bow", "test": 0.6903, "summ1": ["Pentagon defeats U.S. cities' appeal over gun check flaws: court", "Man shot in hand during his attempt to rob two people in Norfolk", "Bill filed to repeal gun control measures adopted after Parkland massacre", "House Democrats set first panel hearing on gun violence in 8 years"], "summ2": ["Sebring, Florida, bank shooting: what we know", "Fox News and the NRA's Vision for American Schools Is Guns and Fear", "Fact-checking Trump's immigration speech", "Kamala Harris: Gun Control Requires Congress Being Placed in 'Locked Room' With Autopsy Photographs of Sandy Hook Victims"]}
{"comp": "R_RC", "month": "Apr", "feats": "bow", "test": 0.6902, "summ1": ["City of Pittsburgh, Mayor & City Council-Members Sued over New Gun Control", "Kamala Harris wants to use executive action for gun control if she is elected president", "California synagogue shooting leaves 1 dead, 3 injured; man detained, authorities say", "Swalwell Argues Gun Control Somehow Defends Second Amendment"], "summ2": ["New Zealand gun owners back gun control after massacre", "Four people shot in early morning shooting a block from FAMU", "House move roils gun control debate at Minnesota Legislature", "Police to focus on gun violence"]}
{"comp": "C_R", "month": "Jan", "feats": "sbert", "test": 0.6901, "summ1": ["Supreme Court to hear biggest gun rights case since 2010", "15-year-old boy stabbed in Cicero has died, suspect arrested", "Dems to Push Gun Control on Anniversary of Giffords Shooting", "Stoneman Douglas commission calls for arming teachers, more school security spending in first report to state leaders"], "summ2": ["The New York Times Wants Credit Card Companies To Curtail Gun Violence", "DA Warns Pittsburgh City Council That They Can’t Make Gun Laws", "Virginia Governor Announce Anti-Gun Legislation", "Zack Ford attempts ‘some apologies and clarifications’ after getting ratio’d into oblivion over awful gun control take"]}
{"comp": "ER_R", "month": "Feb", "feats": "bow", "test": 0.6899, "summ1": ["Warns 'Next Dem President Can Declare a Gun Violence Emergency'", "Gun control bills proliferate in Congress, state legislatures", "Police Net Dozens of Illegal Firearms Including AK-47 in ‘Gun-Free’ UK", "TN man Pulls a Gun on Sam's Club Customer Wearing a MAGA Hat"], "summ2": ["Republican Who Survived Shooting Says Democrats Wouldn’t Let Him Testify at Gun Control Hearing", "Supreme Court Takes Closer Look at NJ Second Amendment Case", "Top 9 Reasons House Democrats’ Latest Gun Control Bill Is A Terrible Idea", "Washington law enforcement is refusing to enforce new gun laws"]}
{"comp": "C_ER", "month": "Feb", "feats": "bow", "test": 0.6886, "summ1": ["Trump Threatens To Veto Gun Bills Pushed By Democrats", "Mother Dismembered, Burned 23-Month-Old Son’s Body Because He Wouldn’t Eat, Listen, Police Say – CBS Philly", "Ex-Astronaut Mark Kelly Announces Run for McCain Senate Seat", "Congressional leaders remember Parkland shooting anniversary"], "summ2": ["Murder Rates Continue To Drop, But Pelosi Insists There Is An Epidemic Of Gun Violence", "Dems worry less about gun control than having a ‘fresh face’ in 2020 ⋆ Conservative Firing Line", "The House Just Passed A “Sweeping” Gun Control Bill. Tomorrow They Vote On Another", "Liberal Pulls Gun Because He Allegedly Hated Man’s MAGA Hat"]}
{"comp": "ER_L", "month": "Sep", "feats": "bow", "test": 0.6877, "summ1": ["Watch: Jerome Hudson Calls Out the Left’s Climate Hypocrisy, Gun Control Hysteria on ‘Waters World’", "Uncertain Trump Mulls Gun Control Measures Like Red Flag Laws", "Democrat Senators Fear Beto O’Rourke Torpedoed Gun Control with Confiscation Push", "TEXAS TAKEDOWN: Ted Cruz SCHOOLS Chicago Mayor on Guns, Felons, Violent Crime, Constitution"], "summ2": ["Trump says a mysterious “big package” of bipartisan legislation is on the way to stop mass shootings", "How The For-Profit Prison Industry Keeps 460,000 Innocent People in Jail Every Day", "Beto O'Rourke on CNN, After Odessa Shooting: 'This is F*cked Up'", "Moscow Mitch says calling him Moscow Mitch is ‘over the top’"]}
{"comp": "ER_LC", "month": "May", "feats": "bow", "test": 0.6875, "summ1": ["Booker's outrageous gun control scheme ignores second amendment right", "CA Dems Legalizing Soviet-Style Reporting of Legal Gun-Owning Co-Workers", "Students Angrily Walk Out Of Colorado School Shooting Vigil In Protest After Speakers Push Gun Control And Politicize Tragedy – The Bearded Patriot", "The History of Gun Control & Crime in Australia, New Zealand, & the UK"], "summ2": ["Transgender woman shot, killed in US weeks after assault", "1 Student Killed, 8 Injured In Colorado School Shooting", "Man screams ‘I will kill you’ before slashing a group of people with knives in Japan, wounding at least 19, killing at least 1", "Swiss vote to tighten gun laws and stay in Schengen"]}
{"comp": "R_RC", "month": "Jul", "feats": "sbert", "test": 0.6871, "summ1": ["Newsom: Trump and Republicans to Blame for Gilroy Gun Violence", "51 shot, including 4 fatally, in Chicago’s weekend gun violence", "New Zealand Prime Minister: Gun Ownership A Privilege, Not A Right", "How ‘Secret Obsession’ Exposes California’s Dumb Gun Laws"], "summ2": ["Virginia County Stands Up to Gun Control", "Victims and perpetrators of gun violence will work together to transform 50 vacant city lots into gardens", "US reels after shootings leave five dead, dozens injured", "Gun ban debate leads board to ask Ottawa police for report on how to curb gun violence"]}
{"comp": "C_ER", "month": "May", "feats": "bow", "test": 0.6864, "summ1": ["City Of Pittsburgh Agrees Not To Enforce Gun Control Legislation During Ongoing Court Proceedings", "Students kill classmate, injure 8 at school near Columbine", "38 shot, 5 fatally, in Chicago Memorial Day weekend gun violence", "Gun control takes center stage in 2020 Democratic presidential race"], "summ2": ["Colorado Students Walk Out On Dems Who Twisted Vigil Into Anti-Gun Platform", "Trump, the NRA and the secret scheme to foist gun control on America and stealthily gut the 2nd Amendment – The Millennium Report", "CA Dems Legalizing Soviet-Style Reporting of Legal Gun-Owning Co-Workers", "Britain’s Violent Crime Wave Claims 100th Fatal Stabbing Victim of 2019"]}
{"comp": "C_R", "month": "Jun", "feats": "bow", "test": 0.6859, "summ1": ["Chicago weekend gun violence injures 44, kills 4", "Drug, Gun Trafficking Organization Busted In Montco: DA", "Democratic debate: 10 candidates discuss immigration, gun control, health care in first night", "At least 12 killed after 'disgruntled' city employee opens fire at Virginia municipal centre"], "summ2": ["2020 Dems call for action against 'gun violence' after Virginia Beach shooting", "ROFL! DELETE THESE! Eric Swalwell’s plans to end gun violence prove he knows absolutely NOTHING about guns", "Gun Rights Made All the Difference for These Would-Be Victims", "New Jersey: Assembly Judiciary Committee Begins Next Wave of Gun Control"]}
{"comp": "L_LC", "month": "Jan", "feats": "sbert", "test": 0.6854, "summ1": ["Inside the White House, aides and advisers are despondent over a wasted month", "What is it like to shoot someone? \"Behind the Bullet\" explores \"moral injury\" of gun violence", "2018 Has Seen a Big Increase in Gun Control Laws", "'Black Muslims' Made My Son Do It, Says Mother of Pro-Trump Boy Who Mocked Native American Veteran"], "summ2": ["Driver in stolen car hits Pueblo officer before another officer shoots driver, police say. Another suspect remains at large.", "House Democrats unveil universal background check bill on anniversary of Gabby Giffords shooting", "John Howard praised by Scott Morrison for reportedly intervening in domestic violence incident", "Newtown shooting victims"]}
{"comp": "ER_RC", "month": "Jun", "feats": "bow", "test": 0.6847, "summ1": ["On Second Night of Presidential Debate Dems Supported Massive Gun Control", "REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "Chicago Police Superintendent Makes Statement After 10 Killed Over The Weekend", "WATCH: Obama Gets Paid $600,000 to Lie to Foreign Crowd About U.S. Gun Laws - Repeatedly"], "summ2": ["Utah gunman shot by deputies after pointing weapon at them, police say", "Ottawa councillor says he'll ask for support in joining calls for handgun ban", "Bill Would Double Penalty for Stealing Guns from FFLs", "At least 12 people killed in Virginia Beach mass shooting; suspect dead"]}
{"comp": "C_R", "month": "Jul", "feats": "bow", "test": 0.6835, "summ1": ["Pete Buttigieg says he’s mayor of a turnaround city. Here’s how that claim stands up.", "Experts Say Drowning is Leading Cause of Accidental Death for Young U.S. Children", "41 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "NSF: Judge sides with local governments on gun law"], "summ2": ["Joe Biden Steps Up Gun Targeting Ahead of Debate", "Swalwell: McConnell Will Be Gone After 2020, So Gun Control For All", "Mass Shooting Tears Apart Garlic Festival In Gilroy, California", "American Firearms Coalition in Richmond, Virginia to Fight Democrat AND Republican Gun Control"]}
{"comp": "L_RC", "month": "Aug", "feats": "sbert", "test": 0.6832, "summ1": ["“There’s Blood on the Hands of Members of Congress”: Frustrated Democrats Debate Strategy as Mitch McConnell Holds Gun Control in His Pocket", "Republicans Blasted Obama Administration For Warning About Right-Wing Domestic Terrorism", "Trump Caught Making Reassurance Call To NRA, Won’t Take Any Action On Gun Violence", "5 Gun Control Activists Discuss What’s Next for Gun Reform"], "summ2": ["Jewish and Islamic schools in Melbourne, Sydney: Why they have armed guards", "Man threatened gun violence at New Haven Puerto Rican Festival: cops", "Does 'Common Sense Gun Safety Legislation' Make Sense As a Response to the El Paso and Dayton Shootings?", "Democrat Conor Lamb says new gun laws not needed to prevent violence"]}
{"comp": "C_R", "month": "Feb", "feats": "bow", "test": 0.6818, "summ1": ["Sen. Bernie Sanders - Campaign Finance Summary", "AP FACT CHECK: Declaring emergency for wall not so ordinary", "'I am forever haunted:' Parkland mourns a year after shooting", "Aurora mass shooting: Gunman opened fire after being told he was losing job, police say"], "summ2": ["The Democrat Shift To A Pure Anti-Gun Party", "Some Washington sheriffs refuse to enforce new gun laws", "Gun Background Checks -- House Passes Bill Requiring Federal Criminal Checks on Buyers", "Five People Deceased in Aurora, Illinois After Gunman Fired at Coworkers, Cops"]}
{"comp": "L_LC", "month": "Jun", "feats": "bow", "test": 0.6818, "summ1": ["NRA rallies support for Oregon state senator who threatened to shoot law enforcement", "New details emerge in the Virginia Beach mass shooting that left 12 people dead", "Mitch McConnell is worse than the Grim Reaper", "Trump says ‘vetting’ gun buyers would have made Texas shooting worse"], "summ2": ["Democratic candidate Eric Swalwell's gun control plan includes buying back every assault weapon in America", "Murder graph shows how London killings compare to US cities", "At least 12 dead, including suspect, in Virginia Beach shooting", "Florida woman charged after giving husband's guns to police"]}
{"comp": "C_R", "month": "May", "feats": "bow", "test": 0.6809999999999999, "summ1": ["38 shot, 5 fatally, in Chicago Memorial Day weekend gun violence", "Multiple students injured at STEM School Highlands Ranch shooting; deputies still searching for suspect(s)", "Gun control takes center stage in 2020 Democratic presidential race", "Swiss voters approve tighter gun control: TV"], "summ2": ["Shannon Watts Apparently Wants Centerfire Rifle Ammo Banned", "Colorado students walk out of vigil after Democrats try to push gun control (awesome clip)… – CITIZEN FREE PRESS", "What's Wrong With Licensing Gun Owners? Cory Booker's Plan Would Unjustly Deprive Peaceful Americans of the Fundamental Right to Armed Self-Defense", "Trump Admin. & Pro-Gun Others Lend Support on Pending Supreme Court Case"]}
{"comp": "ER_L", "month": "Aug", "feats": "bow", "test": 0.6803, "summ1": ["PHILLY SHOOTOUT ANOTHER DISMAL FAILURE OF GUN CONTROL, SAYS SAF", "47 Shot, 4 Fatally, Over Weekend in Democrat-Controlled Chicago", "World Class POS, Schumer To Force Trump To Use Wall Money For \"Gun Control\" Or Is Trying To, While He Pushes To Strip Citizens Of Natural Right To Body Armour ~ illicit info", "President Trump Calls for Red Flag Laws Following Texas, Ohio Shootings"], "summ2": ["‘No more’: Nebraska state Republican calls out his party in brutally blunt terms on white supremacy", "'Something needs to be done': A conversation about guns and race in America", "Trump denounced for ‘dangerous’ idea to lock up people with mental illnesses", "Mitch McConnell dodges calls from Democrats to end Senate recess to vote on gun control"]}
{"comp": "L_R", "month": "Feb", "feats": "bow", "test": 0.6801, "summ1": ["Aurora Shooter Illegally Possessed Gun Used in Attack, Police Say", "Pelosi Shames Trump: Why Don't You Declare Gun Violence a National Emergency?", "Republican Advocates for Border Wall, Tries to Eject Parkland Parent from House Gun Legislation Hearing", "Survivors From Marjory Stoneman Douglas High School Talk About Their Year Since Tragic Shooting"], "summ2": ["It is SO on! Rep. Steve Scalise seriously DRAGS House Judiciary Dems for trying to silence him on gun violence (watch)", "2nd Amendment Foundation: ‘Anti-Gunners Were Right’ About SCOTUS ‘Opening Floodgates’ on Gun Cases", "Gun Background Check Bill Won’t Stop Violence but Helps ID Republican Turncoats", "Five People Deceased in Aurora, Illinois After Gunman Fired at Coworkers, Cops"]}
{"comp": "LC_R", "month": "Jul", "feats": "sbert", "test": 0.68, "summ1": ["‘Enough is enough’ — Democratic candidates respond to mass shooting at Gilroy festival", "Amid tragedy, anti-violence group continues with grand opening of pizza restaurant", "Walmart shooting in Mississippi: Police identify man who killed 2 and wounded 2", "Hannah Williams: 5 Fast Facts You Need to Know"], "summ2": ["Next Round Of New Zealand Gun Control Says Owning A Gun Is A Privilege, Not A Right", "Chicago Mayor Delusional About City’s Violence", "American Firearms Coalition in Richmond, Virginia to Fight Democrat AND Republican Gun Control", "Thanks to Media Matters expert, now we know what the 15 stands for in AR-15"]}
{"comp": "L_RC", "month": "Sep", "feats": "sbert", "test": 0.6796, "summ1": ["Trump-appointed U.S. attorney directly addresses white nationalists in blistering speech", "Caliber, cartridges, and bump stocks: guns, explained for non-gun people", "GOP declares Trump innocent before any impeachment begins, while McConnell sits on 100 bills", "Beto O’Rourke: The Epidemic of Gun Violence is F’d Up"], "summ2": ["Federal election 2019 roundup: Trudeau announces gun control plan, with ban on military-style assault rifles", "Odessa gunman bought rifle privately, failed previous background check due to 'mental health issues'", "Texas could consider requiring 'gunshot first aid' training in public schools", "Gun rights advocates protest Ohio gun control proposals in wake of Dayton shooting"]}
{"comp": "ER_R", "month": "Jan", "feats": "sbert", "test": 0.6776, "summ1": ["Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Pelosi's 'Commonsense' Gun Bill Is Not Sensible", "When Guns Are Outlawed, Only Outlaws Will Have Guns", "Armed Activists Protest Proposed Pittsburgh Gun Control Measures"], "summ2": ["Another Push for Draconian Gun Control", "Pittsburgh City Councilman: Violating the Constitution is Fine if You’re “On the Right Side of History”", "Bill Would Require Lawmakers To Pass Test Before Pushing Gun Laws", "Teen Kills Himself After Accidentally Killing Friend"]}
{"comp": "ER_LC", "month": "Feb", "feats": "bow", "test": 0.6762, "summ1": ["The House Just Passed A “Sweeping” Gun Control Bill. Tomorrow They Vote On Another", "California's Newest Push for More Gun Control ⋆ Conservative Firing Line", "Liberal Pulls Gun Because He Allegedly Hated Man’s MAGA Hat", "Nancy Pelosi Threatens Nationwide Gun Ban to Teach Trump a Lesson"], "summ2": ["Aurora shooting: Five dead after attack at US manufacturing facility", "Trump’s lengthy Parkland shooting remembrance doesn’t meaningfully mention guns", "Nancy Pelosi warns GOP that a Democratic president could declare gun violence a national emergency", "Young gun reform activists in D.C. to call for stricter firearm laws"]}
{"comp": "ER_LC", "month": "Sep", "feats": "bow", "test": 0.6755, "summ1": ["Democrats Silence About Chicago Gun Violence Is Deafening", "It’s Happening NOW: Cory Booker Introduces Radical Gun Control Legislation Into Congress", "Former Texas State Representative has Choice Words for Lieutenant Governor Dan Patrick After Gun Grab Push", "BETRAYAL: Ted Cruz Bashes President Trump’s ‘America First’ Foreign Policy to MSNBC Reporter"], "summ2": ["Burr, Tillis keep quiet as volume rises in gun control debate", "Hours after shooting rampage, Texas gun laws loosened", "The U.S. Will Move to Ban Flavored E-Cigarettes, Trump Official Says", "'Joke or not, these types of comments are felonies': Police arrest Florida teen for online threat"]}
{"comp": "C_R", "month": "Jan", "feats": "bow", "test": 0.6738, "summ1": ["Pentagon defeats U.S. cities' appeal over gun check flaws: court", "Man who dialed 911 saying he shot 5 in bank held for murder", "Bill filed to repeal gun control measures adopted after Parkland massacre", "House Democrats set first panel hearing on gun violence in 8 years"], "summ2": ["DA calls Pittsburgh Gun-Control Plan Illegal, City Council Moves Forward Anyway", "‘This should be interesting’: Kamala Harris’ take on #2A & gun laws at the CNN town hall is something else", "DOJ STUDY: Gun Control Laws Won’t Work Because Criminals Get Their Guns Illegally", "Republicans Torpedo Virginia Democrats' Anti-Gun Package, But This Is Only Round One"]}
{"comp": "C_RC", "month": "Jul", "feats": "bow", "test": 0.6734, "summ1": ["43 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "2020 Democrats renew calls for gun reform after Gilroy shooting", "Judge strikes down penalties for passing tougher gun laws", "Shootings on the rise as feuds fuel gun violence in Jackson"], "summ2": ["New Zealand struggles to round up banned firearms under new gun control law", "10 shootings in 2 weeks: Recent shootings likely gang related, 'raises concern' for police", "Festival shooter Santino William Legan used legal ‘AK-47-style’ rifle", "Stricter gun laws tied to fewer childhood gun deaths"]}
{"comp": "L_R", "month": "Jun", "feats": "bow", "test": 0.6732, "summ1": ["NRA Suspends Chief Lobbyist For Alleged Coup Plot Against LaPierre", "Mitch McConnell is the second worst human being on the planet", "Pete Buttigieg Remembers Pulse Shooting: 'It Was An Attack On All Of Us'", "All but one of the 12 killed in the Virginia Beach shooting were city employees, official says"], "summ2": ["Obama says US gun laws 'don't make much sense,' claims 'anybody can buy any weapon any time'", "Rep. Eric Swalwell rolls out gun control plan", "PRATT: Virginia Beach Demonstrates The Failure Of Gun Control", "More gun-control action needed: Bill Blair"]}
{"comp": "L_LC", "month": "Feb", "feats": "sbert", "test": 0.6732, "summ1": ["READ: Donald Trump Tweets ‘How Do the Networks Get Away With These Total Republican Hit Jobs Without Retribution?…This Is the Real Collusion!’", "Parkland Classmates, Parents Remember Shooting Victims On 1-Year Anniversary", "With Ocasio-Cortez/Markey Bill Reportedly on Horizon, Expert Says Green New Deal Must Include 'Fossil Fuel Phaseout'", "GOP Lawmaker Just Proved How Disgusting Republicans Are At First Gun Control Hearing In 8 Years"], "summ2": ["Gun storage laws save children's lives", "Aurora police name five victims killed in shooting by dismissed worker", "A year after Parkland massacre, political stalemate looms on guns", "Ex-Chicago cop who killed black teen contests rare challenge to his sentence"]}
{"comp": "ER_L", "month": "Mar", "feats": "bow", "test": 0.6724, "summ1": ["Future Of Gun Control In Wake Of Muslim Massacre – DC Alert", "North Carolina County Declares ‘Gun Sanctuary’ Status", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops. ⋆ Conservative Firing Line"], "summ2": ["'What Real Action to Stop Gun Violence Looks Like': New Zealand PM Announces Ban on Assault Rifles After Christchurch Massacre", "GOP Lawmakers Spark Outrage By Wearing Pearls To Mock Mothers Testifying On Gun Violence", "2 Parkland school shooting survivors have died", "Being the anti-Trump isn't enough for Democratic candidates"]}
{"comp": "LC_R", "month": "Mar", "feats": "bow", "test": 0.6721, "summ1": ["One Nation wanted millions from the NRA while planning to soften Australia's gun laws", "Father of Sandy Hook victim latest apparent suicide after deadly school shootings", "Victims of gun violence launch effort pressuring Senate to take up legislation", "New Zealand prime minister says gun laws will change in response to Christchurch terror attack"], "summ2": ["To Anti-Gunners, Gun Rights Aren’t Really Rights", "New Zealand Mass Murderer’s Primary Goals: Gun Control in the United States", "Lindsey Graham is joining Democrats on new gun control legislation", "Republicans Respond To Democrat Gun Control Bills With Pro-Law Enforcement Gun Bill"]}
{"comp": "C_L", "month": "Aug", "feats": "sbert", "test": 0.6717, "summ1": ["White House dismissed Homeland Security push to focus more on domestic terrorism: report", "Local lawmakers, gun groups respond to mass shootings", "4 dead after series of stabbings in Garden Grove, Santa Ana", "Pensacola rally will honor mass shooting victims, address gun violence"], "summ2": ["What no politician wants to admit about gun control", "PEOPLE's Call to Action: Contact Congress to Ask What Is Being Done to Stop the Epidemic of Gun Violence", "Major Democratic candidates lay blame for weekend's gun massacres at Trump's white supremacist feet", "Leaked Draft of Executive Order to “Censor the Internet” Sets Off Alarm Bells"]}
{"comp": "C_L", "month": "Feb", "feats": "sbert", "test": 0.6688, "summ1": ["Student Beaten To Death At School Over Phone | PatchPM", "House passage of gun safety bills reflects political shift", "Aurora shooting: 5 dead, multiple wounded including officers at Henry Pratt Company; gunman Gary Martin also dead", "Stevens County sheriff vows to ignore voter-approved Initiative 1639"], "summ2": ["Marc Bamuthi Joseph's /peh-LO-tah/ Grapples With the Tragedy and Triumph of Black Life", "With Ocasio-Cortez/Markey Bill Reportedly on Horizon, Expert Says Green New Deal Must Include 'Fossil Fuel Phaseout'", "GOP Lawmaker Just Proved How Disgusting Republicans Are At First Gun Control Hearing In 8 Years", "Six dead, seven injured in mass shooting near Chicago"]}
{"comp": "ER_RC", "month": "Feb", "feats": "bow", "test": 0.6673, "summ1": ["Lawmen arrest WA man in sheriff death threats investigation ⋆ Conservative Firing Line", "Gun control left this innocent woman defenseless against a rapist… Democrat policies encourage senseless violence against innocent women", "U.S. House Passes Extreme Gun Control Bill, President Trump Threatens VETO", "Aurora's Strict Gun Laws Didn't Prevent Shooting, But If One Law-Abiding Person In The Theater Had Been Carrying One..."], "summ2": ["New firearm stats show 2018 likely a record year for gun violence in Regina", "House Democrats examine ways to reduce gun violence", "On 1-year anniversary of Parkland shooting, Virginia Democrats highlight failed gun reform bills", "Police: Aurora attacker used gun he shouldn’t have owned"]}
{"comp": "ER_RC", "month": "May", "feats": "bow", "test": 0.6667, "summ1": ["Reverse Gun Control: The Philippines Wants to Hand Out Free Guns to the Public to Fight Drugs and Crime", "Booker's outrageous gun control scheme ignores second amendment right", "CA Dems Legalizing Soviet-Style Reporting of Legal Gun-Owning Co-Workers", "Students Angrily Walk Out Of Colorado School Shooting Vigil In Protest After Speakers Push Gun Control And Politicize Tragedy – The Bearded Patriot"], "summ2": ["Why won't pro-lifers act against America's deadly gun culture?", "Police say man carried in gun that killed boy", "Mayor Lightfoot must get Chicagoans to truly care about gun violence", "Gun-loving Swiss agree to harsher firearm control to avoid Schengen tensions"]}
{"comp": "C_R", "month": "Mar", "feats": "bow", "test": 0.6656, "summ1": ["AP-NORC Poll: Majority of Americans favor stricter gun laws", "March for Our Lives marks anniversary in Washington, D.C., with call for continued efforts to curb gun violence", "Police: Sebewaing man shot at Michigan State Police, who returned fire and killed him", "New Zealand bans types of semi-automatic weapons used in mosque mass shooting"], "summ2": ["CNN's 'Parkland Town Hall' -- Media Gives Itself Award for Disastrous Gun-Control Event", "Countries Embracing Gun Control Doesn’t Equal Caring For Its People", "Eight House Republicans Join Democrat Gun Grab", "Sanders, Ocasio-Cortez praise New Zealand's new ban on semi-automatic rifles, lead call for US to follow suit. NRA says not so fast."]}
{"comp": "LC_RC", "month": "Apr", "feats": "bow", "test": 0.6653, "summ1": ["Christchurch shootings: New Zealand MPs vote to change gun laws", "Rapper Nipsey Hussle Shot and Killed Outside His Los Angeles Clothing Store", "Rep. Seth Moulton is latest Democrat to enter 2020 field", "Schools across Denver area closed as “massive manhunt” continues for armed woman “infatuated with Columbine”"], "summ2": ["New Zealand Shooters Back Gun Control After Massacre", "Assembly passes bills on bump stock ban, pot convictions", "The NRA Is Right About the Violence Against Women Act", "Police to focus on gun violence"]}
{"comp": "C_R", "month": "Aug", "feats": "bow", "test": 0.665, "summ1": ["Watchdog report says Trump's State Department hiring freeze impacted safety", "U.S. House targets convergence of mass shootings, hate crimes", "49 shot, 6 fatally in Chicago weekend shootings", "The Latest: Senators say Ohio shooting is call to action"], "summ2": ["‘Peril’: GOP believes Democrats risk Rust Belt wipeout over gun control", "Kamala Harris is proposing a new kind of 'red flag' law to take guns away from racists", "I'm A Professor, And I Carry A Gun On Campus. Here's Why", "Gun Expert Debunks The Left’s Favorite Anti-2nd Amendment Talking Points"]}
{"comp": "C_ER", "month": "Aug", "feats": "bow", "test": 0.665, "summ1": ["US records nearly 20 mass killings for the year so far", "Drugs, weapons convictions in Philly shooting suspect’s past", "Trump urges 'common sense' gun measures, seeks NRA input", "Democrats call for Senate to return to vote on gun reform after two deadly mass shootings"], "summ2": ["Dayton Shooter Supported Gun Control, Socialism, Liz Warren", "Audit Finds Google Favors CNN and Far-Left Media in Gun Violence Coverage", "There Are Some Republicans Fighting for Your Gun Rights", "Trump says ‘mental illness, hatred’ to blame, not ‘the gun’"]}
{"comp": "L_R", "month": "Sep", "feats": "sbert", "test": 0.6642, "summ1": ["Debra Messing Urges Donald Trump to Focus on Gun Reform", "Police feared Odessa shooter was planning attack", "2020 Candidates Raise Gun Control Issue After Odessa: ‘This Is F*cked Up!’", "The real reason Walmart just outflanked Donald Trump and Mitch McConnell"], "summ2": ["Boom: Dana Loesch Unloads On Chicago Mayor For Failed Policies That Benefit Prohibited Gun Possessors", "Student Shot at Columbine Stumps Beto with Question About Gun Ban", "MSNBC analyst Zerlina Maxwell’s smug dismissal of gun owners’ concerns betrays her own ignorance — and proves their concerns are legit", "If you think you support red flag gun laws, listen to Jim Jordan talking about them"]}
{"comp": "ER_LC", "month": "Aug", "feats": "bow", "test": 0.664, "summ1": ["Schumer wants funds to go to fighting gun violence instead of to the border wall", "REPORT: Police Claim Possible Multiple Shooters in El Paso Mall", "GAINING SUPPORT: Sen. Graham’s ‘Red Flag’ Gun Legislation Gaining Bipartisan Support in Congress", "Tucker Carlson pointed out one fact about mass shootings that infuriated the Democrat Party"], "summ2": ["Trump proposes tighter gun control after mass shootings", "Victims of the Dayton shooting remembered: 'I'm just speechless'", "Turner wants increased local authority for gun control", "El Paso mass shooting suspect arrested after fatal attack at Texas Walmart"]}
{"comp": "ER_LC", "month": "Apr", "feats": "bow", "test": 0.6631, "summ1": ["Eric Swalwell, Notorious for Threatening Nuclear Attacks Against Gun Owners, Obsessing Over Trump-Russia, and Saying ‘Boo Hoo’ About Threats to a Republican Woman, Is Running for President", "Lindsey Graham is Now Drafting His Gun Confiscation Bill", "Delusional liberalism creates a carjacking crisis in Chicago", "AOC Uses Synagogue Shooting to Call for Universal Gun Registration"], "summ2": ["New Zealand Passes Gun Laws Banning Semi-Automatic Weapons", "Nipsey Hussle, Grammy-Nominated Rapper And Philanthropist, Shot And Killed", "New York man arrested after allegedly threatening to kill U.S. Rep. Ilhan Omar", "Young woman 'infatuated' with Columbine is found dead"]}
{"comp": "LC_RC", "month": "May", "feats": "sbert", "test": 0.6628, "summ1": ["Booker compares gun control fight to civil rights movement; endorses 'Medicare for all who want it'", "Barbershop: How High Schoolers Are Thinking About Gun Violence", "Margaret River murder-suicide: Seven people found dead at home near WA holiday town", "Florida to Let Teachers Carry Guns. Will Black Students Pay the Price?"], "summ2": ["Tucker Carlson: If Obama Said What Trump Did About Guns He \"Would Have Been Denounced As A Dictator\"", "34 shot, 5 fatally, so far in Chicago during Memorial Day weekend", "1 year after Santa Fe shooting, Texas shuns tougher gun laws", "Swiss voters appear set to align with EU on tighter gun laws"]}
{"comp": "L_R", "month": "Aug", "feats": "sbert", "test": 0.662, "summ1": ["Community groups seek holistic approach to gun violence, urge against punitive knee-jerk reactions", "Trump Wants To Declare Antifa A Terrorist Organization To Protect His Racist Mass Shooting Supporters", "Suicide is more common in places with more guns", "McConnell sits on 100 bills as the GOP tries to blame Democrats for inaction in Congress"], "summ2": ["Federal Penalties For Firearms Misuse", "‘Have A Million Seats:’ Dana Loesch Blasts Philly Mayor’s Attempts To Blame ‘Law Abiding’ For Criminal’s Actions", "After Mass Shooting, Interest In Concealed Carry Soars In El Paso", "Chris Cuomo quickly reveals why gun rights activists were right to avoid his circus of a town hall"]}
{"comp": "ER_L", "month": "May", "feats": "bow", "test": 0.6619, "summ1": ["Booker's outrageous gun control scheme ignores second amendment right", "CA Dems Legalizing Soviet-Style Reporting of Legal Gun-Owning Co-Workers", "Students Angrily Walk Out Of Colorado School Shooting Vigil In Protest After Speakers Push Gun Control And Politicize Tragedy – The Bearded Patriot", "Switzerland Approves Gun Control Laws"], "summ2": ["The National Rifle Association Is in Extremely Deep Trouble", "That viral quote about gun control and abortion is not from Gloria Steinem", "Just minutes away from Columbine, students tried to stop another deadly school shooting", "Ohio Student Gina Warren Uses Graduation Cap to Honor Gun Violence Victims"]}
{"comp": "L_R", "month": "Apr", "feats": "sbert", "test": 0.6613, "summ1": ["Is Your Bank Profiting From Gun Violence?", "A pro-gun activist lobbied for “constitutional carry” by showing up at Texas lawmakers’ homes. Now the bill is DOA.", "If elected president, Kamala Harris vows to take action on gun control, with or without Congress", "1 Dead, 3 Injured In Shooting At California Synagogue, Allegedly By White Supremacist"], "summ2": ["Missing From Beto O’Rourke’s Campaign Launch Address: Gun Control", "This Sheriff Says He Will Go to Prison Before He Will Enforce Gun Laws", "NRA, two other pro-Second Amendment groups file suit against Seattle's new 'gun violence tax'", "News of Self-Defense With Firearms Contradicts Gun Control Rhetoric"]}
{"comp": "R_RC", "month": "Sep", "feats": "bow", "test": 0.6608, "summ1": ["Chicago Mayor Shifts Blame to Republicans After Another Weekend of Bloodshed", "Red Flag Laws Are Not Needed To Combat Suicide", "WATCH: Beto Attempts To Explain Why He Believes Gun Owners Will Comply With Mandatory Buybacks Of AR-15s", "Trump Will Announce Gun Bills as Early as This Week. Is the Second Amendment Safe?"], "summ2": ["After El Paso and Odessa, Texas’ GOP leaders are doing the unthinkable — talking about gun control", "Federal election 2019 roundup: Trudeau announces gun control plan, with ban on military-style assault rifles", "Man in 20s dies after broad daylight shooting incident", "Trump says gun background checks would not have prevented recent gun violence"]}
{"comp": "L_LC", "month": "Jan", "feats": "bow", "test": 0.6605, "summ1": ["Donald Trump is walking into a ‘trap’ by threatening to declare a ‘national emergency’ to get his border wall", "Gun Violence Against Women In 2019 Has Barely Made The News Cycle", "Two New Polls Show Widespread Support for Stricter Gun Laws", "California preschooler shoots mom in completely preventable instance of 'family fire'"], "summ2": ["One thing could sink Democrats’ gun-control plans: a top Democrat’s opposition", "Man Charged With Murder After Allegedly Killing 5 Women At SunTrust Bank In Florida", "3 killed, 4 injured in California bowling alley shooting", "Attempted robber killed, 3 others wounded in Tuesday gun violence"]}
{"comp": "ER_RC", "month": "Aug", "feats": "bow", "test": 0.6599, "summ1": ["ANOTHER BLOODY CHICAGO WEEKEND: Two Mass Shootings…51 People SHOT…7 DEAD…Silence From Democrat Leaders", "Dayton Shooter Supported Gun Control, Socialism, Liz Warren", "UK: Vid of Machete Attack on Cop Emerges, Suspect 'Muhammed Rodwan'", "There Are Some Republicans Fighting for Your Gun Rights"], "summ2": ["Walmart, El Paso shooting: Alleged gunman Patrick Crusius identified", "Canadian PM Trudeau calls for action as gun violence spikes in Toronto", "Donald Trump sees tighter gun control tied to immigration reform", "Lawsuit challenges California’s assault weapons ban"]}
{"comp": "ER_L", "month": "Sep", "feats": "sbert", "test": 0.6597, "summ1": ["Bernie Sanders Wants Population Control to Fight Climate Change", "AR-15's Are Flying Off The Shelf After AZ Gun Store Introduces The 'Beto Special'", "Chicago Mayor Shoots Herself In The Foot Trying To Prove Her FAILED Gun Control Laws Work", "‘The Squad’ Smears the NRA as ‘Mass Murderers’ and ‘White Supremacists’"], "summ2": ["Trump-appointed U.S. attorney directly addresses white nationalists in blistering speech", "Caliber, cartridges, and bump stocks: guns, explained for non-gun people", "Congress has only three weeks to avert another government shutdown", "Beto O’Rourke: The Epidemic of Gun Violence is F’d Up"]}
{"comp": "R_RC", "month": "Aug", "feats": "sbert", "test": 0.6595, "summ1": ["Federal Penalties For Firearms Misuse", "‘Have A Million Seats:’ Dana Loesch Blasts Philly Mayor’s Attempts To Blame ‘Law Abiding’ For Criminal’s Actions", "After Mass Shooting, Interest In Concealed Carry Soars In El Paso", "President Trump Calls for Bi-partisan Answer to Gun Violence While Democrats Bash Trump for Approval Points"], "summ2": ["Hundreds of Gun Control Bills Have Been Introduced Since Sandy Hook. Why Has Nothing Changed?", "Mom of alleged El Paso shooter called cops about gun before tragedy: report", "Fifteen people wounded in 12 different shootings in Toronto over holiday weekend, police say", "Julian Castro issues 'plan to disarm hate' aimed at twin scourges of white nationalism and gun violence"]}
{"comp": "C_LC", "month": "Jul", "feats": "bow", "test": 0.6591, "summ1": ["41 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "Pete Buttigieg says he’s mayor of a turnaround city. Here’s how that claim stands up.", "NSF: Judge sides with local governments on gun law", "American with loaded gun in luggage is arrested at airport en route to new job at Okinawa base, police say"], "summ2": ["Four people shot dead, two wounded in Los Angeles shooting spree", "At least 3 killed, including 6-year-old, in shooting at garlic festival in California", "Rep. Eric Swalwell becomes first 2020 Democrat to drop out of race", "'Enough is enough': Virginia lawmakers debate ban on assault weapons"]}
{"comp": "LC_R", "month": "Aug", "feats": "sbert", "test": 0.6581, "summ1": ["America's politicians talk gun control and presidential blame following two mass shootings", "Family Court first stop for 16-year-old accused of shooting toddler", "Donald Trump slams white nationalism, vows to respond with 'urgent resolve' to El Paso, Dayton shootings", "The Latest: Philly police: Gunman had AR-15, handgun"], "summ2": ["Warning: How the VA ‘Red Flags’ Patriots", "‘Have A Million Seats’: Dana Loesch Blasts Philly Mayor’s Attempts To Blame ‘Law Abiding People’ For Criminal’s Actions", "Former NRA Lobbyist Exposes Media’s Lack of Knowledge on Gun Laws, Gun Reform", "After Mass Shooting, Interest In Concealed Carry Soars In El Paso"]}
{"comp": "L_RC", "month": "Mar", "feats": "bow", "test": 0.6579999999999999, "summ1": ["Teachers Should NOT Be Shot at With Plastic Pellets During Active-Shooter Trainings, But Apparently It Must Be Said", "Trump’s pick for Office on Violence Against Women doesn’t understand gun violence against women", "Time for a Democratic New Good Neighbor Policy", "Why You Should Stop Saying ‘Committed Suicide’"], "summ2": ["AP-NORC Poll: Majority of Americans favor stricter gun laws", "Birmingham declares gun violence public health crisis; city launches new ways to fight back", "'One of New Zealand's darkest days': PM Ardern says gun laws will change in wake of mosque attacks", "Gun laws: how NZ compares with Australia"]}
{"comp": "C_L", "month": "Feb", "feats": "bow", "test": 0.6578, "summ1": ["The Latest: Police: Aurora attacker took gun to firing", "One year after Parkland shooting, Democrats seek to expand red flag law", "Three more Eastern Washington sheriffs say they won’t enforce gun control initiative", "Poll shows McSally, Kelly tied in Arizona Senate race"], "summ2": ["House Democrat Lucy McBath, a Mother of the Gun Control Movement, Says 'Time Is Now on Our Side'", "Efforts to Address Gun Violence Should Not Include Increased Surveillance", "CNN’s Chris Cuomo to Rep. Matt Gaetz: You Use Murder Victims for Political Convenience", "Trump is already tweeting justifications for his ‘national emergency’"]}
{"comp": "ER_R", "month": "Jul", "feats": "bow", "test": 0.6564, "summ1": ["BREAKING: Miss World America Strips Conservative Activist Kathy Zhu of Miss Michigan Title Over Her Refusing to Wear Hijab", "STAB CITY: 8-Months-Pregnant Woman Stabbed to Death in London", "'Borat’ Director Encourages Left to Arm Selves Against 'Maga People'", "3 dead 12 hurt at Garlic Festival, 9 dead 39 wounded in Chicago"], "summ2": ["Fox News: Dems and gun control - they want it whether it works or not - Crime Prevention Research Center", "Next Round Of New Zealand Gun Control Says Owning A Gun Is A Privilege, Not A Right", "Three dead, 60 injured in shooting at Gilroy Garlic Festival in California, police say", "So this is what Gov. Ralph Northam considers shameful: Blowing off his special session on gun control"]}
{"comp": "ER_RC", "month": "Sep", "feats": "bow", "test": 0.6561, "summ1": ["UPDATE: Odessa Shooter Had been \"Calling FBI and Police FOR YEARS\" Leaving Incoherent Messages Before Mass Shooting", "Trump Is Done Being Nice, Exposes One Secret Pelosi Doesn’t Want You To Know", "Democrat Senators Fear Beto O’Rourke Torpedoed Gun Control with Confiscation Push", "Chicago Mayor Gets TRIGGERED When Ted Cruz Tweets Gun Control In That City Doesn't Work"], "summ2": ["New Zealand's PM Ardern acts to tighten gun laws further, six months after mosque attacks", "Knife crime epidemic on the rise, as London tube station shocked by double stabbing", "The Second Amendment Helped Feinstein Make It out of San Francisco Alive\u0097But Don\u0092t Tell City Supervisors: News: The Independent Institute", "Trump says gun background checks would not have prevented recent gun violence"]}
{"comp": "L_LC", "month": "Jun", "feats": "sbert", "test": 0.6557, "summ1": ["Pelosi Reminds America That McConnell Is Blocking Gun Control After Virginia Beach Shooting", "NRATV Dead At 2", "Franklin Graham Threatens America With Civil War If Trump Is Impeached", "All but one of the 12 killed in the Virginia Beach shooting were city employees, official says"], "summ2": ["Senate Republicans Must Act to Implement Sane Gun Reforms", "Chicago shootings: At least 10 killed and dozens more injured in deadliest weekend of 2019", "Steve Kerr wears ‘Vote For Our Lives’ shirt in support of Virginia Beach victims", "Woman gives police husband’s guns after his domestic violence arrest, gets charged with theft"]}
{"comp": "C_L", "month": "Mar", "feats": "bow", "test": 0.655, "summ1": ["Police: Sebewaing man shot at Michigan State Police, who returned fire and killed him", "Australia's One Nation Party Accused of Seeking NRA Money to Weaken Gun Laws", "New Zealand bans types of semi-automatic weapons used in mosque mass shooting", "March for Our Lives marks anniversary in Washington, D.C., with call for continued efforts to curb gun violence"], "summ2": ["New Zealand prime minister announces that 'our gun laws will change'", "2 Parkland school shooting survivors have died", "NH GOPer On Pearl-Wearing: ‘The Anti-Gun Folks Need To Get Over Themselves’", "China’s gun-control success a lesson for US"]}
{"comp": "R_RC", "month": "Jun", "feats": "bow", "test": 0.6547, "summ1": ["Obama says US gun laws 'don't make much sense,' claims 'anybody can buy any weapon any time'", "New Jersey: Assembly Committee Passes Another Gun Control Package", "Here's How 2020 Democrats Reacted To The Virginia Beach Shooting", "Latest FBI Crime Stats Don’t Support Gun Control"], "summ2": ["Are you prepared for the coming smoky days in Washington?", "At least 12 people killed in Virginia Beach mass shooting; suspect dead", "Officials: 5-Year-Old Shoots Toddler in Head, Uncle Charged", "Liberals want to prohibit more assault weapons rather than ban handguns"]}
{"comp": "C_LC", "month": "Jul", "feats": "sbert", "test": 0.6541, "summ1": ["New Zealand tighens gun laws again after mosque attack", "Americans have been shortchanged. House Democrats want to change that", "41 shot, 9 fatally, in Chicago weekend shootings", "Gun violence forum draws hundreds in North Philadelphia"], "summ2": ["‘Enough is enough’ — Democratic candidates respond to mass shooting at Gilroy festival", "Walmart shooting in Mississippi: Police identify man who killed 2 and wounded 2", "Hannah Williams: 5 Fast Facts You Need to Know", "Who Opposes Gun Control?"]}
{"comp": "ER_R", "month": "Apr", "feats": "sbert", "test": 0.654, "summ1": ["EATING THEIR OWN: Leftist Criticizes Kamala Harris for Being a Gun Owner", "Lindsey Graham Shoots America In The Back, Begins Drafting Gun Confiscation Bill", "Gun Controllers Demand Banks Refuse Service", "Twenty-Four Shootings, Five Murders Reported In One Chicago Weekend"], "summ2": ["Kamala Harris calls for third gender option on federal IDs", "Defensive gun uses by people legally carrying guns over the past two months - Crime Prevention Research Center", "Rep. Tim Ryan Upset NRA Won't Sit Down, But They Shouldn't", "Gun Control Advocates Want Banks to Refuse Service to Gun Companies"]}
{"comp": "ER_L", "month": "Aug", "feats": "sbert", "test": 0.6536, "summ1": ["REPORT: El Paso Shooting ‘Gang-Related Terrorism,’ Say Police", "Colorado State Rep Blasts Dan Crenshaw's Support for Red Flag Laws", "Chicago Weekend: 29 People Shot, 6 Dead -- 1,800 Shot This Year", "Must See: 5 Specific Times Democrats Wanted To Confiscate Your Guns"], "summ2": ["Every Day is the Day to Talk About Gun Control", "America Can Stop Gun Violence", "Trump Caught Making Reassurance Call To NRA, Won’t Take Any Action On Gun Violence", "White Terror on the Border"]}
{"comp": "ER_R", "month": "Jan", "feats": "bow", "test": 0.6531, "summ1": ["Harris Urges Gun Control: Put Members of Congress in a Locked Room With Autopsy Photos of Babies", "Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Democrats Introduce Gun Confiscation Legislation", "DOJ STUDY: Gun Control Laws Won’t Work Because Criminals Get Their Guns Illegally"], "summ2": ["DA calls Pittsburgh Gun-Control Plan Illegal, City Council Moves Forward Anyway", "U.S. Supreme Court (Finally) Takes Another Second Amendment Challenge to a Gun Control Law", "Baltimore School Board Votes ‘No’ To Arming Officers In Schools", "Republicans Torpedo Virginia Democrats' Anti-Gun Package, But This Is Only Round One"]}
{"comp": "L_R", "month": "Apr", "feats": "bow", "test": 0.6528, "summ1": ["Kamala Harris Is Ready to Take Executive Action on Gun Control", "20 years after Columbine, America sees roughly one mass shooting a day", "The NRA Wants to Stop Congress From Renewing the Violence Against Women Act", "1 Dead, 3 Injured In Shooting At California Synagogue, Allegedly By White Supremacist"], "summ2": ["NRA Sues Pittsburgh Over This Crazy Gun Control Measure", "Latest News of Self-Defense With Firearms Contradicts Gun Control Rhetoric", "Kamala Harris says some might find her unconstitutional approach to gun control ‘too bold’", "New Hampshire: Senate Committee to Hear Gun Control Bills"]}
{"comp": "LC_RC", "month": "Apr", "feats": "sbert", "test": 0.6509999999999999, "summ1": ["New Zealand passes new gun laws 26 days after mass shooting attacks on mosques", "Teacher 'would have taken the bullet' for Jackson middle schooler killed over a bike", "Twitter Can’t Ban Racism Because They’d Have to Ban Republicans, Too", "“Massive manhunt” underway for Florida woman “infatuated with Columbine” now armed with shotgun in Colorado"], "summ2": ["North Vancouver shooting victim dies from injuries", "The Constitution doesn't guarantee unlimited gun rights", "House move roils gun control debate at Minnesota Legislature", "'I'm amazed by what they do': Bears' Tarik Cohen and George McCaskey connect with Chicago men trying to rise above gun violence"]}
{"comp": "ER_RC", "month": "Apr", "feats": "bow", "test": 0.6496, "summ1": ["Eric Swalwell's Anti-Gun Agenda Is a Dog That Just Won't Hunt in America", "Ocasio Cortez Already Pushing For Gun Control After Deadly Shooting By Anti-Trump Lunatic At Synagogue", "Lindsey Graham is Now Drafting His Gun Confiscation Bill", "NYT: Breaking gun control law is a “victimless crime,” assuming you are black"], "summ2": ["The NRA Is Right About the Violence Against Women Act", "State lawmakers propose fingerprinting, more background checks on gun purchases after Aurora warehouse shooting", "New Zealand shooters back gun control after Christchurch mosques massacre", "Police to focus on gun violence"]}
{"comp": "C_RC", "month": "Feb", "feats": "sbert", "test": 0.6493, "summ1": ["Student Beaten To Death At School Over Phone | PatchPM", "House passage of gun safety bills reflects political shift", "Aurora shooting: 5 dead, multiple wounded including officers at Henry Pratt Company; gunman Gary Martin also dead", "Stevens County sheriff vows to ignore voter-approved Initiative 1639"], "summ2": ["4 Aurora cops, multiple civilians shot; shooter at large", "Wilber Ernesto Martinez-Guzman, illegal immigrant, charged with murder in four Nevada killings", "Illinois Police Admit That Oversight in a Background Check Allowed a Mass Shooter to Get a Gun", "Sisolak signs Nevada gun background checks bill into law"]}
{"comp": "R_RC", "month": "Jan", "feats": "bow", "test": 0.6492, "summ1": ["DA calls Pittsburgh Gun-Control Plan Illegal, City Council Moves Forward Anyway", "10-Year Old Suspended for Making 'Level 2 Lookalike Firearm' With Fingers", "Why The Financial Assault On The 2A May Be Getting Worse", "Virginia: Gov. Northam’s Anti-Gun Bills to be Heard in Committees"], "summ2": ["Judge acquits 3 Chicago cops of covering up Laquan McDonald's killing, backing police on each disputed point", "Ex-girlfriend: Accused Sebring bank shooter Zephen Xaver fascinated with violence", "What will happen when the Supreme Court hears its first gun rights case in 10 years?", "Dems to push gun control on anniversary of Giffords shooting"]}
{"comp": "L_LC", "month": "Sep", "feats": "sbert", "test": 0.6491, "summ1": ["Republicans brought an ‘academic’ who faked his own fan to speak about gun violence in America. This Democratic senator called him out", "2020 Candidates Raise Gun Control Issue After Odessa: ‘This Is F*cked Up!’", "The real reason Walmart just outflanked Donald Trump and Mitch McConnell", "Witnessing a Federal Execution"], "summ2": ["NRA sues San Francisco over terrorist declaration", "6 in 10 fear a mass shooting; most think gun laws can help: POLL", "What we know about the deadly shooting in Midland-Odessa, Texas", "A teen allegedly wanted to ‘shoot 400 people for fun.’ Cops found an AK-47 in her bedroom."]}
{"comp": "L_RC", "month": "Sep", "feats": "bow", "test": 0.6487, "summ1": ["West Texas Shooting Spree Leaves 7 Dead, Scores Injured; Gunman Killed", "Brother of Laura Ingraham slams her 'monstrous behavior' in attacking Greta Thunberg", "Despite universal support, NRA quickly pressures President Trump to drop expanded background checks", "Threat from Texas lawmaker drives home Beto O’Rourke’s point about assault weapons"], "summ2": ["The Second Amendment Helped Feinstein Make It out of San Francisco Alive\u0097But Don\u0092t Tell City Supervisors: News: The Independent Institute", "New Zealand clamping down further on gun ownership", "Trump says gun background checks would not have prevented recent gun violence", "1 killed and 2 injured in Flatbush attack"]}
{"comp": "C_L", "month": "May", "feats": "bow", "test": 0.6478, "summ1": ["39 shot, 7 fatally, in Chicago Memorial Day weekend gun violence", "Switzerland avoids clash with EU over gun laws", "Gun control takes center stage in 2020 Democratic presidential race", "Suspect arrested in stabbing death of 78-year-old Fairmont woman"], "summ2": ["NRA Legal Bills Raise ‘All Sorts of Red Flags’", "Just minutes away from Columbine, students tried to stop another deadly school shooting", "Pro-Gun Parkland Teen Kyle Kashuv Apologizes for ‘Inflammatory’ Racial Comments", "2020 Candidate Cory Booker Announces His National Gun Licensing Plan"]}
{"comp": "LC_RC", "month": "Jun", "feats": "sbert", "test": 0.6474, "summ1": ["Parkland’s David Hogg: ‘Children having to go through active shooter drills is not what freedom looks like to me’", "At least 12 dead, including suspect, in Virginia Beach shooting", "Shootings reported in Chicago, as new mayor pledges to tackle gun violence", "Advocacy groups team up on mailer attacking R.I. House Speaker Mattiello"], "summ2": ["Dems demand candidate proves claim of removing bullets from Pulse nightclub victims", "At Hampton Roads gun violence discussion, talk turns to counseling and programs for youth", "Advocate for evidence-based approaches to substance use and addiction honoured with lifetime achievement award", "Gun Makers Adjust Rifles to Skirt Bans"]}
{"comp": "C_L", "month": "Apr", "feats": "bow", "test": 0.6462, "summ1": ["New Zealand votes to amend gun laws after Christchurch attack", "15 shot, 3 fatally, in Chicago Monday", "Pittsburgh approves gun control bills; lawsuits expected", "Columbine threat by woman with gun shuts Denver-area schools"], "summ2": ["Kamala Harris promises to take executive action on gun safety if Congress drags its feet", "Top 5 Myths You’ll Hear The NRA Make About Background Checks", "Shooting Teachers With Pellet Guns Won’t Solve Gun Violence", "Gun control too often happens ‘on the backs’ of African-Americans, Pittsburgh activists say"]}
{"comp": "LC_R", "month": "Sep", "feats": "bow", "test": 0.6441, "summ1": ["New Zealand PM Ardern, Trump discuss gun control in first formal meeting", "Democrats, wary of backlash, won’t impose $25 tax on gun purchases in California", "Police: 21 People Shot, 5 Killed in Mass Shooting in Odessa and Midland, Texas", "‘The status quo is unacceptable’: Walmart will stop selling some ammunition and exit the handgun market"], "summ2": ["Democrat Senators Fear Beto O’Rourke Torpedoed Gun Control with Confiscation Push", "[UPDATE: NEW RESPONSE FROM CRUZ] – Ted Cruz SCHOOLS Mayor Lightfoot over Chicago’s gun control problem", "'I will not comply': Ex-cop tells House Judiciary Committee she will not obey assault weapon ban", "The Right is Losing the Second Amendment"]}
{"comp": "L_RC", "month": "Aug", "feats": "bow", "test": 0.643, "summ1": ["NRA lobbyist asking how to tell a 10-yr-old she can't have her pink assault rifle is peak NRA", "Trump’s America: Gun Violence and the War on Immigrants", "Trump denounced for ‘dangerous’ idea to lock up people with mental illnesses", "Mitch McConnell dodges calls from Democrats to end Senate recess to vote on gun control"], "summ2": ["Canadian PM Trudeau calls for action as gun violence spikes in Toronto", "‘The Hunt’ is over: Universal scraps ‘elites v. deplorables’ movie after gun violence uproar", "9 killed in Ohio in second U.S. mass shooting within 24 hours; gunman shot dead by police", "Democrat Conor Lamb says new gun laws not needed to prevent violence"]}
{"comp": "LC_RC", "month": "Jan", "feats": "bow", "test": 0.642, "summ1": ["Search Continues For Suspect in 7-Year-Old Houston Girl's Shooting", "House Democrats unveil bill expanding gun background checks", "Government shutdown: Is there a crisis on the US-Mexico border?", "Mexico death toll in two days of 'gang violence' reaches 29"], "summ2": ["Gun control bills die in Richmond as Republican-led committees vote them down", "From gun violence to her famous parents, Rosanne Cash brings personal songs to her two Southern California shows", "Armed Lakeland suspect surrenders to bomb squad robot", "Dems to push gun control on anniversary of Giffords shooting"]}
{"comp": "LC_RC", "month": "Jun", "feats": "bow", "test": 0.6419, "summ1": ["Donald Trump calls London Mayor Sadiq Khan a 'disaster' after spate of killings in British capital", "Florida woman charged after giving husband's guns to police", "At least 12 dead, including suspect, in Virginia Beach shooting", "House passes bill to require background checks on most gun purchases"], "summ2": ["Shooting in California Costco leaves 1 person dead, 2 injured", "Domestic violence call leads to weapons stash bust in Queens", "After massacre, Virginia Gov. Ralph Northam demands action on gun control", "Racial disparity and gun violence continues to grow in King County"]}
{"comp": "R_RC", "month": "Mar", "feats": "bow", "test": 0.6386, "summ1": ["Are Democrats Done With Gun Control For Time Being?", "The Second Amendment in the States", "Maine Considers Red Flag Bill Despite Safe State Status", "Military-style semi-automatic assault rifles are banned in New Zealand"], "summ2": ["Any Study Of 'Gun Violence' Should Include How Guns Save Lives", "NZ adopts harsh gun control measures after Christchurch massacre… to cheers & jeers in US", "West Norwood shooting: Teenager shot dead in broad daylight in south London", "New Zealand prime minister says gun laws will change in response to terror attack"]}
{"comp": "C_LC", "month": "May", "feats": "sbert", "test": 0.6384, "summ1": ["Emails show NRA link to U.S. sheriffs who promoted gun 'sanctuaries'", "Gun control takes center stage in 2020 Democratic presidential race", "41 shot, 7 fatally, in Chicago Memorial Day weekend gun violence", "Southeast DC charter school ups security after student fatally shot nearby"], "summ2": ["Two men armed with loaded guns ram police car: Police", "Bold plan needed to address guns", "Denver: One student killed and seven injured in shooting at school", "Deceased G.O.P. Strategist’s Hard Drives Reveal New Details on the Census Citizenship Question"]}
{"comp": "C_ER", "month": "Apr", "feats": "bow", "test": 0.6361, "summ1": ["New Zealand lawmakers pass tough gun laws over mosque attacks", "'He said he was gonna rob me, then he hit me with the gun': 73-year-old jitney driver talks about his decision to shoot would-be robber", "Audit shows NRA spending surged $100 million amidst pro-Trump push in 2016", "Columbine and other Colorado schools placed under security alert"], "summ2": ["Eric Swalwell's Anti-Gun Agenda Is a Dog That Just Won't Hunt in America", "Lindsey Graham is Now Drafting His Gun Confiscation Bill", "Driver Riddled with Bullets in 'Machine Gun' Attack in Khan's London", "AOC Uses Synagogue Shooting to Call for Universal Gun Registration"]}
{"comp": "LC_RC", "month": "Jan", "feats": "sbert", "test": 0.6354, "summ1": ["Five Killed In Mass Shooting At A Florida Bank", "Mayoral candidates’ rhetoric on gun violence, other issues needs close scrutiny", "Dems to push gun control on anniversary of Giffords shooting", "Trump wall: President addresses nation on border 'crisis'"], "summ2": ["From gun violence to her famous parents, Rosanne Cash brings personal songs to her two Southern California shows", "Problems with Pittsburgh's proposed gun control ordinance", "Utah gun rights activist faces felony firearms, drug charges", "All victims in bank shooting were women — who were killed in minutes: cops"]}
{"comp": "ER_R", "month": "Jul", "feats": "sbert", "test": 0.6348, "summ1": ["California Senate Votes 28-8 to Exempt Itself from California Gun Laws: Can you blame them?", "MAGA BEAUTY Stripped Of Miss MI Title Over Refusal To Wear Hijab…Tweet Sharing Stats About Black On Black Gun Violence", "Khan's London: Deadly Shootings and Child Stabbings Blight Weekend", "Chicago Mayor is in Denial About Chicago’s Gun Control Failure"], "summ2": ["‘You can’t be serious’: Sarah Silverman makes another incoherent case for stricter gun control laws", "Why Defensive Uses of Guns Should Disarm Second Amendment Skeptics", "More than three dozen shot, eight killed during bloody weekend in Chicago", "BREAKING: Virginia Legislature Adjourns Special Gun Control Session, Handing Gov. Northam Humiliating Defeat"]}
{"comp": "L_RC", "month": "Jul", "feats": "bow", "test": 0.6342, "summ1": ["At Least 3 Killed, 15 Wounded By Gunman At California’s Gilroy Garlic Festival", "At the Democratic Debate, Pete Buttigieg Addresses the Age Issue", "CNN Anchor Chokes Up While Defending Baltimore From Trump's Racist Attacks", "6 Organizations You Can Support to Promote Gun Control"], "summ2": ["New Zealand struggles to round up banned firearms under new gun control law", "California town wants to be a sanctuary — for gun owners", "Moms trying to stop gun violence in Chicago killed in shooting", "Stricter gun laws tied to fewer childhood gun deaths"]}
{"comp": "L_LC", "month": "Apr", "feats": "bow", "test": 0.6318, "summ1": ["Top 5 Myths You’ll Hear The NRA Make About Background Checks", "Texas Militia Leader Planned to Kill Barack Obama, Hillary Clinton & George Soros, According to FBI", "Action on Gun Violence in Kamala Harris’ First 100 Days", "Gun control too often happens ‘on the backs’ of African Americans, Pittsburgh activists say"], "summ2": ["New Zealand Passes Gun Laws Banning Semi-Automatic Weapons", "Grammy-nominated US rapper Nipsey Hussle shot dead", "Congressman Eric Swalwell set to run for president on gun control – report", "“Massive manhunt” underway for Florida woman “infatuated with Columbine” now armed with shotgun in Colorado"]}
{"comp": "LC_RC", "month": "May", "feats": "bow", "test": 0.6315, "summ1": ["Father shoots, kills 20-year-old son in Oklahoma City, police say", "Transcript: Americans affected by gun violence on \"Face the Nation,\" Feb. 25, 2018", "School shooting in Colorado kills one, wounds eight students, two suspects in custody", "The Senate Will Not Vote on Any Election Security Bills, GOP Senator Says – Mother Jones"], "summ2": ["Europe’s Most Pro-Gun Nation Just Voted for More Gun Control", "Pelosi Sneaks More Gun Control Onto Violence Against Women Act · 71 Republic", "Iowa City man faces charged related to 2018 shooting", "State Police sue gun maker over faulty pistols"]}
{"comp": "L_R", "month": "Aug", "feats": "bow", "test": 0.6312, "summ1": ["'Something needs to be done': A conversation about guns and race in America", "Watch John Oliver Talk Gun Control, ‘Weakened’ NRA, Trump’s ‘Lack of Empathy’", "STATEMENT: CAP’s Neera Tanden on Gun Violence and White Nationalism", "Mitch McConnell dodges calls from Democrats to end Senate recess to vote on gun control"], "summ2": ["Hollywood Pulls ‘The Hunt’ Movie In Light Of Gun Violence Controversy", "'Red flag' and background check legislation lead gun control measures that could get a vote in Congress", "Man Who Fired at Philadelphia Police Identified, Forbidden to Own Guns", "Elizabeth Warren Plans to Tax Americans Out of Their Second Amendment Rights"]}
{"comp": "L_LC", "month": "Feb", "feats": "bow", "test": 0.6312, "summ1": ["Sen. Klobuchar Calls for More 'Sensible' Gun Control After Mass Shooting in Aurora, IL", "Fox News' Chris Wallace Repeatedly Nails Stephen Miller on National Emergency", "Republican Advocates for Border Wall, Tries to Eject Parkland Parent from House Gun Legislation Hearing", "Survivors From Marjory Stoneman Douglas High School Talk About Their Year Since Tragic Shooting"], "summ2": ["Far From Parkland Spotlight, Teens In East Oakland Want To Tell Their Stories", "Gun control legislation pass House, but faces dim prospects in Senate", "New Trump rules make it easier for U.S. gun makers to sell overseas", "At least five civilians dead and five officers wounded in shooting in Aurora, Ill., officials say"]}
{"comp": "ER_R", "month": "Mar", "feats": "bow", "test": 0.6309, "summ1": ["Future Of Gun Control In Wake Of Muslim Massacre – DC Alert", "Next on the Gun Grab Agenda: HR 1263 Adds Semiautomatic Rifles and Shotguns to the National Firearms Act of 1986", "Revolt In The Democrat Party: 26 Dems Turn Their Backs On Pelosi, Vote With Republicans To Approve ICE Amendment In Gun Control Bill", "Maryland Sheriffs Tell Legislature Their Gun Control is a \"Suicide Mission\" for Cops. ⋆ Conservative Firing Line"], "summ2": ["CNN, MSNBC Laud New Zealand, Fret U.S. Not Getting Quick Gun Control", "Two Gun Bills Passed By Minnesota House", "Go Figure: Gun Controllers Use Fuzzy Math to Push an Agenda That Doesn’t Add Up", "The Latest: New Zealand bans all assault weapons immediately"]}
{"comp": "R_RC", "month": "Aug", "feats": "bow", "test": 0.6305, "summ1": ["Watch: tourists outnumbered and savagely beaten near White House", "Culture, not guns, is Philadelphia's big gun violence problem", "Gun Expert Debunks The Left’s Favorite Anti-2nd Amendment Talking Points", "'Red flag' and background check legislation lead gun control measures that could get a vote in Congress"], "summ2": ["El Paso native Beto O’Rourke at fore as Democrats call for gun control after mall shooting", "Man, 37, charged in double shooting that killed man, wounded boy, 4", "Meeting with Toronto's mayor, Trudeau promises more gun control and goes on the attack against Scheer", "Gun-control backers concerned about changing federal courts"]}
{"comp": "L_LC", "month": "Aug", "feats": "sbert", "test": 0.6292, "summ1": ["A Database Showed Far-Right Terror on the Rise. Then Trump Defunded It.", "Pelosi slams 'Moscow Mitch' on languishing House election security, gun safety bills", "Trump Caught Making Reassurance Call To NRA, Won’t Take Any Action On Gun Violence", "President Obama struggles for a solution to America’s mass shootings"], "summ2": ["America's politicians talk gun control and presidential blame following two mass shootings", "Family Court first stop for 16-year-old accused of shooting toddler", "Trump reassures NRA its views will be considered in gun talks", "Dayton, Ohio Active Shooter Reports in Oregon District"]}
{"comp": "L_R", "month": "Sep", "feats": "bow", "test": 0.6289, "summ1": ["Mitch McConnell Rails Against 'Moscow Mitch' Nickname: It's 'Over The Top'", "‘My AR is ready for you’: Texas Republican ominously issues death threat after Beto’s call to ban assault rifles", "Shooter killed in West Texas after 5 people died, at least 21 injured, police say", "Trump says background checks would not have prevented recent gun violence"], "summ2": ["[UPDATE: NEW RESPONSE FROM CRUZ] – Ted Cruz SCHOOLS Mayor Lightfoot over Chicago’s gun control problem", "AOC makes nonsensical argument against Dan Crenshaw’s background check example", "MSNBC Admits to Not Knowing Much About Gunman, Blames 'Loosened' Gun Laws Anyway", "Trump Will Announce Gun Bills as Early as This Week. Is the Second Amendment Safe?"]}
{"comp": "ER_R", "month": "Apr", "feats": "bow", "test": 0.628, "summ1": ["Democrats React to Poway Synagogue Shooting by Denouncing ‘Gun Violence’", "Gun Controllers Demand Banks Refuse Service", "Illinois Lawmaker Files Bill to Separate Chicago from Illinois", "NYT: Breaking gun control law is a “victimless crime,” assuming you are black"], "summ2": ["Federal Court Spanks California Over Magazine Capacity Limit", "New Hampshire: Senate Committee to Hear Gun Control Bills", "$350 per handgun, $200 per rifle: City and Toronto police announce gun buyback program", "Kamala Harris wants to use executive action for gun control if she is elected president"]}
{"comp": "C_LC", "month": "Jan", "feats": "bow", "test": 0.6271, "summ1": ["Supreme Court to hear biggest gun rights case since 2010", "Stoneman Douglas commission calls for arming teachers, more school security spending in first report to state leaders", "Man shot in hand during his attempt to rob two people in Norfolk", "Bill filed to repeal gun control measures adopted after Parkland massacre"], "summ2": ["Three dead, several injured in shooting at Torrance, California, bowling alley", "Accused shooter charged in deadly Atlantic City crime spree", "US shutdown: Trump angered by Democrats' rejection of 'compromise'", "Florida SunTrust Bank shooting victims, from a mother of 7 to a newlywed"]}
{"comp": "C_RC", "month": "May", "feats": "sbert", "test": 0.6267, "summ1": ["Emails show NRA link to U.S. sheriffs who promoted gun 'sanctuaries'", "Gun control takes center stage in 2020 Democratic presidential race", "Garda appeal over separate shootings of Dublin friends", "Southeast DC charter school ups security after student fatally shot nearby"], "summ2": ["Ford: Why do we keep talking about gun control but do nothing about it?", "Boston police officer indicted for misleading investigators about Christmas Eve shooting", "1 year after Santa Fe shooting, Texas shuns tougher gun laws", "Swiss voters approve tighter gun control, avoid EU clash"]}
{"comp": "L_LC", "month": "Sep", "feats": "bow", "test": 0.625, "summ1": ["‘My AR is ready for you’: Texas Republican ominously issues death threat after Beto’s call to ban assault rifles", "Over 40 People Have Been Arrested As Potential Mass Shooters Since El Paso", "Trump says background checks would not have prevented recent gun violence", "The NRA Is Losing Power In Congress — Even With Republicans"], "summ2": ["New Zealand PM Ardern, Trump discuss gun control in first formal meeting", "At Least 5 Dead, 21 Injured In West Texas Shooting", "Beto O'Rourke's Bold Statement on Gun Control: 'Hell Yes' He Wants to Take Your AR-15", "UPDATE 1-White House to propose expedited death penalty for perpetrators of mass shootings"]}
{"comp": "ER_R", "month": "Feb", "feats": "sbert", "test": 0.625, "summ1": ["Why Does the MSM Keep Falling for Obvious Hoaxes?", "Washington Sheriffs Decline to Enforce Gun Control", "As Dems Push Gun Control, Activist Kelly Opens AZ Senate Campaign ⋆ Conservative Firing Line", "Baltimore body count continues to climb despite gun control ⋆ Conservative Firing Line"], "summ2": ["House and Senate Democrats Introduce Federal ‘High Capacity’ Magazine Ban Bill", "Chicago Mayor Candidate Plans to Sue Wisconsin, Indiana Over Less Restrictive Gun Laws", "Police: Aurora Shooter Was Not Allowed to Own Firearms Due To Criminal Past", "U.S. House of Representatives Passes Extreme Gun Control Bill"]}
{"comp": "C_LC", "month": "Jan", "feats": "sbert", "test": 0.6229, "summ1": ["Diocese in Kentucky Investigates After Students Mock Native American at Washington Rally", "Police: 5 fatally shot inside Florida bank, suspect arrested", "Opponents, supporters of deadly force law, I-940, agree with proposed changes", "Bill filed to repeal gun control measures adopted after Parkland massacre"], "summ2": ["4 homicides in 1 day: 2 men dead after shootout in Jackson", "Debate brewing over gun control bills pending in Maine Legislature", "Here are some real emergencies. None of them requires the president to turn into a dictator.", "Accused gunman \"always hated people and wanted everybody to die,\" ex-girlfriend says"]}
{"comp": "L_LC", "month": "May", "feats": "bow", "test": 0.6218, "summ1": ["Manuel Oliver Creates Mural Comparing Gun Laws to Animal Protection Laws", "Just minutes away from Columbine, students tried to stop another deadly school shooting", "New NRA President Says Georgia Democrat Only Won Her Seat in Congress Because She’s Black", "Cory Booker unveils his plan to curb gun violence: federal gun licenses, no more loopholes"], "summ2": ["Booker compares gun control fight to civil rights movement; endorses 'Medicare for all who want it'", "Voters in Switzerland approve stronger gun control laws by nearly two-thirds despite resistance", "Eight students injured in shooting at suburban Denver school, police say. Two suspects, both students, in custody.", "Annapolis man shot hours before event to discuss recent gun violence"]}
{"comp": "ER_R", "month": "Mar", "feats": "sbert", "test": 0.6209, "summ1": ["New Zealand Prime Minister Proposes Extreme Gun Control In Wake Of Deadly Shooting", "‘Gun sanctuary’ movement spreads in four states; Dem majorities miffed ⋆ Conservative Firing Line", "“We Will Not Comply” – Maryland Sheriffs Tell Legislature Their Gun Control is a “Suicide Mission” for Police", "CNN's Bash Blames Trump, Breitbart News for New Zealand Massacres"], "summ2": ["Oregon Crime Statistics Don’t Justify Gun Control Push", "MSNBC Host's Reason For Why We Should Ban AR-15s Blows Up In His Face", "New Zealand Prime Minister Will Announce New Gun Control Proposals Within Week", "House Dems overwhelmingly reject motion to condemn illegal immigrant voting"]}
{"comp": "L_LC", "month": "Jul", "feats": "sbert", "test": 0.62, "summ1": ["State gun laws aren't enough", "Why a Climate Debate Is a Terrible Idea", "Weekend Gun Violence Racks Up The Usual Totals, 'Nothing Can Be Done'", "Bob Mercer, Glorified Mall Cop, Has a Badge—and Lots of Guns"], "summ2": ["‘Enough is enough’ — Democratic candidates respond to mass shooting at Gilroy festival", "New Zealand gun owners turn over their weapons for money", "Walmart shooting in Mississippi: Police identify man who killed 2 and wounded 2", "Hannah Williams: 5 Fast Facts You Need to Know"]}
{"comp": "ER_R", "month": "Sep", "feats": "bow", "test": 0.6197, "summ1": ["Watch: Conservative Reporter Calls Out The Left’s Climate Hypocrisy, Gun Control Hysteria", "President Trump: Stronger Background Checks Would Not Stop Attacks", "Chicago Mayor Enraged at Ted Cruz for Telling the Truth About Gun Violence in her City", "Happening NOW: Cory Booker Introduces Radical Gun Control Legislation Into Congress"], "summ2": ["Boom: Dana Loesch Unloads On Chicago Mayor For Failed Policies That Benefit Prohibited Gun Possessors", "MSNBC Admits to Not Knowing Much About Gunman, Blames 'Loosened' Gun Laws Anyway", "Ex-California state senator sentenced in racketeering case", "Trump Will Announce Gun Bills as Early as This Week. Is the Second Amendment Safe?"]}
{"comp": "ER_RC", "month": "Jan", "feats": "bow", "test": 0.6187, "summ1": ["Will the Democrat Push for Gun Control Backfire?", "Police: Once-Deported Illegal Alien Murdered American in ‘Reign of Terror’", "Full Court Press for Your Guns ⋆ Conservative Firing Line", "DOJ STUDY: Gun Control Laws Won’t Work Because Criminals Get Their Guns Illegally"], "summ2": ["Gun control bills die in Richmond as Republican-led committees vote them down", "Supreme Court to hear New York gun control case that aims to restrict firearm transportation", "Armed Lakeland suspect surrenders to bomb squad robot", "Dems to push gun control on anniversary of Giffords shooting"]}
{"comp": "C_RC", "month": "Jun", "feats": "sbert", "test": 0.6167, "summ1": ["Concord State Rep. Pleads Guilty To Assault Charge", "Barack Obama’s Message on National Gun Violence Awareness Day: ‘We Can’t Get Numb to This’", "Over 30 shot, 3 fatally, as weekend violence grips Chicago", "Virginia governor calls special session on gun control after Virginia Beach massacre"], "summ2": ["A look at 8 gun-control measures NJ lawmakers are considering", "Suppressors: Trump's Next Infringement · 71 Republic", "Midlothian police officer who fatally shot security guard Jemel Roberson placed on administrative leave, officials say", "Liberals want to prohibit more assault weapons rather than ban handguns"]}
{"comp": "C_RC", "month": "Sep", "feats": "bow", "test": 0.6146, "summ1": ["26 shot, 5 fatally, in Chicago weekend violence", "Trump says expanded U.S. gun background checks under consideration", "Beto O'Rourke wants action on guns, regardless of political cost", "Hours after shooting rampage, Texas gun laws loosened"], "summ2": ["Transgender woman shot multiple times in hate crime, Dallas police say", "When the NRA Opposed Open Carry", "Trump says gun background checks would not have prevented recent gun violence", "Federal election 2019 roundup: Scheer promises new MRI and CT machines and fields gun control questions"]}
{"comp": "C_RC", "month": "May", "feats": "bow", "test": 0.6123, "summ1": ["27 shot, 5 killed so far in Memorial Day weekend gun violence", "Switzerland avoids clash with EU over gun laws", "Multiple students injured at STEM School Highlands Ranch shooting; deputies still searching for suspect(s)", "Gun control takes center stage in 2020 Democratic presidential race"], "summ2": ["Girl firepower: IDF vet ‘Queen of guns’ praises US firearm laws as ‘best in the world’", "Oregon City woman survives husband's shooting, then must decide his fate", "Police say man carried in gun that killed boy", "Gun-loving Swiss agree to harsher firearm control to avoid Schengen tensions"]}
{"comp": "LC_RC", "month": "Jul", "feats": "bow", "test": 0.6114, "summ1": ["Is Trump’s Use Of Identity Politics An Effective Strategy?", "The Virginia Legislature Held a Special Session to Pass Gun Control. Then State Republicans Pulled a Mitch McConnell.", "At least 3 killed, including 6-year-old, in shooting at garlic festival in California", "Man who returned fire as 3 shot 10 outside Allentown nightclub faces gun charge, DA says"], "summ2": ["Chicago moms who worked to stop gun-violence killed in drive-by shooting", "New Zealand tightens gun laws again after mosque attack", "Virginia is now election battleground in fight over gun laws", "Gun ban debate leads board to ask Ottawa police for report on how to curb gun violence"]}
{"comp": "ER_R", "month": "Sep", "feats": "sbert", "test": 0.6107, "summ1": ["Uncertain Trump Mulls Gun Control Measures Like Red Flag Laws", "Steven Seagal Thinks Many Mass Shootings Are “Engineered” by the Government", "After 41 Shot In Chicago Over Weekend, Democratic Mayor Blames... Republicans?!", "Crying Chuck Schumer Uses Mass Shooting To Push For EXTREME Gun Control – The Times Of America"], "summ2": ["Boom: Dana Loesch Unloads On Chicago Mayor For Failed Policies That Benefit Prohibited Gun Possessors", "Student Shot at Columbine Stumps Beto with Question About Gun Ban", "MSNBC analyst Zerlina Maxwell’s smug dismissal of gun owners’ concerns betrays her own ignorance — and proves their concerns are legit", "If you think you support red flag gun laws, listen to Jim Jordan talking about them"]}
{"comp": "C_LC", "month": "Mar", "feats": "bow", "test": 0.6101, "summ1": ["House passes measure on gun control", "Police: Sebewaing man shot at Michigan State Police, who returned fire and killed him", "After massacre, Trump downplays white nationalism threat", "New Zealand bans types of semi-automatic weapons used in mosque mass shooting"], "summ2": ["The Myth of Australia’s Gun Control Success", "Father of Sandy Hook victim latest apparent suicide after deadly school shootings", "Victims of gun violence launch effort pressuring Senate to take up legislation", "New Zealand prime minister says gun laws will change in response to Christchurch terror attack"]}
{"comp": "C_RC", "month": "Jan", "feats": "bow", "test": 0.6084, "summ1": ["House to hold first hearing on gun violence in nearly a decade", "States rise up against Washington", "Bill filed to repeal gun control measures adopted after Parkland massacre", "Authorities name man who killed rookie California officer"], "summ2": ["Gun control bills die in Richmond as Republican-led committees vote them down", "From gun violence to her famous parents, Rosanne Cash brings personal songs to her two Southern California shows", "Armed Lakeland suspect surrenders to bomb squad robot", "What will happen when the Supreme Court hears its first gun rights case in 10 years?"]}
{"comp": "LC_R", "month": "Jul", "feats": "bow", "test": 0.6083, "summ1": ["Is Trump’s Use Of Identity Politics An Effective Strategy?", "Garlic festival shooting: Three dead in Gilroy California", "3-year-old boy dies after shooting himself in face", "'Enough is enough': Virginia lawmakers debate ban on assault weapons"], "summ2": ["Fox News: Dems and gun control - they want it whether it works or not - Crime Prevention Research Center", "Netfilx’s New Film Release ‘Secret Obsession’ Exposes California’s Dumb Gun Laws", "More than three dozen shot, eight killed during bloody weekend in Chicago", "Shocker: Anti-Gun Senator Is Writing Anti-Gun Book"]}
{"comp": "ER_R", "month": "May", "feats": "bow", "test": 0.6069, "summ1": ["Students angrily walk out of Colorado school shooting vigil in protest after speakers push gun control and politicize tragedy", "Booker's outrageous gun control scheme ignores second amendment right", "CA Dems Legalizing Soviet-Style Reporting of Legal Gun-Owning Co-Workers", "The History of Gun Control & Crime in Australia, New Zealand, & the UK"], "summ2": ["STEM students storm out, chant ‘mental health’ when gun-control activist, Dems politicize vigil for victims", "The Second Amendment Saved These Gun Owners’ Lives in April", "Cory Booker plans national gun registry", "Philly Concealed Carrier Shoots at, Scares Off Would-Be Home Invader"]}
{"comp": "C_RC", "month": "Jun", "feats": "bow", "test": 0.6066, "summ1": ["Chicago weekend gun violence injures 44, kills 4", "$665K In Drugs, Illegal Guns Seized In Philly: Attorney General", "Democratic debate: 10 candidates discuss immigration, gun control, health care in first night", "At least 12 killed after 'disgruntled' city employee opens fire at Virginia municipal centre"], "summ2": ["Shooting in California Costco leaves 1 person dead, 2 injured", "After massacre, Virginia Gov. Ralph Northam demands action on gun control", "Budget undercuts Trump focus on mental health, school safety", "Officials: 5-Year-Old Shoots Toddler in Head, Uncle Charged"]}
{"comp": "C_RC", "month": "Feb", "feats": "bow", "test": 0.6052, "summ1": ["Trump threatens to veto gun bills pushed by Democrats", "Your View by Sen. Bob Casey: One year after Parkland shootings, it's time to pass gun reforms", "SLED investigating officer-involved shooting in Greenville County", "Majority backs tougher gun laws, but don't think lawmakers will act: poll"], "summ2": ["Aurora's 'Cross Man' travels the country honoring lives lost to gun violence. Now he's doing it in his hometown.", "Police: Aurora attacker used gun he shouldn’t have owned", "2 Las Vegas men charged with stealing guns from SHOT Show", "'Second Amendment Sanctuary County' movement spreads in New Mexico"]}
{"comp": "L_LC", "month": "Aug", "feats": "bow", "test": 0.605, "summ1": ["Trump's America: Gun Violence and the War on Immigrants", "NRA lobbyist asking how to tell a 10-yr-old she can't have her pink assault rifle is peak NRA", "Trump super PAC official admits the president could do something on gun control if he wanted: report", "Mitch McConnell dodges calls from Democrats to end Senate recess to vote on gun control"], "summ2": ["Dayton shooting: Nine confirmed killed, shooter also dead", "Andrew Cuomo wants presidential candidates to sign this gun-control pledge", "Message to Senate from 243 mayors: Stop recess, work on gun safety", "El Paso mass shooting suspect arrested after fatal attack at Texas Walmart"]}
{"comp": "C_RC", "month": "Aug", "feats": "sbert", "test": 0.6046, "summ1": ["11 dead, nearly 70 wounded in weekend violence in Chicago", "Local lawmakers, gun groups respond to mass shootings", "Gun control groups to rally in all 50 states to pressure GOP", "Washington High School Alumnus Among Victims Of Dayton Shooting"], "summ2": ["The Argument Beneath the Surface of Gun Control", "Dayton mass shooter Connor Betts slaughtered own sister during rampage: officials", "Police chiefs say handgun ban won't stop flow of weapons into Canada", "Juarez murders reach nearly 200 a month as Mexico’s next president prepares to face the violence"]}
{"comp": "C_RC", "month": "Jul", "feats": "sbert", "test": 0.6044, "summ1": ["Young man stabbed to death in Shepherd's Bush in west London", "Florida Democrats criticize state’s appeal of gun preemption ruling", "57 shot, 5 fatally, in 4th of July weekend gun violence across Chicago", "Norfolk Police engage with the community on gun violence"], "summ2": ["Virginia County Stands Up to Gun Control", "As Goes Pennsylvania, So Goes the 2020 Election", "US reels after shootings leave five dead, dozens injured", "Gun ban debate leads board to ask Ottawa police for report on how to curb gun violence"]}
{"comp": "C_LC", "month": "Mar", "feats": "sbert", "test": 0.6037, "summ1": ["AP-NORC Poll: Majority of Americans favor stricter gun laws", "Dog killed after saving family from shooter who opened fire on birthday party", "Suspect in mob boss hit flashes pro-Trump slogans on hand", "Christchurch mosque shootings: Jacinda Ardern reveals more on changes to NZ's gun laws"], "summ2": ["New Zealand’s swift change to gun laws highlights 25 years of US inaction", "Veteran journalist blasts Alan Jones after he backs Pauline Hanson over NRA links", "Terror suspect fronts court as NZ Prime Minister vows to change gun laws", "1 dead, 4 wounded Friday in Chicago gun violence"]}
{"comp": "ER_R", "month": "Aug", "feats": "sbert", "test": 0.603, "summ1": ["Dayton Shooter Identified: 24-Year-Old Connor Betts from Bellbrook, Ohio -- Wore Heavy Metal Band Hoodie", "Scalise Turns The Tables After Reporter Insinuates Trump’s ‘Language’ Causes Gun Violence: ‘[Trump] Is No More Responsible As Bernie Is For My Shooting’", "RINO Senator Revamps Push For Unenforceable Gun Control Law", "Must See: 5 Specific Times Democrats Wanted To Confiscate Your Guns"], "summ2": ["Gun-Control Advocacy: Mostly Demagoguery", "Trump Visits El Paso and Dayton, Shares the Need for Better Gun Control", "California Concealed Carry Trainer Accidentally Shoots Student While Clearing His Gun", "DC expanding absurd criminal leniency to murderers under 25. Republicans still on board for criminal justice ‘reform’"]}
{"comp": "C_RC", "month": "Apr", "feats": "sbert", "test": 0.6026, "summ1": ["Young woman obsessed with Columbine is found dead", "Appeals court throws out lawsuit against Massachusetts assault weapons ban", "San Diego-area synagogue shooting leaves one worshipper dead, three wounded", "House move roils gun control debate at Minnesota Legislature"], "summ2": ["Albuquerque police focus on countering gun violence", "Pauline Hanson: One Nation documentary exposes NRA link", "Here Is Why a Federal Judge Nixed California's Ban on 'Large Capacity Magazines'", "House move roils gun control debate at Minnesota Legislature"]}
{"comp": "LC_R", "month": "Aug", "feats": "bow", "test": 0.6022, "summ1": ["At least 9 dead, 16 injured in mass shooting in downtown Dayton, Ohio: Police", "“I’m as ready as I can be”: Students learn to tackle active shooters", "Trump denounces racism and white nationalism after mass shootings", "US shootings: Trump says 'serious' talks on gun control under way"], "summ2": ["Philly Mayor: It’s the NRA’s Fault a Violent Drug-Dealing Felon Shot 6 Police Officers", "'Red flag' and background check legislation lead gun control measures that could get a vote in Congress", "'The Hunt' Shows Liberals Murdering Conservatives. Do We Need That?", "Keep attacking gun control. The President is listening."]}
{"comp": "C_LC", "month": "Jun", "feats": "sbert", "test": 0.6021, "summ1": ["Florida Woman Charged After Turning Over Husband’s Guns Following His Domestic Violence Arrest", "Progressive politics have done nothing to help black America", "Over 30 shot, 3 fatally, as weekend violence grips Chicago", "Virginia governor announces special session on gun control following shooting"], "summ2": ["Senate Republicans Must Act to Implement Sane Gun Reforms", "‘Lock the S.O.B.’s Up’: Joe Biden and the Era of Mass Incarceration", "Licensing effective at cutting gun crime: Letter", "Toronto Raptors: Four people injured in victory parade shooting"]}
{"comp": "LC_RC", "month": "Feb", "feats": "sbert", "test": 0.6018, "summ1": ["Soul-searching after Parkland, Dick's CEO embraces tougher stance on guns", "Most oppose Trump declaring national emergency for wall funding, CBS News poll finds", "Among top priorities are expanded background checks, gun violence report", "At least five civilians dead and five officers wounded in shooting in Aurora, Ill., officials say"], "summ2": ["Some Parkland parents angry no mention of of gun law reform in SOTU", "Wilber Ernesto Martinez-Guzman, illegal immigrant, charged with murder in four Nevada killings", "Illinois Police Admit That Oversight in a Background Check Allowed a Mass Shooter to Get a Gun", "The Aurora victims' stories: Intern's 1st day on the job, a family patriarch, an 'incredible' dad, a Mississippi State fan, a union leader"]}
{"comp": "LC_RC", "month": "Feb", "feats": "bow", "test": 0.6003, "summ1": ["Trump Expected To Declare National Emergency To Help Fund Southern Border Wall", "Parkland school turns to experimental surveillance software that can flag students as threats", "Gun control legislation pass House, but faces dim prospects in Senate", "Alabama officer's fatal shooting of 21-year-old at mall was 'justified,' state says"], "summ2": ["House Democrats examine ways to reduce gun violence", "Aurora's 'Cross Man' travels the country honoring lives lost to gun violence. Now he's doing it in his hometown.", "Police: Aurora attacker used gun he shouldn’t have owned", "Some counties exempting sheriffs from any new gun control laws"]}
{"comp": "L_LC", "month": "Mar", "feats": "bow", "test": 0.5985, "summ1": ["Less than 24 hours after mass shooting at mosques, New Zealand vows to ban semi-automatic rifles", "Trump is urging his supporters to use violence and ‘brute force’ because investigations are closing in on him: Robert Reich", "Male Republican says mom-led gun safety advocacy group needs to ‘get over themselves’", "28 Parkland Students Traveled to New Zealand to Attend a Summit on Youth Activism"], "summ2": ["Twin gun control bills clear another House committee", "Australian gun laws: One Nation party 'sought NRA money' in US", "5 people wounded Tuesday in gun violence across Chicago", "NZ bans types of semi-automatic weapons, high capacity magazines after mass shooting"]}
{"comp": "C_LC", "month": "Sep", "feats": "sbert", "test": 0.5973, "summ1": ["6 people, including 3 minors, shot in Downtown Indianapolis", "Text - H.R.4081 - 116th Congress (2019-2020): Sabika Sheikh Firearm Licensing and Registration Act", "O'Rourke: We can't meet gun violence threat with 'half measures' or 'half the country'", "The Latest: 7 people killed in West Texas shooting rampage"], "summ2": ["John & Mary Sisk Family: 5 Fast Facts You Need to Know", "San Francisco passes resolution calling NRA \"domestic terrorist organization\"", "How to redesign the debates for our current political climate", "Lines harden on gun policy after West Texas rampage"]}
{"comp": "ER_R", "month": "Aug", "feats": "bow", "test": 0.5969, "summ1": ["ANOTHER BLOODY CHICAGO WEEKEND: Two Mass Shootings…51 People SHOT…7 DEAD…Silence From Democrat Leaders", "Dayton Shooter Supported Gun Control, Socialism, Liz Warren", "UK: Vid of Machete Attack on Cop Emerges, Suspect 'Muhammed Rodwan'", "There Are Some Republicans Fighting for Your Gun Rights"], "summ2": ["Culture, not guns, is Philadelphia's big gun violence problem", "'Red flag' and background check legislation lead gun control measures that could get a vote in Congress", "Anti-Gun Activist Walks Into Walmart, Asks For Gun To Kill 200 People — But It Was Just A Political Statement", "Keep attacking gun control. The President is listening."]}
{"comp": "C_RC", "month": "Jan", "feats": "sbert", "test": 0.596, "summ1": ["Supreme Court returns to gun rights for first time in 9 years", "More gun control bills announced as Va. lawmakers get to work", "Passerby who held stabbing suspect at gunpoint ‘performed public service,’ prosecutor says", "Parkland students' 'die-in' protest turns into shouting match with Trump supporters"], "summ2": ["'Sicario' review: On the border between the U.S. and Mexico, money talks and violence rules", "California Democrat And Gun Control Advocate Charged With Arms Trafficking", "All victims in bank shooting were women — who were killed in minutes: cops", "Gun control bills die in Richmond as Republican-led committees vote them down"]}
{"comp": "ER_R", "month": "Jun", "feats": "sbert", "test": 0.5958, "summ1": ["Democrat Debate: Joe Biden Says NRA Is Not 'Our Enemy'", "Gun Owners of America Counsel Urges Trump to Avoid Passing Gun Control", "REALITY CHECK: More Gun Control Would NOT Have Stopped Virginia Beach Perpetrator", "WATCH: Obama Gets Paid $600,000 to Lie to Foreign Crowd About U.S. Gun Laws - Repeatedly"], "summ2": ["Trump on Suppressors: ‘I Don’t Like Them At All’", "End epidemic of young black-on-black gun violence, court heard", "Ohio Gun Control Group Proposes Universal Background Checks", "Guns And Parts of Firearms Reportedly Stolen From ATF Facility"]}
{"comp": "C_L", "month": "Sep", "feats": "bow", "test": 0.5929, "summ1": ["New Zealand PM Ardern, Trump Discuss Gun Control in First Formal Meeting", "The Latest: U.S. mass killings reach total for all of 2018", "CEOs Speak Out on Gun Violence, Want Congressional Action", "37 shot, 7 fatally, in Chicago Labor Day weekend violence"], "summ2": ["Report: Gunman in West Texas shooting rampage was fired hours before", "Mitch McConnell Rails Against 'Moscow Mitch' Nickname: It's 'Over The Top'", "Democrats Desperately Press Trump, GOP For Gun Control Legislation", "‘My AR is ready for you’: Texas Republican ominously issues death threat after Beto’s call to ban assault rifles"]}
{"comp": "C_LC", "month": "Aug", "feats": "sbert", "test": 0.5907, "summ1": ["Nashville lawmakers, activists rally for gun control on capitol steps after mass shootings in Texas, Ohio", "20 dead, more wounded after gunman attacks Texas shoppers", "Trump tells NRA chief that universal background checks are off the table", "Progressive Queens DA candidate concedes in tight race"], "summ2": ["Ending Gun Violence Is All Our Responsibilities", "America's politicians talk gun control and presidential blame following two mass shootings", "Knife attack leaves 1 dead and 9 injured in France; suspect detained", "After shooting in El Paso, Gov. Greg Abbott announces Texas Safety Commission roundtables"]}
{"comp": "LC_RC", "month": "Jul", "feats": "sbert", "test": 0.5903, "summ1": ["Gun Ownership Rates Tied to Domestic Homicides, but Not Other Killings, Study Finds", "‘Enough is enough’ — Democratic candidates respond to mass shooting at Gilroy festival", "Walmart shooting in Mississippi: Police identify man who killed 2 and wounded 2", "Liberals Warren and Sanders unite against moderates: 6 takeaways from night one of the Democratic debate"], "summ2": ["Correcting the record on ammo and guns", "Virginia County Stands Up to Gun Control", "Victims and perpetrators of gun violence will work together to transform 50 vacant city lots into gardens", "US reels after shootings leave five dead, dozens injured"]}
{"comp": "L_LC", "month": "Jul", "feats": "bow", "test": 0.59, "summ1": ["We talked to experts about how debate moderators can stop asking lousy gun violence questions", "6-Year-Old Boy Among 3 Dead at Gilroy Garlic Festival Mass Shooting", "Bob Mercer, Glorified Mall Cop, Has a Badge—and Lots of Guns", "CNN Anchor Chokes Up While Defending Baltimore From Trump's Racist Attacks"], "summ2": ["Garlic festival shooting: Three dead in Gilroy California", "Dad charged in quadruple slaying in Cleveland’s Slavic Village, including 6-year-old son, 2-year-old girl, officials say", "Man Arrested in Threats to Two Senators : Roberti and McCorquodale Warned on Gun-Control Measure", "FBI: More active shooting incidents in 2017 than any other year recorded"]}
{"comp": "LC_RC", "month": "Mar", "feats": "bow", "test": 0.5896, "summ1": ["We must include the transgender community in the gun violence prevention movement", "Father of Sandy Hook victim latest apparent suicide after deadly school shootings", "The NRA Coached An Australian Anti-Immigration Party In Fighting Gun Control Laws", "New Zealand prime minister vows 'gun laws will change' after mass shooting at mosques"], "summ2": ["A closer look at New Zealand's new weapons ban", "Poll: Majority of Americans favor stricter gun laws", "'One of New Zealand's darkest days': PM Ardern says gun laws will change in wake of mosque attacks", "Federal government targets B.C. guns and gang violence with $5.3 M fund"]}
{"comp": "C_LC", "month": "Apr", "feats": "bow", "test": 0.5892, "summ1": ["'He said he was gonna rob me, then he hit me with the gun': 73-year-old jitney driver talks about his decision to shoot would-be robber", "New Zealand’s New Gun Control Laws Passes First Parliamentary Test", "AP-NORC Poll: Bullying, not schools, blamed for shootings", "29 shot, 4 fatally, in Chicago Easter weekend shootings"], "summ2": ["Rapper Nipsey Hussle killed in shooting outside his L.A. store", "New Zealand Introduces Gun Control Bill Expected To Become Law Within Weeks", "Schools across Denver area closed as “massive manhunt” continues for armed woman “infatuated with Columbine”", "There have been 1,001 mass shootings in America since 2013"]}
{"comp": "ER_R", "month": "Jun", "feats": "bow", "test": 0.5879, "summ1": ["On Second Night of Presidential Debate Dems Supported Massive Gun Control", "Harriet Tubman was a gun-toting Republican", "More Gun Control: Trump Says He’s “Seriously” Considering Banning Silencers", "Virginia Beach Gun Control Fail"], "summ2": ["Obama says US gun laws 'don't make much sense,' claims 'anybody can buy any weapon any time'", "2020 Dems call for action against 'gun violence' after Virginia Beach shooting", "Defensive gun uses by people legally carrying guns over the past two months - Crime Prevention Research Center", "New York: Legislature Attempting to Moot Supreme Court Review of NYC Law"]}
{"comp": "C_RC", "month": "Apr", "feats": "bow", "test": 0.5846, "summ1": ["Swalwell kicks off campaign discussing gun control: 'This issue comes first'", "New Zealand votes to amend gun laws after Christchurch attack", "Jacksonville police investigating shooting of 2-year-old girl", "Man with assault weapon opens fire in San Diego County synagogue; woman dies and 3 are injured"], "summ2": ["Bump stocks, gun control bills pass before midnight deadline", "State lawmakers propose fingerprinting, more background checks on gun purchases after Aurora warehouse shooting", "New Zealand gun owners back gun control after massacre", "As cold weather breaks, violence returns: 24 shot in 30 hours over warmest weekend this year"]}
{"comp": "C_L", "month": "Aug", "feats": "bow", "test": 0.5844, "summ1": ["Gun Laws By State 2019", "U.S. House targets convergence of mass shootings, hate crimes", "2 mass shootings in Dayton, OH and El Paso, TX: 29 killed, and it could have been worse", "40 shot, 3 fatally since Friday evening in Chicago weekend shootings"], "summ2": ["The NRA Has Thrown $1.6 Million At Mitch McConnell To Block Expanded Background Checks", "Trump's America: Gun Violence and the War on Immigrants", "‘No more’: Nebraska state Republican calls out his party in brutally blunt terms on gun violence", "PEOPLE's Call to Action: Contact Congress to Ask What Is Being Done to Stop the Epidemic of Gun Violence"]}
{"comp": "LC_RC", "month": "Mar", "feats": "sbert", "test": 0.5843, "summ1": ["People rally against racism in Quebec City, express support for New Zealand", "New Zealand pledges reforms as relaxed gun laws scrutinised", "Father Of Sandy Hook Shooting Victim Dies By Apparent Suicide", "Congress Considers Tackling Gun Violence By Permitting Even More Guns"], "summ2": ["The Times view on New Zealand after Christchurch: it will take more than gun control", "House acts on concealed-gun reciprocity bill lowering license age to 18", "NZ gun club destroyed by fire in Christchurch shooting aftermath", "Four plead guilty to illegally running guns from Columbus to Canada"]}
{"comp": "C_LC", "month": "Aug", "feats": "bow", "test": 0.5835, "summ1": ["U.S. House targets convergence of mass shootings, hate crimes", "Trump blames mass shootings on mentally ill, calls for more mental institutions", "Trump reassures NRA on gun control talks", "40 shot, 3 fatally since Friday evening in Chicago weekend shootings"], "summ2": ["9 killed in Ohio in second US mass shooting within 24 hours", "Inside the Government, Addressing Domestic Terrorism Has Been Fraught", "Mass shooting leaves at least 20 dead, dozens injured in El Paso, police say", "Trump Visits Dayton and El Paso Amid Calls for Gun Control"]}
{"comp": "C_LC", "month": "May", "feats": "bow", "test": 0.5827, "summ1": ["City Of Pittsburgh Agrees Not To Enforce Gun Control Legislation During Ongoing Court Proceedings", "38 shot, 5 fatally, in Chicago Memorial Day weekend gun violence", "Switzerland avoids clash with EU over gun laws", "Gun control takes center stage in 2020 Democratic presidential race"], "summ2": ["Voters in Switzerland approve stronger gun control laws by nearly two-thirds despite resistance", "NRA, gun rights groups using New York City rules to seek expansion of Second Amendment in Supreme Court", "The problem with banning guns for people on the no-fly list", "Eight students injured in shooting at suburban Denver school, police say. Two suspects, both students, in custody."]}
{"comp": "C_LC", "month": "Jun", "feats": "bow", "test": 0.5825, "summ1": ["Chicago weekend gun violence injures 44, kills 4", "Florida woman charged after giving husband's guns to police", "Virginia Governor Announces Special Session on Gun Control", "Commentary: Why California must invest more in violence intervention programs"], "summ2": ["Democratic candidate Eric Swalwell honors Parkland victims with orange ribbon on 2nd night of debate", "Salt Lake City mayoral candidates say young people must push City Hall to take ‘courageous steps’ in gun violence prevention", "At least 12 dead, including suspect, in Virginia Beach shooting", "Trump baby blimp 'stabbed with sharp object' by pro-Trump activist in London"]}
{"comp": "C_RC", "month": "Mar", "feats": "bow", "test": 0.5823, "summ1": ["'Gun Sanctuary' movement spreads to NC as county adopts plan to thwart gun control", "Victims of gun violence launch effort pressuring Senate to take up legislation", "Suspected white supremacist charged with murder after New Zealand mosque shootings", "New Zealand bans types of semi-automatic weapons used in mosque mass shooting"], "summ2": ["Poll: Majority of Americans favor stricter gun laws", "One Nation: Al Jazeera documentary exposes party’s attempt to bag millions in political donations", "'One of New Zealand's darkest days': PM Ardern says gun laws will change in wake of mosque attacks", "Federal government targets B.C. guns and gang violence with $5.3 M fund"]}
{"comp": "C_RC", "month": "Mar", "feats": "sbert", "test": 0.5817, "summ1": ["Saginaw Township homicide victim ID’d; man remains in custody after standoff", "Victims of gun violence launch effort pressuring Senate to take up legislation", "New Zealand bans types of semi-automatic weapons used in mosque mass shooting", "The racist origin of gun control laws"], "summ2": ["Rise in gun deaths among US children is ‘sobering,’ study says", "The Times view on New Zealand after Christchurch: it will take more than gun control", "One Nation sought funding from NRA: investigation", "Problems with Pittsburgh’s proposed gun control ordinance"]}
{"comp": "C_RC", "month": "Aug", "feats": "bow", "test": 0.5806, "summ1": ["Senate GOP campaign arm to stop Twitter spending after McConnell account locked", "At Least 4 Philadelphia Police Officers Shot In Philadelphia’s Nicetown-Tioga Section, Officials Say – CBS Philly", "Trump urges 'common sense' gun measures, seeks NRA input", "Bills and Resolutions -- GovTrack.us"], "summ2": ["Walmart, El Paso shooting: Alleged gunman Patrick Crusius identified", "Human rights crisis? Amnesty issues US travel warning & pushes for gun control after mass shootings", "Donald Trump sees tighter gun control tied to immigration reform", "Police chiefs say handgun ban won't stop flow of weapons into Canada"]}
{"comp": "C_LC", "month": "Feb", "feats": "sbert", "test": 0.5797, "summ1": ["Aurora shooter Gary Martin ignored gun card revocation", "DC mayor, faith leaders meet to combat gun violence, hate crimes", "US House Passes Gun Control Bill", "Washington attorney general calls out sheriffs who say they won’t enforce new gun law"], "summ2": ["Among top priorities are expanded background checks, gun violence report", "Intimidation, Pressure and Humiliation: Inside Trump’s Two-Year War on the Investigations Encircling Him", "Parkland: A Year After the School Shooting That Was Supposed to Change Everything", "At least five civilians dead and five officers wounded in shooting in Aurora, Ill., officials say"]}
{"comp": "C_LC", "month": "Feb", "feats": "bow", "test": 0.5758, "summ1": ["Police: Aurora, Illinois shooter had criminal record, should not have had gun", "Trump Threatens To Veto Gun Bills Pushed By Democrats", "Florida's gun debate persists a year after Parkland mass shooting", "Parkland student shares the horror of gun violence with Congress"], "summ2": ["How many more young Americans have to die for gun laws to change?", "House passes gun background check bill after GOP undocumented amendment", "Republicans pressure Trump to back down on border emergency", "Police: Aurora attacker had felony conviction and could no longer legally own a gun"]}
{"comp": "C_RC", "month": "Sep", "feats": "sbert", "test": 0.5721, "summ1": ["6 people, including 3 minors, shot in Downtown Indianapolis", "Text - H.R.4081 - 116th Congress (2019-2020): Sabika Sheikh Firearm Licensing and Registration Act", "O'Rourke: We can't meet gun violence threat with 'half measures' or 'half the country'", "The Latest: 7 people killed in West Texas shooting rampage"], "summ2": ["After El Paso and Odessa shootings, even Texas GOP leaders appear ready to talk about gun control", "How to Stop the Shootings", "New Zealand tightens gun laws again after mosque massacre", "NRA’s 2016 Donation to Trump’s Campaign Pays Off"]}
{"comp": "LC_RC", "month": "Aug", "feats": "bow", "test": 0.5691, "summ1": ["Mitch McConnell ignores calls from Democratic lawmakers to end Senate recess for gun control vote", "'Dying of whiteness': why racism is at the heart of America's gun inaction", "Thousands attend service for El Paso victim Margie Reckard: 'We're all a family'", "El Paso mass shooting suspect arrested after fatal attack at Texas Walmart"], "summ2": ["Philadelphia shooter surrenders after hours-long standoff with police", "Human rights crisis? Amnesty issues US travel warning & pushes for gun control after mass shootings", "Two more shot dead in Toronto as gun violence continues", "Democrat Conor Lamb says new gun laws not needed to prevent violence"]}
{"comp": "R_RC", "month": "Jul", "feats": "bow", "test": 0.5681, "summ1": ["Democratic 2020 Hopefuls Quickly Respond To Gilroy Shooting By Reiterating Gun Control", "BREAKING: Virginia Legislature Adjourns Special Gun Control Session Handing Gov. Northam Humiliating Defeat", "Dozens of people shot in Chicago over July 4 weekend", "A Tiny Fraction Of NZ ‘Assault Rifles’ Turned In So Far"], "summ2": ["Victims and perpetrators of gun violence will work together to transform 50 vacant city lots into gardens", "Virginia is now election battleground in fight over gun laws", "At least 18 shot, three killed, in Gilroy Garlic Festival shooting: police", "Stricter gun laws tied to fewer childhood gun deaths"]}
{"comp": "C_LC", "month": "Apr", "feats": "sbert", "test": 0.5661, "summ1": ["Gun-maker to ask Supreme Court to hear Sandy Hook appeal", "Trump to address NRA conference in late April", "San Diego-area synagogue shooting leaves one worshipper dead, three wounded", "House move roils gun control debate at Minnesota Legislature"], "summ2": ["Lawmakers’ moves to curb gun violence are admirable and overdue", "Columbine school shooting 20 years later: Victims' families reflect on what has changed and what hasn't", "Four hit, one reportedly dead in Australian drive-by shooting", "The U.S. government's counterterrorism center doesn't track white supremacists. Some think it should."]}
{"comp": "ER_R", "month": "May", "feats": "sbert", "test": 0.5649, "summ1": ["STEM Students Walk Out After Dem Vultures Turn Prayer Vigil Into Anti-Gun Campaign Event", "Gun Control Lobbyist Arrested for Assault, Domestic Violence, and False Imprisonment", "Warren Calls for Federal Government Control to Keep Abortion Legal", "Moonbattery Does Suppressing Gun Rights Cure Mass Shootings?"], "summ2": ["LA Legislators Make Strong Stance In Defense Of Second Amendment", "Dems Call for More Gun Control After Colorado Shooting", "Progressive Activist Argues NRA Doesn’t Represent All Gun Owners", "Booker Dodges on Jailing Gun Owners"]}
{"comp": "LC_RC", "month": "Sep", "feats": "sbert", "test": 0.5649, "summ1": ["Gun victim Scalise leads opposition to stricter US laws", "Boston Teens Rally Against Gun Violence", "What we know about the deadly shooting in Midland-Odessa, Texas", "My Family’s Gun Wounds: A Tale in Three Acts"], "summ2": ["Odessa gunman bought rifle privately, failed previous background check due to 'mental health issues'", "The Klan's Favorite Law", "Gun rights advocates protest Ohio gun control proposals in wake of Dayton shooting", "Federal election 2019 roundup: Scheer promises new MRI and CT machines and fields gun control questions"]}
{"comp": "LC_RC", "month": "Sep", "feats": "bow", "test": 0.5607, "summ1": ["Gun victim Scalise leads opposition to stricter US laws", "New Zealand Unveils New Legislation To Tighten Gun Laws", "Death Toll In West Texas Shooting Rampage Now At 7", "Funniest/Most Insightful Comments Of The Week At Techdirt"], "summ2": ["Trump says background checks would not have prevented recent gun violence", "The Second Amendment Helped Feinstein Make It out of San Francisco Alive\u0097But Don\u0092t Tell City Supervisors: News: The Independent Institute", "Man in 20s dies after broad daylight shooting incident", "Federal election 2019 roundup: Scheer promises new MRI and CT machines and fields gun control questions"]}
{"comp": "C_LC", "month": "Sep", "feats": "bow", "test": 0.5598, "summ1": ["Trump says expanded U.S. gun background checks under consideration", "41 shot, 7 fatally, in Chicago Labor Day weekend violence", "O'Rourke responds to 'death threat' from Texas lawmaker", "New Gun Laws Take Effect One Day After West Texas Shootings"], "summ2": ["New Zealand PM Ardern, Trump discuss gun control in first formal meeting", "At Least 5 Dead, 21 Injured In West Texas Shooting", "6 Years Ago, Democrats Failed on Guns. Have They Learned From Their Mistakes?", "NRA sues San Francisco over \"domestic terrorist organization\" label"]}
{"comp": "LC_RC", "month": "Aug", "feats": "sbert", "test": 0.5429, "summ1": ["Trump spoke with the NRA CEO Wayne LaPierre before appearing to rethink gun background checks, reports say", "America's politicians talk gun control and presidential blame following two mass shootings", "'I'm The Shooter,' El Paso Suspect Allegedly Told Police", "Akron mayor decries gun violence, city asks sites to revisit security for crowds"], "summ2": ["MANDEL: The new normal of Toronto gun violence", "The Argument Beneath the Surface of Gun Control", "Dayton mass shooter Connor Betts slaughtered own sister during rampage: officials", "Biden Calls For Federal Gun Buyback Program, Making Assault Weapons \"Illegal, Period\""]}
