{"comp": "ER_LC", "month": "Apr", "feats": "sbert", "test": 0.8782, "summ1": ["Delingpole: ‘Climate Change: The Facts’ Was the BBC’s Biggest Lie Ever", "PRIORITIES? “Chefs Want To Do The Right Thing”…May Add Surcharge To Bill At CA Restaurants To Defeat Climate Change", "AOC Tries To Persuade Congress That People Will Die If We Don't Act On Climate Change", "Inslee: ‘A Lot’ of Immigrants Crossing the Border Are ‘Climate Refugees’"], "summ2": ["Environmentalists hope for action in wake of 'shocking and utterly unsurprising' climate-change report", "Climate-change protesters say they will target London's Heathrow Airport", "Minneapolis mayor: Cities need feds' help on climate change", "How robots turned an Arden Hills box maker Delkor into minimalists"]}
{"comp": "ER_RC", "month": "Aug", "feats": "sbert", "test": 0.8519, "summ1": ["Report: Obamas to Buy Multimillion Dollar Mansion on Martha's Vineyard", "CNN announces 7-hour ‘climate change town hall’ as sop to fanatics (and to drive away other viewers)", "Harry Reid: No Issue 'More Important than Climate Change’", "Twilight of the Eco-Loons: Environmental Activism Jumps the Shark"], "summ2": ["Today's letters: Time for a leaders' debate on climate change", "China would benefit most from billion-dollar, 700-km highway through Canadian Arctic, critics say", "Met Office issues storm warning as UK faces wettest August on record", "Forest Protection Crucial To Fight Climate Change"]}
{"comp": "C_ER", "month": "May", "feats": "sbert", "test": 0.8468, "summ1": ["UK climate panel sets big goals: less meat, drive electric", "Scientists warn of grave impacts from loss of natural world", "Kenya: We Asked Kenyan Students About Climate Change. They Didn't Know Much", "Russia, eyeing Arctic future, launches nuclear icebreaker"], "summ2": ["Newsweek Claims Global Warming Will Cause People to be Eaten by Tigers… No, They Are Serious", "Don't You Know It's the End of the World?", "Canada Moves to Ban Christians From Demonstrating in Public Under New Anti-Hate Proposal", "‘I’LL BE DAMNED’ – Ocasio-Cortez Doubles Down, Attacks Joe Biden’s ‘Climate Change’ Policy"]}
{"comp": "C_ER", "month": "Aug", "feats": "sbert", "test": 0.8424, "summ1": ["Ottawa, B.C. to push electrification of gas industry to cut carbon emissions", "UN in warning over food security and climate change", "Nasa releases disturbing photos of Amazon fires captured from space", "Only 16% of waterways in Ireland are clean - report"], "summ2": ["DNC’s Decision to Nix Climate Change Debate Sparks Youth Activists’ Outrage", "The climate change crisis racket", "NASA Proves Liberal Doomsayers Screaming Over Amazon Fires Are Lying ⋆ The Washington Sentinel", "CONFIRMED: Report Shows the United States Has Not 'Warmed' In Over A Full Decade [Details]"]}
{"comp": "ER_LC", "month": "Jun", "feats": "sbert", "test": 0.8359, "summ1": ["What a Shock… ;-) The mainstream media was WRONG again with its phony climate change predictions", "Jay Inslee: Trump's Stance on Global Warming Is 'Treason'", "JOE’S NEW DEAL: Biden Releases His $5 TRILLION 'Revolutionary' Plan to Fight Climate Change", "Beto O’Rourke Claims Illegal Aliens ‘Have No Choice But To Come Here’ Because We Cause Climate Change"], "summ2": ["Climate change: Ways farmers can help the environment", "Sunday was Denver’s coldest day in five years during June, July or August", "Dawlish sea wall: £30m work to secure railway 'for 100 years'", "EU leaders to spar over zero-carbon pledge for 2050"]}
{"comp": "ER_RC", "month": "Jun", "feats": "bow", "test": 0.8341, "summ1": ["JOE’S NEW DEAL: Biden Releases His $5 TRILLION 'Revolutionary' Plan to Fight Climate Change", "Pope Francis: God Will Destroy ‘Walls’ Between Nations", "Beto: Migrants ‘Have No Choice But To Come Here’ Due To U.S. ‘Excesses’ Causing Climate Change", "President Trump’s 2020 Campaign Concerned About Surging Elizabeth Warren"], "summ2": ["Corbella: Scheer's climate plan would help world's large emitters cut CO2", "Europe heatwave: Continent reels from soaring temperatures", "Federal carbon tax coming to Alberta in January: environment minister", "India's water crisis: Lakes, ponds need urgent attention"]}
{"comp": "ER_LC", "month": "Jul", "feats": "sbert", "test": 0.8274, "summ1": ["Global Warming Alarmist Barbra Streisand Flew Her Dogs 10,000 Miles to Watch Her Sing", "END THE MILITARY? Bernie Says US Should Spend Entire $1.5 Trillion Pentagon Budget to Fight Climate Change", "Good News! Miley Cyrus Promises Not To Procreate Until Climate Change Is Solved ⋆ This woman's brain is a bag of cats. ⋆ Flag And Cross 🇺🇸 ✟", "Ocasio-Cortez Tries To Blame Flooding On Climate Change, Gets Wrecked By REAL Meteorologist"], "summ2": ["Excessive heat warning for D.C. as temperatures soar to ‘dangerously high’ levels Friday through Sunday", "Fusion Energy Startups See Renewables Leaving a Gap in Power Market", "Indonesia has lost land equal to size of Jakarta in last 15 years", "Climate activists disrupt British cities with 'non-violent civil disobedience'"]}
{"comp": "ER_LC", "month": "Aug", "feats": "sbert", "test": 0.8258, "summ1": ["Calling out the climate hypocrites", "Barack And Michelle Obama Just Proved That The Left’s ‘Climate Change’ Agenda Is All A HOAX – The Times Of America", "Katy Perry, More Stars Attend Google Summit On Climate Change In Private Jets, Mega Yachts – The Bearded Patriot", "Harry Reid: ‘No Issue More Important than Climate Change,’ ‘Devastating Our World’"], "summ2": ["In Alaska, a summer of extreme weather continues", "How Seattle is making it possible for everyone to plug in their EV", "Head teachers' polite protest over funding in England", "World warned: change now or endanger food and climate"]}
{"comp": "ER_RC", "month": "Jul", "feats": "sbert", "test": 0.8191, "summ1": ["Americans Vastly Overestimates Gay Population, Gallup Poll Finds", "END THE MILITARY? Bernie Says US Should Spend Entire $1.5 Trillion Pentagon Budget to Fight Climate Change", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’", "Ocasio-Cortez Tries To Blame Flooding On Climate Change, Gets Wrecked By REAL Meteorologist"], "summ2": ["China’s giant transmission grid could be the key to cutting climate emissions", "The Great Barrier Reef: 70% Damage Over Severe Bleaching & Climate Change; Federal Government Released $18 Million", "Climate change: world’s hottest June of all time just recorded", "'Urgent action' needed as we are set to fall short of climate change targets"]}
{"comp": "ER_RC", "month": "Jun", "feats": "sbert", "test": 0.8169, "summ1": ["Jay Inslee: Trump's Stance on Global Warming Is 'Treason'", "National Debt: Who Cares?", "JOE’S NEW DEAL: Biden Releases His $5 TRILLION 'Revolutionary' Plan to Fight Climate Change", "Beto O’Rourke Claims Illegal Aliens ‘Have No Choice But To Come Here’ Because We Cause Climate Change"], "summ2": ["'I totally listened to him': Prince Charles spent 90 minutes trying to convince Trump that climate change is bad", "climate change:This 7-Yr-Old Girl Stood Near Parliament Urging PM Narendra Modi To Pass The Climate Change Law Now", "Alberta cuts nearly $15 million from wildfire management budget", "Indonesian village being inundated with illegal plastic waste from Australia"]}
{"comp": "C_ER", "month": "Jun", "feats": "sbert", "test": 0.8161, "summ1": ["India heatwave deaths rise to 36, poorest workers worst hit", "Eight million salmon have died in Norway over the past week, and algae is the cause", "Emissions need to be halved to avoid 3C warming: scientists", "Blurred lines: Trump’s UN choice and her coal magnate spouse"], "summ2": ["Jay Inslee: Trump's Stance on Global Warming Is 'Treason'", "Scary! Chuck Schumer wants 80% of… WHAT!?", "WATCH: Elizabeth Warren Claims Climate Change Is A ‘Bigger Threat Than World War II’ On Eve Of D-Day Anniversary", "Pew: Fake News Tops Terrorism, Violent Crime, Climate Change as ‘Very Big Problem in Country Today’"]}
{"comp": "C_ER", "month": "Apr", "feats": "sbert", "test": 0.8144, "summ1": ["Drones, supercomputers and sonar deployed against floods", "Philip Morris Scores an A for Climate Change", "Climate protests hit London's bustling financial hub", "Keeping Canada's power on will require 20,000 new workers by 2022"], "summ2": ["Greenpeace Founder Calls It Right: Global Warming is a “Hoax And Scam” – The Millennium Report", "Alexandria Ocasio-Cortez Climate Change “5k Family Fun Run” Conned Kids Out Of $20", "Nebraska Flooding: When the Government Cares More about Birds than People", "Alec Baldwin: Americans Must Make 'Certain Sacrifices' to Save the Planet from Climate Change"]}
{"comp": "C_ER", "month": "Jan", "feats": "sbert", "test": 0.8108, "summ1": ["Bangkok fights floods with thirsty landscaping", "Chris Hoffman: Opposition to climate action is genocidal", "Climate change popular for young scientists at BTYSE", "Oil And Gas See Regulatory Windfall Under Trump"], "summ2": ["Climate Change: The Poetry of Dreams and the Prose of Reality", "Blue State Blues: The Border Wall Fight Is About Democratic Legitimacy", "Articles: Professor Calls for Death Penalty for Climate Change 'Deniers'", "WATCH: Sarah Sanders Responds to AOC's Climate Change Remarks"]}
{"comp": "ER_RC", "month": "Apr", "feats": "sbert", "test": 0.8071, "summ1": ["Greenpeace Founder Calls It Right: Global Warming is a “Hoax And Scam” – The Millennium Report", "Rashida Tlaib Instigates Hunger Strikes to ‘Shut Down ICE’", "Nebraska Flooding: When the Government Cares More about Birds than People", "John Kerry: ‘Ocasio-Cortez Has Offered More Leadership in One Day…Than President Trump Has in His Lifetime on This Subject’"], "summ2": ["Extinction Rebellion London LIVE: Protests over climate change hit fourth day as activists storm capital", "Canada failing in climate change fight: Watchdog", "Why Wooing Gen Z Investors Could Be the Key to Lifting Oil Stocks", "Montreal declares state of emergency, Canadian Forces arrive in Ottawa as flood waters set to rise"]}
{"comp": "ER_LC", "month": "May", "feats": "sbert", "test": 0.8068, "summ1": ["Pelosi’s Brother-In-Law’s Company Received $737,000,000 From Obama’s Energy Department As “Loan Guarantee”", "‘Global Warming’ Not Scary Enough, Alarmists Rebrand ‘Climate Crisis’", "U.N. Committee Launches Attack on U.S Pro-Life Laws", "WE DON’T NEED NO EDUCATION: MSNBC Celebrates Kids Skipping School For The Climate. MSNBC touted a…"], "summ2": ["This technology could save your home from flooding — if you're OK with no basement", "Next government urged to focus on climate", "A Sea Of Sagebrush Disappears, Making Way For Fire-Prone Cheatgrass", "Bam Ireland spend €1.5m converting fleet to electric vehicles"]}
{"comp": "ER_RC", "month": "Mar", "feats": "sbert", "test": 0.7974, "summ1": ["Greenpeace Founder: Climate Change Hoax Being Pushed by Corrupt Scientists ‘Hooked on Government Grants’", "Pennsylvania Muslim lawmaker: Prayer in name of Jesus is “Islamophobic\"", "Independent Audit Exposes Massive Fraud In Global Warming Data", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’"], "summ2": ["Students rally over climate change", "The reality of a recession in Australia", "Big push to ensure survival in the face of climate change", "B.C. seeks judicial approval from Court of Appeal to regulate heavy oil shipments"]}
{"comp": "ER_LC", "month": "Mar", "feats": "sbert", "test": 0.7966, "summ1": ["Poll: Growing Number of Americans Oppose Taxpayer Subsidies for NPR", "Greenpeace Founder: Climate Change Hoax Being Pushed by Corrupt Scientists ‘Hooked on Government Grants’", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’", "Our Planet Is Not Fragile"], "summ2": ["Tackling the climate crisis: Moving Pennsylvania from fossil fuel giant to clean energy powerhouse", "Scientists want to help save the Earth by storing carbon dioxide in the ground", "Schools should have 'no idling zones', Public Health England chief says", "The lowdown on the Montney: Canada's next big energy bet has same high stakes as oilsands"]}
{"comp": "C_ER", "month": "Feb", "feats": "sbert", "test": 0.7874, "summ1": ["Business Debate", "Connecticut, New York lawmakers, environmentalists push to protect Plum Island", "AAA: Cold weather can cut electric car range over 40 percent", "EPA report predicts catastrophic global warming"], "summ2": ["Unhinged Marxist Ocasio-Cortez blasts tech giants, demands absolute censorship of climate skeptics", "Harrison Ford Issues Apocalyptic Climate Change Warning: 'Greatest Moral Crisis of Our Time'", "Harris: ‘Of Course We Can Afford’ Trillion Dollars of Spending in Green New Deal", "Delingpole: All of Recent U.S. Warming Has Been Faked by NOAA"]}
{"comp": "C_ER", "month": "Jul", "feats": "sbert", "test": 0.7866, "summ1": ["Climate change could bring woe to Michigan’s lakes, farms, forests", "How BHP's climate stance caught its fellow miners on the hop", "U.N., European bodies outline joint push against space junk", "Paris hits new heat record, London boils in Europe heat wave"], "summ2": ["Fact-Check: Buttigieg Wrong to Say World Has 12 Years to Address Climate Change", "Global Warming Alarmist Barbra Streisand Flew Her Dogs 10,000 Miles to Watch Her Sing", "Rep. Jamie Raskin: Border Crisis Fueled in Part by ‘Climate Change Refugees’", "Ocasio-Cortez Tries To Blame Flooding On Climate Change, Gets Wrecked By REAL Meteorologist"]}
{"comp": "ER_LC", "month": "Jan", "feats": "sbert", "test": 0.78, "summ1": ["Climate Change: The Poetry of Dreams and the Prose of Reality", "Patrick Buchanan: Memo to Trump: Declare an Emergency", "WATCH: Sarah Sanders Responds to AOC's Climate Change Remarks", "PASSIONATE Climate Change 'Expert' and Professor Beats, Chokes Fiancée"], "summ2": ["Analysis warns of lack of progress on 2020 global emissions target", "Many Small Islands, One Big Problem", "Budweiser’s new Super Bowl ad: Dog, check. Clydesdales, check. Wind turbines–wait, what?", "North Queensland flash flooding traps people, inundates homes"]}
{"comp": "ER_RC", "month": "May", "feats": "sbert", "test": 0.7744, "summ1": ["Pelosi’s Brother-In-Law’s Company Received $737,000,000 From Obama’s Energy Department As “Loan Guarantee”", "‘Global Warming’ Not Scary Enough, Alarmists Rebrand ‘Climate Crisis’", "TOTAL MELTDOWN: AOC Says GOP ‘Doesn’t Care’ About Babies, Want ‘Hell on Earth’ and a ‘Christian Theocracy’", "The Death of Merit and the Race to Mediocrity in Our Increasingly Marxist Universities"], "summ2": ["Next government urged to focus on climate", "Kenney’s stand on oil and gas divestment is likely to leave Alberta out of position", "California utilities get OK to shut off power to cities to prevent wildfires", "Painful misery: Vietnam salt farmers battered by climate change, imports"]}
{"comp": "ER_RC", "month": "Feb", "feats": "sbert", "test": 0.7733, "summ1": ["Unhinged Marxist Ocasio-Cortez blasts tech giants, demands absolute censorship of climate skeptics", "Rep. Ilhan Omar Advocates for National Emergency on Climate Change", "Harris: ‘Of Course We Can Afford’ Trillion Dollars of Spending in Green New Deal", "Delingpole: All of Recent U.S. Warming Has Been Faked by NOAA"], "summ2": ["Parliament: From the backbench", "Human Poop Reveals That Climate Change Caused The Fall Of Cahokia, A Medieval Native American City", "Water security a global issue as 2 billion worldwide lack access to clean water", "10 of the most expensive climate-change driven disasters in 2018"]}
{"comp": "ER_LC", "month": "Feb", "feats": "sbert", "test": 0.7727, "summ1": ["Pocahontas Off the Reservation: Elizabeth Warren Declares Climate Change a National Emergency", "Blog: Proof that the man-made global warming theory is false", "Harris: ‘Of Course We Can Afford’ Trillion Dollars of Spending in Green New Deal", "Dangerous Marxist Ocasio-Cortez blasts tech giants for allowing BOTH sides of the climate change debate to be heard… demands total censorship of climate skeptics"], "summ2": ["Climate change set to disrupt Australia's summer sports calendar", "Stirling University to study climate impact on forests", "Nuclear Power: Still Not Viable without Subsidies (2011)", "Feinstein’s tense exchange with Green New Deal kids: ‘I know what I’m doing’"]}
{"comp": "C_ER", "month": "Mar", "feats": "sbert", "test": 0.7684, "summ1": ["Harnessing the power of nature in the fight against climate change", "Spring Gardening Extravaganza to focus on health, environmen...", "11% rise in companies reporting carbon emissions", "Amid U.S. Midwest flooding, residents in Missouri, Kansas rush to fill sandbags"], "summ2": ["Greenpeace Founder: Climate Change Hoax Being Pushed by Corrupt Scientists ‘Hooked on Government Grants’", "Fertility Falls in EU, Not ONE Country Hits Population Replacement Level", "Walter Williams: Our Planet Is Not Fragile", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’"]}
{"comp": "C_ER", "month": "Sep", "feats": "sbert", "test": 0.7659999999999999, "summ1": ["These are the world’s most tree-covered countries", "Hurricane Dorian: Cat 4 storm creeps over Bahamas with 155 mph winds", "Climate change takes toll on oceans, ice: UN report", "'This isn't welfare': Morrison pledges $100m in drought aid"], "summ2": ["Yang to CNN: Hurricane Coverage Better than Climate Change Chat", "Insane Environmentalists In Sweden Suggest CANNIBALISM To Stop Climate Change", "Climate Activist: Climate Change Activism and Socialism Are ‘Inseparable’", "Ship Carrying ‘Climate Change Warriors’ Concerned About Melting Arctic Ice Gets Stuck in Ice"]}
{"comp": "C_ER", "month": "Aug", "feats": "bow", "test": 0.7632, "summ1": ["Experts call on Scottish Government to follow 12-point environment plan", "The Latest: Trump says he’s willing to meet Iran’s president", "UN climate change report: farming and eating habits must change to save on land and water", "Amazon burning: Brazil reports record forest fires"], "summ2": ["The fiction of man-made global warming", "Jay Inslee Quits 2020 Race — Before His Long-Awaited Climate Change Debate", "Barack And Michelle Obama Just Proved That The Left’s ‘Climate Change’ Agenda Is All A HOAX – The Times Of America", "El Paso Congresswoman Escobar Tells President Trump He Is Not Welcome to Visit"]}
{"comp": "ER_RC", "month": "May", "feats": "bow", "test": 0.7612, "summ1": ["Newsweek Claims Global Warming Will Cause People to be Eaten by Tigers… No, They Are Serious", "Ocasio-Cortez SLAMS Biden: 'I'll Be DAMNED' If We're Going to Accept His Approach to Climate Change!", "WE DON’T NEED NO EDUCATION: MSNBC Celebrates Kids Skipping School For The Climate. MSNBC touted a…", "Nolte: Debunking the Media’s Seven Latest Hysteria Hoaxes"], "summ2": ["Nearly two-thirds of Canadians oppose provincial governments spending taxpayers’ dollars to battle federal carbon tax, poll says", "Alberta Wildfire Week Two: Immediate evacuation issued for La Crete Ferry Campground", "UN report: Indian economy faces climate change perils", "One million youth joining forces to fight climate change"]}
{"comp": "ER_RC", "month": "Jan", "feats": "sbert", "test": 0.7604, "summ1": ["Climate Change: The Poetry of Dreams and the Prose of Reality", "Patrick Buchanan: Memo to Trump: Declare an Emergency", "WATCH: Sarah Sanders Responds to AOC's Climate Change Remarks", "PASSIONATE Climate Change 'Expert' and Professor Beats, Chokes Fiancée"], "summ2": ["New schools should be energy neutral, public school board says", "Climate Change and Cities: What We Need to Do", "Climate change is killing the cedars of Lebanon", "FLANNERY SUPPORTS ANTI-ABBOTT CANDIDATE. AND GETS JOB"]}
{"comp": "L_RC", "month": "Apr", "feats": "sbert", "test": 0.7577, "summ1": ["Climate change must be a thing: it's on prime time TV", "5 Reasons “The Green New Deal” Is Misleading, Dangerous and Part of the Problem: Delusion and Deception in Service of American Empire", "Jay Inslee’s 2020 campaign has a radical focus on climate change.", "Bald eagles are taking trash from a Seattle landfill and dumping it into suburban yards"], "summ2": ["Extinction Rebellion London LIVE: Protests over climate change hit fourth day as activists storm capital", "Canada failing in climate change fight: Watchdog", "Swole just one of over 600 words added to Merriam-Webster dictionary", "B.C. government may consider 'relief' from record gas prices, says premier"]}
{"comp": "C_R", "month": "Sep", "feats": "sbert", "test": 0.7562, "summ1": ["These are the world’s most tree-covered countries", "Dorian pummels Bahamas, hurricane forecast to move dangerously close to Florida", "Climate change takes toll on oceans, ice: UN report", "'This isn't welfare': Morrison pledges $100m in drought aid"], "summ2": ["More Scientists Debunking Climate Change Myths", "Thread offers devastating insight into why the Left’s weaponization of Greta Thunberg is particularly egregious", "Christians Respond to Bernie Sanders’ Disturbing Call for US to Fund Abortions in ‘Poor Countries’ to Control Population", "MARIN: No longer a beautiful day in Trudeau's neighbourhood"]}
{"comp": "ER_RC", "month": "Apr", "feats": "bow", "test": 0.7559999999999999, "summ1": ["Delingpole: ‘Climate Change: The Facts’ Was the BBC’s Biggest Lie Ever", "Alexandria Ocasio-Cortez Climate Change “5k Family Fun Run” Conned Kids Out Of $20", "Beto O’Rourke: We Only Have ’10 Years’ Left on Earth Due to Climate Change", "Alec Baldwin: Americans Must Make 'Certain Sacrifices' to Save the Planet from Climate Change"], "summ2": ["Scheer leaves himself open to claims he’s in cahoots with Big Oil", "Doug Ford links floods to climate change, says situation 'just rips your heart out'", "London climate-change street protest arrests reach 290 on second day", "Ministers considering automatic carbon tax increases if emissions targets not met"]}
{"comp": "ER_RC", "month": "Sep", "feats": "sbert", "test": 0.7545, "summ1": ["SURPRISE! The Official Escort for 16-Year-Old Global Warming 'Expert' Greta Thunberg Is a Leftist Hack Funded by George Soros Org.", "Steve Milloy Contradicts Climate Alarmists on Plastic Straw Bans", "‘LIKE THE DARK AGES’: Doctors Warn of ‘Leprosy Plague’ in Rat-Infested Los Angeles", "REPORT: CNN Produced '57.4 Tons of Carbon Dioxide Emissions' During Climate Change Town Hall"], "summ2": ["Hanes: Winds of change are palpable ahead of Montreal climate march", "Greta Thunberg hits back at the haters: Climate change activist", "QLD bushfires: Binna Burra, Linville, Stanthorpe, Applethorpe", "World must adapt to 'inevitable' climate change, warns report"]}
{"comp": "C_ER", "month": "Jun", "feats": "bow", "test": 0.7506, "summ1": ["Michael Bloomberg to spend $500 million to close coal plants", "World Oceans Day: UK joins fight against plastic pollution with nationwide events", "Who should bear the financial risk of flooding? Report lays out three options", "Britain to become first G7 country with net zero emissions target"], "summ2": ["The mainstream media was WRONG again with its phony climate change predictions", "JOE’S NEW DEAL: Biden Releases His $5 TRILLION 'Revolutionary' Plan to Fight Climate Change", "Beto: Migrants ‘Have No Choice But To Come Here’ Due To U.S. ‘Excesses’ Causing Climate Change", "President Trump’s 2020 Campaign Concerned About Surging Elizabeth Warren"]}
{"comp": "C_ER", "month": "Mar", "feats": "bow", "test": 0.7495, "summ1": ["Climate change threatens Great Basin waterbirds, a 'canary in the mine' for healthy lakes, wetlands", "Trump climate deregulation could boost CO2 emissions by 200 million tonnes a year: study", "Letters: Paul Keating, climate change, franking credits, NSW election", "Hundreds of thousands join world youth climate demo"], "summ2": ["French Yellow Vest leader: “We will continue fighting whatever measures the government takes”", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’", "Delingpole: 'Climate Change' No More Credible than Magic Says Top Physicist", "Targeting climate change, Washington governor joins Democratic race"]}
{"comp": "ER_LC", "month": "Jul", "feats": "bow", "test": 0.7489, "summ1": ["Global Warming Alarmist Barbra Streisand Flew Her Dogs 10,000 Miles to Watch Her Sing", "Alexandria Ocasio-Cortez Chief of Staff Admits: Green New Deal About Socialism, Not Climate", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’", "Rep. Jamie Raskin: Border Crisis Fueled in Part by ‘Climate Change Refugees’"], "summ2": ["WIRED", "Giant Shipper Bets Big On Ending Its Carbon Emissions. Will It Pay Off?", "Power-short Zimbabwe removes barriers to solar energy expansion", "'Unbelievable:' All-time record heat set to bake Alaska"]}
{"comp": "ER_LC", "month": "Jan", "feats": "bow", "test": 0.7469, "summ1": ["Ocasio-Cortez: Claim World Ending in 12 Years Due to Climate Change Was Not a ‘Gaffe’", "'Leaving on a jet plane' to and from Davos", "Climate change “expert” arrested for brutally beating, choking fiance and dragging her by hair across apartment", "Trump Mocking Global Warming Leftists with Record Cold Temperatures"], "summ2": ["On Battening Down the Hatches – Massive Markets – Medium", "Australia bakes in heat that's sparking fires, taxing grid", "Canada's top oilpatch lobbyist says it's 'irresponsible' to plan for oil-free world", "Antarctica's melt quickens, risks metres of sea level rise-study"]}
{"comp": "ER_R", "month": "Apr", "feats": "sbert", "test": 0.7464, "summ1": ["Delingpole: ‘Climate Change: The Facts’ Was the BBC’s Biggest Lie Ever", "PRIORITIES? “Chefs Want To Do The Right Thing”…May Add Surcharge To Bill At CA Restaurants To Defeat Climate Change", "AOC Tries To Persuade Congress That People Will Die If We Don't Act On Climate Change", "Inslee: ‘A Lot’ of Immigrants Crossing the Border Are ‘Climate Refugees’"], "summ2": ["Corbyn’s brother labels climate change a ‘hoax’ and slams London protestors - ‘DERANGED!'", "20 Indian students commit suicide after exam results", "Global warming is shrinking glaciers faster than we thought", "BBC bias: Fran Unsworth joins the climate change debate censorship"]}
{"comp": "ER_LC", "month": "Feb", "feats": "bow", "test": 0.746, "summ1": ["Chris Evans Conspiracy: Trump Could Be ‘Deliberately Misleading’ His Base on Climate Change", "Nancy Pelosi Slights Green New Deal: ‘Green Dream or Whatever’", "Obama Economist Says GOP Tax Bill Will Literally Kill People", "Ocasio-Cortez Tells Democrats That She Is In Charge Now"], "summ2": ["Extreme weather shatters records around the world", "Farmers' industry doesn't make them industrial", "Where did all the water go? – my AlienArt – Medium", "Summers could be entirely powered by clean energy by 2050"]}
{"comp": "ER_LC", "month": "Aug", "feats": "bow", "test": 0.7407, "summ1": ["CNN Has Planned A 7-Hour Climate Change 'Debate' With 2020 Democrat Candidates", "Nolte: Martha’s Vineyard Home Proves Obama Knows Global Warming’s a Hoax", "DNC’s Decision to Nix Climate Change Debate Sparks Youth Activists’ Outrage", "AOC Says She's Awakened at 3:30 AM Scared Because of Climate Change"], "summ2": ["Amazon fires: what is happening and is there anything we can do?", "No Drips, No Drops: A City Of 10 Million Is Running Out Of Water", "Trump aides look into U.S. purchasing Greenland after directives from president", "EXPERT VIEWS-U.N. climate and land report flags need for 'new and healthy balance'"]}
{"comp": "ER_L", "month": "Jul", "feats": "sbert", "test": 0.7388, "summ1": ["Americans Vastly Overestimates Gay Population, Gallup Poll Finds", "END THE MILITARY? Bernie Says US Should Spend Entire $1.5 Trillion Pentagon Budget to Fight Climate Change", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’", "Ocasio-Cortez Tries To Blame Flooding On Climate Change, Gets Wrecked By REAL Meteorologist"], "summ2": ["Dominican Republic tourism deaths might be lower than average.", "The Trump Administration Is Accused Of Burying Climate Change Research", "On ‘Hottest Day In History Of France,’ World Told ‘Do Not Look Away’ As Police Tear-Gas Climate Campaigners In Paris", "NDP links environment with economic justice to head off Green challenge"]}
{"comp": "ER_RC", "month": "Feb", "feats": "bow", "test": 0.7381, "summ1": ["California Governor Gavin Newsom Cancels High-speed Rail: ‘Would Cost Too Much and Take Too Long’", "Chris Evans Conspiracy: Trump Could Be ‘Deliberately Misleading’ His Base on Climate Change", "Soros Revealed as Ocasio-Cortez’s Green New Deal Financier", "Ocasio-Cortez: People Maybe Shouldn’t Reproduce Due To Climate Change"], "summ2": ["In Belgium, Students Are Striking For The Climate - And They've Forced A Minister To Resign", "Canada's forests, once huge help on greenhouse gases, now contribute to climate change", "Plunging Prices Mean Building New Renewable Energy Is Cheaper Than Running Existing Coal", "Great Barrier Reef rodent becomes 1st official ‘climate change extinction’"]}
{"comp": "ER_LC", "month": "Apr", "feats": "bow", "test": 0.737, "summ1": ["Delingpole: ‘Climate Change: The Facts’ Was the BBC’s Biggest Lie Ever", "Ilhan Omar Says US Should ‘Admit More Refugees’ Because of ‘Climate Change’", "DELINGPOLE: Global Warming Study Cancelled Because of 'Unprecedented' Ice", "John Kerry: ‘Ocasio-Cortez Has Offered More Leadership in One Day…Than President Trump Has in His Lifetime on This Subject’"], "summ2": ["Climate change protests snarl London traffic, 120 people arrested", "Orkney 'smart energy' grid project launched", "Major storms could submerge New York City in next decade", "South Korea wildfires: Deadly blaze declared a national emergency"]}
{"comp": "C_ER", "month": "Feb", "feats": "bow", "test": 0.7332, "summ1": ["Storm creates chaos in California with flooding, mudslides", "Colombia gets bids from 27 companies in renewable energy tender: minister", "Climate Change Could Make Silicon Valley Feel Like Glendale", "Big investors urge G7 to step up climate action, shift from coal"], "summ2": ["Climate Change Extremists Use Children to Attack Sen. Feinstein for Not Supporting Green New Deal", "Chris Evans Conspiracy: Trump Could Be ‘Deliberately Misleading’ His Base on Climate Change", "Alexandria Ocasio-Cortez's Green New Deal: 'Economic Transformation'", "UK: Climate Change to Bring Potato Holocaust, Might Have Also Killed Loch Ness Monster"]}
{"comp": "ER_RC", "month": "Aug", "feats": "bow", "test": 0.7331, "summ1": ["HILLARIOUS! DNC Votes Down ‘Climate Debate’ For Candidates…BECAUSE IT WOULD HURT THE POLLS!", "Global Elites Take Their Yachts and Private Jets to Upcoming Climate Summit", "Barack And Michelle Obama Just Proved That The Left’s ‘Climate Change’ Agenda Is All A HOAX – The Times Of America", "AOC Says She’s Woken Up At 3:30 AM Because Of Her Anxiety About Climate Change – The Bearded Patriot"], "summ2": ["July was hottest month on record", "Elections Canada warns environment groups that calling climate change real could be considered partisan", "UN climate report: Change land use to avoid a hungry future", "Amazon fire: Australian PM pledges $30m to fight fires"]}
{"comp": "L_RC", "month": "Jun", "feats": "sbert", "test": 0.7317, "summ1": ["No System of Government Designed by Human Beings Can Survive What the Climate Crisis Will Bring", "Institute for Energy Research", "Trump Official Goes Rogue, Says Climate Change May Cause Next Financial Crisis", "Democratic presidential candidates call for change at California’s Democratic Party Convention"], "summ2": ["Live: Reaction to approval of Trans Mountain pipeline expansion", "Europe wants banks to lend to make our homes greener", "Indian heatwave kills 92 as temperatures soar to 50C", "World Environment Day: How to defeat climate change"]}
{"comp": "ER_RC", "month": "Jan", "feats": "bow", "test": 0.7282, "summ1": ["Record Cold Forces Rethink on Global Warming", "Democrat Socialist Alexandria Ocasio-Cortez gives world 12-year expiration date ‘if we don’t address climate change’ ⋆ Conservative Firing Line", "John Kerry Tells Trump To ‘Resign!’ — Secretary Of State Pompeo Destroys Him", "Let's Play Follow The Climate Money!"], "summ2": ["Closing Colorado Coal Would Save $2.5 Billion. A New Proposal Could Unlock The Coal-To-Clean Shift.", "Australia weather: World’s hottest places all in Australia", "A 'climate emergency' has been declared in Leicester", "Canadian oil reserves at risk from policies to combat global warming, report warns"]}
{"comp": "ER_LC", "month": "Sep", "feats": "sbert", "test": 0.7274, "summ1": ["RADICAL AGENDA: ‘Youth Climate Strike’ Founder is Ilhan Omar’s 16-Year-Old Daughter", "Climate change and 'neurodiversity'", "The Anti-Trump Whistleblower Story Looks Like Another Phony Scandal", "2020 Democrats Urge CNN Viewers to Eat Less Meat to Save Climate"], "summ2": ["Sounds of Summer: Alan Jones and the Farmhand Foundation", "Melbourne's Upper Stony Creek project left in ruin — with residents to suffer", "US climate change rallies aim to send clear message to Trump", "Report: Climate Change Is Hurting Oceans — And Us — More Than…"]}
{"comp": "C_ER", "month": "Jul", "feats": "bow", "test": 0.7241, "summ1": ["Climate change probably added 4C to Europe's June heatwave: study", "Car makers, California agree to emissions rules Trump admin is trying to kill", "As India Revises State Climate Plans, Who Should Have a Voice?", "Fifth of farmland could be used to plant trees to hit carbon target"], "summ2": ["Global Warming Alarmist Barbra Streisand Flew Her Dogs 10,000 Miles to Watch Her Sing", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’", "Alexandria Ocasio-Cortez Chief of Staff Admits: Green New Deal About Socialism, Not Climate", "Poll: Just 8% of Democrats Blame Border Crisis on Huge Flow of Migrants"]}
{"comp": "ER_L", "month": "Jun", "feats": "sbert", "test": 0.7214, "summ1": ["Pew: Fake News Tops Terrorism, Violent Crime, Climate Change as ‘Very Big Problem in Country Today’", "Pope Francis Urges Carbon Tax to Avert Climate ‘Catastrophe’", "Inslee Rips DNC for Threat to Ban Him from Debates", "New World Order Using Climate Change Agenda To Enslave Humanity"], "summ2": ["Wildfires, heat waves foreshadow what could be a perilous summer across the globe", "Oregon Republicans' climate change tantrum still has legislature at an impasse", "It’s Not Silly To Have Hope In Spite Of Climate Change. Here’s Why We Do.", "Pittsburgh Pride was renamed after a fracking company—and the LGBTQ community is fighting back"]}
{"comp": "C_ER", "month": "Apr", "feats": "bow", "test": 0.7212, "summ1": ["This Floating City Can Withstand Category 5 Hurricanes (And Climate Change)", "Oslo's trash incinerator shows promise in climate change test", "Renewable Energy Industry: Current State, Trends, Outlook", "UPDATE 2-Extinction Rebellion to end London blockades on Thursday"], "summ2": ["‘Climate Change: The Facts’ Was The BBC’s Biggest Lie Ever", "Climate Crazy De Blasio: Bans Steel, Glass Skyscrapers ‘They Have No Place On Our Earth’", "John Kerry: ‘Ocasio-Cortez Has Offered More Leadership in One Day…Than President Trump Has in His Lifetime on This Subject’", "Alec Baldwin: Americans Must Make 'Certain Sacrifices' to Save the Planet from Climate Change"]}
{"comp": "L_RC", "month": "May", "feats": "sbert", "test": 0.7198, "summ1": ["Rural politics, climate change and the 2020 elections, Part I", "CO2 Levels Hit 415 Parts Per Million for First Time in Over 3 Million Years", "Fox News Is Desperately Trying to Convince Us Climate Science Isn’t Real", "12 Climate Wins From the National Environmental Policy Act"], "summ2": ["One week after losing Vancouver Island seat to Green Party, NDP leader Singh changes tune, says he opposes fracking", "Difficult for Bengal tigers to survive climate change: Report", "Melbourne climate change rally: Extinction Rebellion hosts protest in CBD", "B.C. is leading the way on money laundering. The rest of the country should follow"]}
{"comp": "L_RC", "month": "Aug", "feats": "sbert", "test": 0.7188, "summ1": ["The Terrifying Economic Risks That I Hope Are Keeping You Up at Night", "Agriculture’s role in climate change draws scrutiny from 2020 Democrats", "Bernie Sanders has a colossal climate plan", "Bret Stephens Freaks Out After Being Called A 'Bedbug' On Twitter"], "summ2": ["Interest in climate change shows Singaporeans' long-term thinking: DPM Heng Swee Keat", "In Brazil, smoke from Amazon forest fires engulfs Sao Paulo, baffling and alarming thousands", "Britain to be 'tourist capital of the world' due to climate change", "Canadian food supplies at risk if climate change not slowed, new UN report shows"]}
{"comp": "ER_RC", "month": "Jul", "feats": "bow", "test": 0.7161, "summ1": ["Leftists claim L.A. Earthquakes caused by climate change – Pacific Pundit", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’", "Democrats Declare War On AOC Now Calling Her Goomba", "Jay Inslee to Rapper Lil Nas X: 'Let's Collab' on Climate Change"], "summ2": ["Younger voters mobilizing to make federal election about climate change", "Weather news: Parts of Europe swelter as heat records drop", "Singapore will spend $400m upgrading drains, $10m on studying sea level rise to counter climate change", "David Attenborough says air travel should be more expensive to fight climate change"]}
{"comp": "C_ER", "month": "Jan", "feats": "bow", "test": 0.7148, "summ1": ["CES 2019: How connected leafy canopies could fight climate change in our cities", "Africa: Ways Climate Change Is Already Affecting Africa", "Government, UN, NGOs meet to discuss Climate Change", "Coal will remain part of the US grid until 2050, federal energy projections say"], "summ2": ["Ocasio-Cortez: Claim World Ending in 12 Years Due to Climate Change Was Not a ‘Gaffe’", "Climate change “expert” arrested for brutally beating, choking fiance and dragging her by hair across apartment", "Trump Mocking Global Warming Leftists with Record Cold Temperatures", "Tens of thousands protest in France, Belgium over climate crisis"]}
{"comp": "C_ER", "month": "May", "feats": "bow", "test": 0.7136, "summ1": ["Scientists warn a million species at risk of extinction", "Glasgow aims to become UK's first net-zero emissions city", "More MENA wars over water, energy and food", "UN kicks off major climate change effort"], "summ2": ["Bernie Tells College Students Climate Change Will Cause War", "George Clooney Parody PSA Rips Trump and ‘Dumb F*cking Idiots’ for ‘Saying Dumb Sh*t’ About Climate Change", "Climate change scare stories reach the point of psychological TERRORISM… while scientists blame the fear on the “climate crisis”", "Ocasio-Cortez SLAMS Biden: 'I'll Be DAMNED' If We're Going to Accept His Approach to Climate Change!"]}
{"comp": "C_ER", "month": "Sep", "feats": "bow", "test": 0.7109, "summ1": ["China’s mega city will run entirely on renewable energy", "After decimating parts of the Bahamas, Hurricane Dorian is heading for Florida", "Big companies commit to slash emissions ahead of U.N. climate summit", "UN Report Warns Much of Humanity Threatened by Global Warming"], "summ2": ["President Trump Trolls Greta Thunberg, Climate Change Children’s Crusade, Young Actresses at Climate Week", "Bernie Sanders Wants Population Control to Fight Climate Change", "Fox & Friends: Jerome Hudson Exposes Left's Lies on Immigration, Climate Change", "Moonbattery Climate Town Hall Reveals Democrats as Tyrannical and Insane"]}
{"comp": "C_R", "month": "Mar", "feats": "sbert", "test": 0.7108, "summ1": ["Trump climate deregulation could boost CO2 emissions by 200 mln tonnes a year -study", "Water scarcity is one of the greatest challenges of our time", "Nigeria: AfDB Earmarks $25bn On Climate Change Initiative", "Photos: Thousands of students hit the streets for climate change demonstrations"], "summ2": ["‘Nuke the weather!’ Alexandria Ocasio-Cortez calls for war against hurricanes (and people have some ideas)", "Climate Change Cheaper Than Half Baked Ideas to Fix It", "Pelosi Says She Personally Supports Lowering The Voting Age To 16", "Greenpeace Founder: Climate Change Hoax Being Pushed by Corrupt Scientists ‘Hooked on Government Grants’"]}
{"comp": "C_L", "month": "Jul", "feats": "sbert", "test": 0.7091, "summ1": ["Climate change could bring woe to Michigan’s lakes, farms, forests", "How BHP's climate stance caught its fellow miners on the hop", "U.N., European bodies outline joint push against space junk", "Paris hits new heat record, London boils in Europe heat wave"], "summ2": ["The Trump Administration Is Accused Of Burying Climate Change Research", "Bad moderation and a flood of conservative talking points made Tuesday’s Dem debate almost unwatchable", "A climate change victim in Iceland is set to be memorialized", "Hungry Elephants Fight Climate Change One Mouthful at a Time"]}
{"comp": "ER_L", "month": "Aug", "feats": "bow", "test": 0.708, "summ1": ["Climate Change Alarmist Suffer Another Blow — Data Proves U.S. Hasn’t Warmed Since 2005", "Ocasio-Cortez: I Want to Have 'One Less Child' Due to Climate Change", "Barack And Michelle Obama Just Proved That The Left’s ‘Climate Change’ Agenda Is All A HOAX – The Times Of America", "Bernie Sanders Signals He’s Open to a ‘Meat Tax’ to Combat Climate Change"], "summ2": ["Here are 11 things the Koch brothers didn’t want you to know", "The Climate Crisis Is 'a Perfect Storm' Headed for the World's Food Supply", "New Report: Climate Change Harms Pennsylvanians’ Health", "Donald Trump skips G7 meetings on Amazon fires and climate change"]}
{"comp": "R_RC", "month": "Feb", "feats": "sbert", "test": 0.7077, "summ1": ["The BBC froze me out because I don't believe in global warming: Outspoken as ever, David Bellamy reveals why you don't see him on TV any more", "FAIL: Chuck Schumer accuses Mitch McConnell of trying to distract from climate change (by bringing Green New Deal to a vote?)", "Alexandria Goes Too Far – Tells Americans Not To Have Children Due To Climate Change… – CITIZEN FREE PRESS", "AOC declined spot on new climate change committee"], "summ2": ["Climate Triage: Swift Action Is Required To Save Humanity from Dangerous Global Warming", "Queensland floods: Record disaster stuns world after crocodile, snake infestation", "Harrison Ford to attend Dubai World Government Summit", "Letters to the Editor, Feb. 26, 2019: Scheer, Moe must alter course on energy"]}
{"comp": "ER_RC", "month": "Mar", "feats": "bow", "test": 0.7059, "summ1": ["Sorry Kamala, 97% of Scientists DO NOT Agree on Climate Change", "Ten Years after Climategate, the Global Warming Fraud Is on Life Support", "SCARED BY ENVIRONMENTALISTS: Women’s Group Says They Won’t Have Children Because Of Climate Change", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’"], "summ2": ["Floods show national security threat posed by climate change", "Judge blocks Trump's drilling plans across the U.S. because they ignored climate change impact", "School climate strike: UK students inspired by Greta Thunberg on climate change, air pollution and why they’re striking on March 15", "Climate report: Drastic changes are looming for farming"]}
{"comp": "ER_L", "month": "Sep", "feats": "sbert", "test": 0.7051, "summ1": ["Ex-Climate Change Believer Gives Theory on Global Warming in Amazing Twitter Thread ⋆ The Washington Sentinel", "Dinesh D’Souza Attacked For Calling Swedish Climate Teen A Propaganda Tool", "Bernie Sanders Says U.S. Taxpayers Should Fund Abortions In 'Poor Countries' To Fight Global Warming", "Moonbattery Climate Town Hall Reveals Democrats as Tyrannical and Insane"], "summ2": ["Elizabeth Warren Nails Why We're Having Arguments About Straws And Lightbulbs", "Climate change, poverty and human rights: an emergency without precedent", "3 Native American Tribes Leading the Way on Clean Energy", "Fifth Death Linked To Storm That Walloped Houston Area"]}
{"comp": "C_L", "month": "May", "feats": "sbert", "test": 0.7031, "summ1": ["UK climate panel sets big goals: less meat, drive electric", "Scientists warn of grave impacts from loss of natural world", "Kenya: We Asked Kenyan Students About Climate Change. They Didn't Know Much", "Russia, eyeing Arctic future, launches nuclear icebreaker"], "summ2": ["Rural politics, climate change and the 2020 elections, Part I", "To My Friend the Climate Defeatist: Here's Why I'm Still In the Fight", "Fox News Is Desperately Trying to Convince Us Climate Science Isn’t Real", "House GOP Unveils Bill To Block Obama’s Climate Change Rules"]}
{"comp": "R_RC", "month": "Feb", "feats": "bow", "test": 0.7020000000000001, "summ1": ["The BBC froze me out because I don't believe in global warming: Outspoken as ever, David Bellamy reveals why you don't see him on TV any more", "REPORT: Rand Paul Says 10 GOP Senators Will Vote Against Trump’s National Emergency Declaration", "AOC declined spot on new climate change committee", "Alexandria Goes Too Far – Tells Americans Not To Have Children Due To Climate Change… – CITIZEN FREE PRESS"], "summ2": ["Saskatchewan court to hear arguments over carbon tax", "Climate change: Oceans could turn green by 2100, scientists warn", "Trump administration approves 2 coal mining projects in Utah", "More and more people 'want to get their power from wind farm'"]}
{"comp": "ER_RC", "month": "Sep", "feats": "bow", "test": 0.7018, "summ1": ["Climate Activists Shut Down 22 DC Intersections and Chain Themselves to a Boat in Support of a Green New Deal", "President Trump Trolls Greta Thunberg, Climate Change Children’s Crusade, Young Actresses at Climate Week", "Bernie Sanders Wants Population Control to Fight Climate Change", "Moonbattery Climate Town Hall Reveals Democrats as Tyrannical and Insane"], "summ2": ["'Time to practice and not to preach,' PM Modi at UN Climate Summit", "Greta Thunberg: \"You have stolen my dreams and my childhood\"", "Climate change protest: Thousands expected at Global Strike 4 Climate", "Andaman, Nicobar Islands may not be inhabitable in future due to rise in sea level: IPCC"]}
{"comp": "L_RC", "month": "Apr", "feats": "bow", "test": 0.7014, "summ1": ["President Trump Says Windmill Sound Causes Cancer, Fears Speech Shown Live on C-SPAN Will Be Leaked", "‘Meet the Press’ Won't Give Air Time to Climate Change Deniers", "'Call It a Crisis': New Report Details Failure of Cable and Network Outlets to Accurately Describe Climate Emergency", "Alexandria Ocasio-Cortez town hall resets the Green New Deal debate"], "summ2": ["Doug Ford links floods to climate change, says situation 'just rips your heart out'", "London climate-change street protest arrests reach 290 on second day", "Conservative Leader Andrew Scheer promises detailed climate plan by end of June", "Ministers considering automatic carbon tax increases if emissions targets not met"]}
{"comp": "R_RC", "month": "Sep", "feats": "sbert", "test": 0.7007, "summ1": ["More Scientists Debunking Climate Change Myths", "Trump Seems To Troll 16-Year-Old Climate Activist Greta Thunberg: ‘So Nice To See!’", "America Tunes Out the Demented Dems", "Population Control: Bernie Pushes Abortion to ‘Stop Climate Change’"], "summ2": ["Killer slime that can ‘kill you in seconds’ taking over France’s beaches", "UNGA: PM Modi highlights India's steps to combat climate change", "In Regina, youths making climate change an election issue", "World must adapt to 'inevitable' climate change, warns report"]}
{"comp": "ER_L", "month": "Aug", "feats": "sbert", "test": 0.7005, "summ1": ["Sen. Bernie Sanders Envisions a Federal Takeover of U.S. Renewable Energy Production", "Climate Change: Greatest Scientific Scandal of a Generation", "AOC Says She Can't Sleep Because of Climate Change Worries", "Dems Pull a 'Reagan' in Their Debates"], "summ2": ["Bernie Sanders says he'd use tariffs, but not in an 'irrational way' like Trump", "Seven Young Activists to Watch Ahead of the 2020 Elections", "EPA's Free Pass for Oil and Gas: Another Climate Surrender", "Victory for Imperiled Species at World Wildlife Conference"]}
{"comp": "L_RC", "month": "Jan", "feats": "sbert", "test": 0.6990000000000001, "summ1": ["Climate Action in NY: 2019 Could Be Even Bigger than 2018", "\"It’s infuriating”: Trump-supporting parents turn on the president over lax EPA rules", "Democrats Sabotage Their Own Efforts To Fight Climate Change", "To get to a circular economy we have to change not just the cup, but the culture"], "summ2": ["At 23 below, Wednesday marked Chicago's 4th coldest temperature recorded (here are the lowest 10)", "Plastic recycling attracts investment in Japan after China ban", "Terrifying climate change warning: 12 years until we’re doomed", "Varcoe: Poking holes in Victoria's climate fight 'hypocrisy'"]}
{"comp": "LC_R", "month": "Sep", "feats": "sbert", "test": 0.6967, "summ1": ["The week Australia failed on climate change", "Queensland bushfires see 87 blazes raging with the O'Reilly area urged to leave immediately", "Solar Panel–Level Energy Storage Developer Yotta Receives $1.5 Million", "Report: Climate Change Is Hurting Oceans — And Us — More Than…"], "summ2": ["AOC’s Colorado Trip Reveals Hypocrisy and Ignorance of Climate-change Crowd", "The Ratings for CNN’s “Climate Crisis” Town Hall Are In", "More Scientists Debunking Climate Change Myths", "No, Don't Listen to Greta Thunberg"]}
{"comp": "C_L", "month": "Feb", "feats": "sbert", "test": 0.6963, "summ1": ["Business Debate", "Connecticut, New York lawmakers, environmentalists push to protect Plum Island", "EPA report predicts catastrophic global warming", "Trump urges U.S.-owned TVA to keep coal plant open"], "summ2": ["Alexandria Ocasio-Cortez Wants the Country to Think Big", "'Complete Wiping Away of Clean Water Act': Trump EPA Rule Would Free Corporations to Pollute Nation's Water as Much as They Please", "How Greed, Fear and Our Own Biases Blind Us to the Realities of Climate Change", "How the mega-rich are preparing for the apocalyse"]}
{"comp": "L_RC", "month": "Jul", "feats": "sbert", "test": 0.6956, "summ1": ["Why Donald Trump is thrilled about this fight with the 'Squad'", "Climate Change Looms Large for Teen Activists at Miami's Youth Climate Summit", "The First of Three Climate Change Perils No One Is Talking About", "Barry Weakens to Tropical Storm, Likely to Spare New Orleans From Massive Flooding"], "summ2": ["No scientific evidence GM crops unsafe: Govt", "Floods or Droughts: How nature can cure India's impending water crisis", "Investment slow to adapt to climate change, hiking risks", "Globe editorial: Andrew Scheer just gutted his own climate-change plan"]}
{"comp": "C_L", "month": "Jun", "feats": "sbert", "test": 0.6951, "summ1": ["WFP: Growing Violence Destroys Vital Crops, Farmland in NW Syria", "Emissions need to be halved to avoid 3C warming: scientists", "India's Adani wins green light for long delayed Australian coal mine", "Report: Florida will have to spend $76 billion to prepare for sea level rise"], "summ2": ["No System of Government Designed by Human Beings Can Survive What the Climate Crisis Will Bring", "Charlie Kirk calls comparisons between World War II and climate change \"despicable\"", "Trump Official Goes Rogue, Says Climate Change May Cause Next Financial Crisis", "Democratic presidential candidates call for change at California’s Democratic Party Convention"]}
{"comp": "C_R", "month": "Apr", "feats": "sbert", "test": 0.6946, "summ1": ["After Cyclone Idai, thousands still cut off, many more in need: aid agencies", "One of the Largest Native American Tribes Has Just Voted to End Their 100-Year Dependency on Coal", "Primary cause of global warming is force of gravity", "Can capitalism beat climate change?"], "summ2": ["John Kerry Claims Ocasio-Cortez ‘Has Done More in One Day’ Than President Trump Has in ‘His Lifetime’ For Climate Change", "HEATWAVE WARNING: Experts issue GREY FEVER ALERT as pollen count set to SOAR", "Climate Change & Progressives’ Environment Hypocrisy -- Conservatives Should Step In", "Diane Abbott heaps praise on 16-year-old 'comrade' Greta Thunberg"]}
{"comp": "ER_L", "month": "Apr", "feats": "bow", "test": 0.6944, "summ1": ["John Kerry Claims Ocasio-Cortez Has Done More in “One Day” Than President Trump Has in “His Lifetime” For Climate Change", "Climate Crazy De Blasio: Bans Steel, Glass Skyscrapers ‘They Have No Place On Our Earth’", "Emma Thompson Flies 5,400 Miles in Private Jet to Protest Climate Change", "Alec Baldwin: Americans Must Make 'Certain Sacrifices' to Save the Planet from Climate Change"], "summ2": ["Groups Warn Against Trump Effort to Unleash 'Fracking Frenzy' by Unlocking Million+ Acres of Public Land for Drilling", "16-Year-Old Greta Thunberg Wants Us to Save the World Like Notre Dame", "Republicans Are Trying To BAN New Wind Power Projects", "Earth Day founder to young people, Ocasio-Cortez: ‘Don’t let anyone tell you what’s impossible’"]}
{"comp": "R_RC", "month": "Jul", "feats": "sbert", "test": 0.6943, "summ1": ["Environment apocalypse: Shocking photos show how UK will look after climate change", "Climate hawk Republicans are wrong to look to carbon tax as Green New Deal alternative", "Bristol man unable to see his father before he died because Extinction Rebellion protest traffic", "Super PAC Bashes Democrats for Failing to Make Climate Change a Top Priority"], "summ2": ["MOSAiC Expedition: 600 Scientists Gear Up To Spend Next Year Trapped In Ice To Study Climate Change Effects On The Arctic Sea", "'Urgent action' needed as we are set to fall short of climate change targets", "Trudeau concedes he’s made mistakes, but warns teachers’ group that it’s him or Scheer", "Flash flooding in DC turns roads into rivers"]}
{"comp": "ER_LC", "month": "Jun", "feats": "bow", "test": 0.6942, "summ1": ["What a Shock… ;-) The mainstream media was WRONG again with its phony climate change predictions", "Biden Unveils New Climate Change Plan, Will Cost American Taxpayers $5 TRILLION (Details)", "Poll: Climate Change, Guns, Abortion Biggest Topics for Democratic Debates", "BETO: Migrants Had 'NO CHOICE' But to Come to U.S. Due to Climate Change!"], "summ2": ["New Bipartisan Agreement on Climate Change Only Goes So Far", "Forget the 'Polar Vortex.' Here comes the 'Death Ridge' and record heat for the Southeast", "This Indian City Is Running Out of Water, Impacting 4.6 Million People", "Coal comeback? Trump plan breathes new life into aging power plants, but critics say climate will suffer"]}
{"comp": "C_L", "month": "Apr", "feats": "sbert", "test": 0.6940000000000001, "summ1": ["'A logistical problem': Over 800 people arrested in Extinction Rebellion protests in London", "Study: Most carbon dioxide in atmosphere in 3 million years", "Can capitalism beat climate change?", "South Korea steps up shift to cleaner energy, sets long-term renewable power targets"], "summ2": ["Climate change must be a thing: it's on prime time TV", "Obama Had a Green New Deal, and It Worked. Let’s Do That Again.", "Bald eagles are taking trash from a Seattle landfill and dumping it into suburban yards", "WATCH: Rep. Thomas Massie Asks: 'So How Do You Get a Bachelor of Arts in a Science [Degree]?' WATCH: Rep. Thomas Massie Asks: 'So How Do You Get a Bachelor of Arts in a Science [Degree]?'"]}
{"comp": "C_R", "month": "Sep", "feats": "bow", "test": 0.6937, "summ1": ["The United Nations wants to grow urban forests in 30 countries", "Hurricane Dorian pounds Bahamas, menaces U.S. southeast coast", "Teen climate activist to urge climate action on Capitol Hill", "Investing in climate adaptation can spur trillions in benefits: report"], "summ2": ["Bernie Sanders Makes One of the Most 'Horrifying' Arguments During CNN Climate Town Hall", "Those Idiot Protesters Caused DC's Metro System To Be A Giant Pain For Working Class Americans", "No, Don't Listen to Greta Thunberg", "NY Times Revels in a Murdoch Who'll Fight Fox News, Which 'Blocks Progress' on Climate"]}
{"comp": "ER_L", "month": "Apr", "feats": "sbert", "test": 0.6914, "summ1": ["Greenpeace Founder Calls It Right: Global Warming is a “Hoax And Scam” – The Millennium Report", "Democrats: $130 Million for Health Care for Illegal Alien Kids", "AOC Tries To Persuade Congress That People Will Die If We Don't Act On Climate Change", "Vatican Proposes EU as Example of ‘a Supranational State’"], "summ2": ["Podemos’s Green New Deal", "National Public Health Week 2019: Climate Changes Health", "The only way to halt climate change is to challenge the logic of capitalism", "Farmers held on to a mountain of grain because of Trump's trade war—now it's underwater"]}
{"comp": "L_RC", "month": "Feb", "feats": "sbert", "test": 0.6897, "summ1": ["Alexandria Ocasio-Cortez Wants the Country to Think Big", "'Complete Wiping Away of Clean Water Act': Trump EPA Rule Would Free Corporations to Pollute Nation's Water as Much as They Please", "How Greed, Fear and Our Own Biases Blind Us to the Realities of Climate Change", "How the mega-rich are preparing for the apocalyse"], "summ2": ["‘Population before climate’: new Victorian MP Clifford Hayes hits out at Greens", "Climate Triage: Swift Action Is Required To Save Humanity from Dangerous Global Warming", "Queensland floods: Swollen Flinders River now 60km wide", "Why Oilmen Will Never Be Interested In Renewables"]}
{"comp": "ER_L", "month": "Mar", "feats": "bow", "test": 0.6863, "summ1": ["SCARED BY ENVIRONMENTALISTS: Women’s Group Says They Won’t Have Children Because Of Climate Change", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’", "Gloria Steinem: Forced Childbirth ‘the Fundamental Cause of Climate Change’", "Targeting climate change, Washington governor joins Democratic race"], "summ2": ["As Hundreds of Thousands of Students Prepare for Global #ClimateStrike on March 15, Here's How to Get Involved", "A Climate Sociologist Explains the Green New Deal (Pt 1/2)", "Are the Fossil Fuel Industry’s Days Numbered?", "Flooding of Nebraska Air Force Base illustrates security risk posed by climate change"]}
{"comp": "C_R", "month": "Feb", "feats": "bow", "test": 0.6858, "summ1": ["Storm creates chaos in California with flooding, mudslides", "Colombia gets bids from 27 companies in renewable energy tender: minister", "Climate Change Could Make Silicon Valley Feel Like Glendale", "Big investors urge G7 to step up climate action, shift from coal"], "summ2": ["Ocasio-Cortez says maybe people should stop having kids because of climate change", "State of the Union: Trump’s silence on Palestine means he’ll never end wars", "Even Democrats and the Green Party are trashing the Green New Deal", "Scientist who popularized term 'global warming' dies at 87"]}
{"comp": "ER_R", "month": "Aug", "feats": "sbert", "test": 0.6849, "summ1": ["AOC Says She's Awakened at 3:30 AM Scared Because of Climate Change", "Barack And Michelle Obama Just Proved That The Left’s ‘Climate Change’ Agenda Is All A HOAX – The Times Of America", "Twilight of the Eco-Loons: Environmental Activism Jumps the Shark", "Harry Reid: ‘No Issue More Important than Climate Change,’ ‘Devastating Our World’"], "summ2": ["UN panel recommends eating less meat and more vegetables to counter climate change", "Backlash at Prince Harry and 'hypocrite' celebrities at Google Camp", "Political analyst RICHARD NORTH on the power cut that sent Britain in meltdown", "KINSELLA: Prime ministers can't pick and choose which Canadians they represent"]}
{"comp": "R_RC", "month": "Mar", "feats": "sbert", "test": 0.6848, "summ1": ["Global Warming Has Been Canceled: Key Greenland Glacier Has Expanded. Ocasio-Cortez Hardest Hit", "Left-wing shame: Anger as 'parents sent political ideology printed on school paper'", "Pelosi Says She Personally Supports Lowering The Voting Age To 16", "Anti-climate Science Totalitarians"], "summ2": ["Carbon pricing is most efficient way to cut emissions, Canadian Chamber says", "I am terrified of ‘children’s crusader’ Greta Thunberg – and you should be too", "US News: Entire communities cut off amid Midwest floods", "Parliament: Big push to grow Singapore's food and water resources to ensure survival in the face of climate change"]}
{"comp": "C_R", "month": "Jul", "feats": "sbert", "test": 0.6844, "summ1": ["How big data can help us fight climate change faster", "Massive heat wave bakes central, eastern U.S., with sweaty night ahead", "McConnell urges Nike to release 'Betsy Ross' shoes: 'I'll make the first order'", "Dams are not the smart way to secure water for agriculture"], "summ2": ["'The Five' hosts discuss Sanders, Ocasio-Cortez teaming up on climate change, partnership's potential outcomes", "Abortion Activist Miley Cyrus Refuses to Have Kids Because of \"Climate Change\"", "UK weather: Britain braces for its hottest day on record today", "More Insanity from the Climate Group without Supporting Evidence"]}
{"comp": "L_LC", "month": "May", "feats": "sbert", "test": 0.684, "summ1": ["Biden’s Climate Policy Sounds a Lot Like Obama’s", "This Earth-Shaking Plan Would Enlist A/C Units in the Fight Against Climate Change", "Fox News Is Desperately Trying to Convince Us Climate Science Isn’t Real", "Action on Gun Violence in Kamala Harris’ First 100 Days"], "summ2": ["Climate change being fuelled by soil damage", "Torrential rain in Houston leaves roads flooded and schools closed", "No longer prized Liberal territory, Julia Banks and Labor eye Flinders", "UK Declares “Climate Emergency” As Committee On Climate Change Urges Net-Zero"]}
{"comp": "C_R", "month": "Feb", "feats": "sbert", "test": 0.6837, "summ1": ["Climate change resilience could save trillions in the long run – but finding billions now to pay for it is the hard part", "Colombia gets bids from 27 companies in renewable energy tender: minister", "Ice Tsunami Forces Residents To Evacuate Along Lake Erie – CBS Pittsburgh", "Jim Salinger Q&A: Why we must hasten action on climate change"], "summ2": ["House climate-change hearing adjourns after not enough Democrats show up", "White House climate panel to be led by official who said CO2 complaints were like 'demonization of the poor Jews under Hitler'", "Woman, 28, has huge uncontrollable tumours on her legs and hips", "Chuck Schumer Calls Vote On Green New Deal A ‘Sham’"]}
{"comp": "C_R", "month": "Jan", "feats": "bow", "test": 0.6829999999999999, "summ1": ["Oceans warming faster than expected, set heat record in 2018: scientists", "How climate change could impact your health", "OECD urges Australia to step up carbon emissions cuts", "Analyzing Trump's \"Affordable Clean Energy\" rule using the EPA's own data – Third Way"], "summ2": ["Bernie Sanders used private jet for Vatican conference visit", "Alexandria Ocasio- Cortez Says Climate Change Will End Earth in 12 Years", "Trump mocks Global Warming as Midwest experiences dangerously low temperatures", "NOT CLIMATE CHANGE! Pacific Gas and Electric's to Blame for Cali Fires"]}
{"comp": "ER_LC", "month": "Mar", "feats": "bow", "test": 0.6829999999999999, "summ1": ["Ten Years after Climategate, the Global Warming Fraud Is on Life Support", "It's Official: Sean Hannity Tells President Trump Jeanine Pirro Returning to Her Fox Show Saturday", "SCARED BY ENVIRONMENTALISTS: Women’s Group Says They Won’t Have Children Because Of Climate Change", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’"], "summ2": ["Midwest floods foreshadow national security threat posed by climate change", "KiwiRail graduate joins the fight against climate change", "Storm-slammed Mozambique must rebuild for 'tomorrow's climate'", "WATCH: Washington Gov. Jay Inslee launches 2020 presidential bid"]}
{"comp": "C_R", "month": "Jun", "feats": "sbert", "test": 0.6829, "summ1": ["Emissions need to be halved to avoid 3C warming: scientists", "Report: Florida will have to spend $76 billion to prepare for sea level rise", "Coal Industry's Survival in Question as Companies Go Green", "US-Mexico deal offers few new solutions, political victory"], "summ2": ["‘Never fails to amaze’: Vox’s warning about ‘foods we could lose if climate change continues’ is enough to make you want to torch a pile of tires", "During Late-Term Abortion, Woman Delivered Living 20-Week-Baby in the Toilet. He Was Left to Drown", "How Prince Charles 'EXERTED influence' over Donald Trump – 'Convincing him to change mind’", "Scotland fury: Nicola Sturgeon lashes out at Johnson, Hunt and Brexit in vitriolic speech"]}
{"comp": "R_RC", "month": "Apr", "feats": "sbert", "test": 0.6827, "summ1": ["Corbyn’s brother labels climate change a ‘hoax’ and slams London protestors - ‘DERANGED!'", "Global warming is shrinking glaciers faster than we thought", "The American Spectator", "BBC bias: Fran Unsworth joins the climate change debate censorship"], "summ2": ["Safeguarding oceans from climate change a global responsibility", "Canada failing in climate change fight: Watchdog", "Easter weekend traffic chaos feared as climate change protesters target Dublin", "Perth news New housing estate putting renewable energy to the test"]}
{"comp": "C_L", "month": "Feb", "feats": "bow", "test": 0.6826, "summ1": ["Climate plan 'not pie in the sky' before election, says Spain", "Hard numbers help visualize climate change. And it’s not pretty.", "Recent rain total in O.C.? $13 million. Supervisors declare emergency", "NZ world leader in agricultural climate change research"], "summ2": ["Youth Climate Strike Coming to U.S. Next Month", "Fox hosts praise Stacey Abrams’ SOTU response: “She seemed to get more to what people's lives are like in the reality\"", "Trump's Pick of Wealthy Climate Denier for UN Ambassador Decried as 'Slap in the Face' to Planet and Humanity", "FOCUS: It's Climate Change That's Scary, Not the Green New Deal"]}
{"comp": "LC_R", "month": "Jul", "feats": "sbert", "test": 0.6822, "summ1": ["Eskilstuna: how a Swedish town became the world capital of recycling", "World will not meet 2C warming target, climate change experts agree", "Heat Wave NYC: Live Updates as Dangerous Temperatures Arrive", "China Pursues More Renewable Energy At Home & Abroad"], "summ2": ["Environment apocalypse: Shocking photos show how UK will look after climate change", "AOC’s chief of staff: We don’t think of the Green New Deal as a climate thing but as a “change the entire economy” thing", "Barbra Streisand flew her dogs 10,000 miles to watch her perform in London", "Climate Change Democracy Deniers Strike Again"]}
{"comp": "R_RC", "month": "Jan", "feats": "sbert", "test": 0.6822, "summ1": ["Lindsey Graham ZINGS Ocasio-Cortez over her ridiculous climate change comments…", "Cuomo urges New Yorkers to stay indoors due to extreme cold weather", "Ocasio-Cortez’s ‘Green New Deal’ Would Avert A ‘Barely Detectable’ Amount Of Global Warming. That’s According To EPA’s Climate Model", "The Scientific Experts Who Hate Science"], "summ2": ["Indisputable Facts On Climate Change", "SA sizzles through summer heatwave", "Can We Drill A Hole Deep Enough For Our Nuclear Waste?", "Four dividend-paying timber companies that could help in fight against climate change"]}
{"comp": "ER_L", "month": "Jul", "feats": "bow", "test": 0.6804, "summ1": ["Fact-Check: Buttigieg Wrong to Say World Has 12 Years to Address Climate Change", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’", "Jay Inslee to Rapper Lil Nas X: 'Let's Collab' on Climate Change", "Ocasio-Cortez Tries To Blame Flooding On Climate Change, Gets Wrecked By REAL Meteorologist"], "summ2": ["Hellish Heat Grips Half The Country", "Climate Change Is A Poor People’s Issue", "Bizarre summer hailstorm covers Guadalajara in ice", "11% of CNN moderators' questions were about climate crisis at first Detroit debate night"]}
{"comp": "ER_L", "month": "Mar", "feats": "sbert", "test": 0.6798, "summ1": ["Greenpeace Founder: Climate Change Hoax Being Pushed by Corrupt Scientists ‘Hooked on Government Grants’", "Independent Audit Exposes Massive Fraud In Global Warming Data", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’", "Senate Votes Down Green New Deal Resolution 0-57"], "summ2": ["1,700+ Species Now at Risk From Human Action, Researchers Report", "Climate Change Is Too Serious for Political Labels", "Trump Cites Total Moron In Climate Change Denial Tweet", "Devastating Floods Are Breaking Records in Nebraska"]}
{"comp": "C_R", "month": "Aug", "feats": "sbert", "test": 0.6797, "summ1": ["Our galaxy's black hole spewed a super bright light, and scientists don't know why", "INSIDER: Lessons from Developing a Monitoring and Evaluation Framework to Measure Local Adaptation Grants Impact in 14 Developing Countries", "World warned: change now or endanger food and climate", "Trump Promotes Turning Natural Gas Into Plastics"], "summ2": ["Prince Harry 'gives barefoot speech' at Google Camp in Italy", "Panic! At The DNC: General Feeling Is That Trump Is Just Killing Them On All Fronts", "Climate Change 101: The Evidence Humans Aren’t Destroying the Climate", "Royal anger: Instagram in meltdown as Harry and Meghan slammed for climate change post"]}
{"comp": "L_R", "month": "May", "feats": "sbert", "test": 0.6794, "summ1": ["How Citizens’ Assemblies Could Be Used to Tackle Climate Change", "Bill Nye on climate change: ‘It’s not 50 to 75 years away — it’s 10 or 15’", "Ohio Stumbles, with a Team Trump Nudge, Toward Nuclear and Coal", "This brutal creature is wiping out everything besides itself"], "summ2": ["Julie’s revenge: Bishop (literally) boots Tony Abbott out of Parliament", "The Science of Climate Change: Are you a Denier?", "Beto O'Rourke blames climate change for the crisis at the Mexican border", "NYC takes going green to a new level: Soon, the city will use residents' poop to fuel homes"]}
{"comp": "R_RC", "month": "Jun", "feats": "sbert", "test": 0.6794, "summ1": ["The Latest: Trump Says Prince Charles Talked Climate Change", "‘Never fails to amaze’: Vox’s warning about ‘foods we could lose if climate change continues’ is enough to make you want to torch a pile of tires", "The Left’s Green Giant: Litigating Climate Change", "During Late-Term Abortion, Woman Delivered Living 20-Week-Baby in the Toilet. He Was Left to Drown"], "summ2": ["climate change:This 7-Yr-Old Girl Stood Near Parliament Urging PM Narendra Modi To Pass The Climate Change Law Now", "Downed power lines faulted in deadly California wine country fires", "Vancouver Weather: Sunny and mild", "Biden unveils $1.7-trillion climate plan to end U.S. carbon emissions by 2050"]}
{"comp": "ER_LC", "month": "Sep", "feats": "bow", "test": 0.6792, "summ1": ["Trump Hilariously Upstages Climate Activist Greta Thunberg's Speech", "Bernie Sanders Says Abortion Will Help Fight Climate Change", "Swedish Scientist Proposes Cannibalism to Fight Climate Change", "Watch: Jerome Hudson Calls Out the Left's Climate Hypocrisy, Gun Control Hysteria on 'Watters World'"], "summ2": ["Pakistan taking steps to beat climate change, says PM Imran", "Stockholm Biochar Project, a Mayors Challenge winner, opens its first plant", "Tropical storm Humberto lashes hurricane-hit Bahamas", "Climate change is happening, but people can't agree on what to do about it. Here's where people in 28 major countries stand."]}
{"comp": "LC_R", "month": "Apr", "feats": "sbert", "test": 0.6788, "summ1": ["Environmentalists hope for action in wake of 'shocking and utterly unsurprising' climate-change report", "Ultra Low Emission Zone: London's new pollution charge begins", "How Invenergy Quietly Became One of the Biggest Players in Grid Storage", "Why Warringah voters should stick with Tony Abbott"], "summ2": ["AOC Is a Fool, But Her Politics Are Here to Stay", "Biologist, ex-teacher and retired CEO among Parliament climate change protesters", "Corbyn’s brother labels climate change a ‘hoax’ and slams London protestors - ‘DERANGED!'", "Global warming is shrinking glaciers faster than we thought"]}
{"comp": "L_RC", "month": "Sep", "feats": "sbert", "test": 0.6777, "summ1": ["Americans Finally See Climate Change As the Urgent Crisis It Is", "“Enough Smoke to Blot Out the Stars”: Watching the World Burn in British Columbia", "The People of the Isle de Jean Charles Are Louisiana’s First Climate Refugees—but They Won’t Be the Last", "Turning Back on Climate Summit, Trump Hosts 'Religious Freedom' Session at UN"], "summ2": ["The climate strike is all about indoctrination, not science", "Singapore will do its full part to mitigate climate change: PM Lee", "Climate change could turn oceans from friend to foe, UN report warns", "NP View: How Trudeau's Liberals went from vowing transparency to gagging people"]}
{"comp": "R_RC", "month": "May", "feats": "sbert", "test": 0.6767, "summ1": ["Ocasio-Cortez Rebuffs ‘Fact-Checkers,’ Says The World Ending In 12 Years Was ‘Dry Humor’", "EPA Spends $84,000 to Study Churches That Preach Climate Change", "Nigel Farage predicts the Brexit Party 'could win big' in the European elections", "The Science of Climate Change: Are you a Denier?"], "summ2": ["Proposed Nuclear Bailouts in OH, PA Get Mixed Reactions From Industry – InsideSources", "Loss of biodiversity 'greater threat than climate change'", "Barnes: How the grassroots drove Ottawa's climate change declaration", "Vancouver Weather: Mixed weather for the May long weekend"]}
{"comp": "C_R", "month": "Jan", "feats": "sbert", "test": 0.6765, "summ1": ["Why greening our cities is key to unlocking $29 trillion worth of investment", "Calls for ministers to help farmers facing impacts of climate change", "Electric vehicles make up nearly half the market in Norway", "Government shutdown delays, disrupts environmental studies"], "summ2": ["Bernie Sanders Claims He Nearly Puked Over JFK Opposing Communism!", "New Poll Suggests Trudeau’s Carbon Tax A Political Albatross", "Broken Hill's local water causes rashes and open sores", "Lindsey Graham Used Ocasio-Cortez's Climate Change Logic In His Latest Comeback"]}
{"comp": "L_R", "month": "Sep", "feats": "sbert", "test": 0.6755, "summ1": ["Climate Action Is Not Controversial—The Data Proves It", "Trump’s Low-Energy U.N. Speech Said More Than He Realized", "Why we’ve joined the global climate strike", "As Arctic Sea Ice Disappears, What Happens to Ecosystems?"], "summ2": ["The Ratings for CNN’s “Climate Crisis” Town Hall Are In", "More Scientists Debunking Climate Change Myths", "No, Don't Listen to Greta Thunberg", "PressTV-7,000 troops deployed to Paris to confront yellow vests"]}
{"comp": "L_LC", "month": "Apr", "feats": "sbert", "test": 0.6748, "summ1": ["Trump’s Budget Calls For A 70% Cut To Renewable Energy Funding", "Climate change must be a thing: it's on prime time TV", "Netflix’s ‘Our Planet’ Is the Ultimate Plea for Fighting Climate Change", "Nancy Pelosi embraces the “enthusiasm” behind the Green New Deal"], "summ2": ["Climate change activists shut down London roads, sights", "Environmentalists hope for action in wake of 'shocking and utterly unsurprising' climate-change report", "Greta Thunberg Is on the 2019 TIME 100 List", "NorthLink cuts 200,000 single-use plastics from Northern Isles ferries"]}
{"comp": "C_L", "month": "Jan", "feats": "sbert", "test": 0.6735, "summ1": ["Renewables overtake coal as Germany's main energy source", "Manatee officials collaborate to counter climate change", "Bulletin of the Atomic Scientists", "Calls for ministers to help farmers facing impacts of climate change"], "summ2": ["In Bid to 'Get Big Money Out of Politics,' House Lawmakers Introduce Constitutional Amendment to Overturn Citizens United", "Climate Action in NY: 2019 Could Be Even Bigger than 2018", "\"It’s infuriating”: Trump-supporting parents turn on the president over lax EPA rules", "Climate Scientist who put ‘Polar Vortex’ into the Vernacular explains her Findings in plain English"]}
{"comp": "R_RC", "month": "Aug", "feats": "sbert", "test": 0.6733, "summ1": ["Prince Harry 'gives barefoot speech' at Google Camp in Italy", "Putting a Cap on Heat Hysteria", "UK Eco-Extremists Show Why the US Needs a Counter-Drone Strategy", "Most Americans continue to trust scientists - but their faith is split over party lines"], "summ2": ["Asia's megacities must learn from Indonesia's capital move", "Canadian food supplies at risk if climate change not slowed, new UN report shows", "Snow conditions, Australia: Kangaroos in Goulburn paddock", "Forest Protection Crucial To Fight Climate Change"]}
{"comp": "ER_R", "month": "Jun", "feats": "sbert", "test": 0.6726, "summ1": ["The Summer of Climate Change Discontent", "MSNBC Guest Says Death Toll From Climate Change Would Be Like ‘25 Holocausts’", "Pope Francis: God Will Destroy ‘Walls’ Between Nations", "POLL: Americans Believe FAKE NEWS Is A Bigger Problem Than Climate Change!"], "summ2": ["Word of the Week: 'Climate change'", "Soros Funded 12 Liberal District Attorney Candidates, 10 Won", "Gore lectures Australians on climate change in taxpayer-subsidized conference", "Scotland fury: Nicola Sturgeon lashes out at Johnson, Hunt and Brexit in vitriolic speech"]}
{"comp": "R_RC", "month": "Jul", "feats": "bow", "test": 0.672, "summ1": ["AOC's Green New Deal would boost gas tax $10-$13, 'destroy economy'", "UK weather: Britain braces for its hottest day on record today", "Bipartisan Panel Admits Humans Not Responsible for Global Warming", "Bristol man unable to see his father before he died because Extinction Rebellion protest traffic"], "summ2": ["Government must focus on health and social benefits to encourage climate action, says London academic", "Floating Antarctic ice goes from record high to record lows", "Train carrying water from Jolarpettai arrives in Chennai", "Younger voters mobilizing to make federal election about climate change"]}
{"comp": "L_LC", "month": "Jan", "feats": "sbert", "test": 0.6709999999999999, "summ1": ["Thanks to Green New Deal Push, Progressives Have Forced Corporate Media to Put Focus on Climate Crisis", "Climate Action in NY: 2019 Could Be Even Bigger than 2018", "\"It’s infuriating”: Trump-supporting parents turn on the president over lax EPA rules", "Climate Change Action Would Kill Imperialism"], "summ2": ["Ten worst climate-linked disasters of 2018 caused $85 bln in damage", "MP chauffeur-driven cars should be electric", "The Problem With Using Old Weather Reports to Track Climate Change", "I give up, says Brazilian minister who fought to save the rainforest"]}
{"comp": "LC_R", "month": "Mar", "feats": "sbert", "test": 0.669, "summ1": ["Letter to the editor: To stop climate change, we must push for both state, federal action", "Alabama tornadoes: Seven family members among 23 killed", "Ford government 'gutted' climate change programs that were working: report", "Former NY Mayor Bloomberg to forgo 2020 White House bid, will focus on climate change"], "summ2": ["Global Warming Has Been Canceled: Key Greenland Glacier Has Expanded. Ocasio-Cortez Hardest Hit", "Alienated: Alberta project seeks to find common language on climate change", "Pelosi Says She Personally Supports Lowering The Voting Age To 16", "Anti-climate Science Totalitarians"]}
{"comp": "C_R", "month": "May", "feats": "sbert", "test": 0.6688, "summ1": ["Scientists warn of grave impacts from loss of natural world", "Russia, eyeing Arctic future, launches nuclear icebreaker", "Kenya: We Asked Kenyan Students About Climate Change. They Didn't Know Much", "UK climate panel sets big goals: less meat, electric cars"], "summ2": ["The Far-Left Lost an “Unlosable” National Election in Australia Last Night and It’s Glorious", "Trump moves to de-fang global warming science with 'climate review panel'", "£1m a week in child benefit paid to children living overseas", "The Science of Climate Change: Are you a Denier?"]}
{"comp": "L_RC", "month": "Mar", "feats": "bow", "test": 0.6684, "summ1": ["Trump gets smacked down for mindlessly parroting bogus Fox & Friends report denying climate crisis", "Alexandria Ocasio-Cortez's Fiery Warning After Green New Deal Fails: ‘We’re Going To Pay For This’", "Hundreds of Thousands of Students Prepare for Global #ClimateStrike: Here Are 5 Ways You Can Help", "Two lives lost as Nebraska struggles with state's worst flooding in 50 years"], "summ2": ["Carbon pricing is most efficient way to cut emissions, Canadian Chamber says", "Three WA students explain why they taking part in the Perth School Strike For Climate Change", "Alienated: Alberta project seeks to find common language on climate change", "Floods suggest national security threat from climate change"]}
{"comp": "C_R", "month": "Jun", "feats": "bow", "test": 0.6683, "summ1": ["Pressure mounts on aviation industry over climate change | Bangkok Post: news", "Democratic 'climate change candidate' outlines plan to wean U.S. off fossil fuels", "How water scarcity triggers the refugee crisis – and what tech can do to solve it", "Border wall, nuclear weapons to spark partisan fight at defense bill debate"], "summ2": ["'Birth Strikers' Pledge Not To Have Kids Because Of 'Climate Crisis'", "Did Prince Charles INFLUENCE Theresa May's meeting with Donald Trump?", "Beto O’Rourke Claims Illegal Aliens ‘Have No Choice But To Come Here’ Because We Cause Climate Change", "GOLDSTEIN: Economic benefits of carbon taxes overstated, says Fraser report"]}
{"comp": "L_RC", "month": "Jul", "feats": "bow", "test": 0.6671, "summ1": ["Hellish Heat Grips Half The Country", "At the Democratic Debate, Pete Buttigieg Addresses the Age Issue", "Insurance Giant Ditching Coal Industry Called 'Major Step Forward'—Especially If Others Follow", "Barry Weakens to Tropical Storm, Likely to Spare New Orleans From Massive Flooding"], "summ2": ["Younger voters mobilizing to make federal election about climate change", "Climate change added 7F to Europe’s heatwave: study", "Singapore will spend $400m upgrading drains, $10m on studying sea level rise to counter climate change", "David Attenborough says powerful Australians are climate change sceptics"]}
{"comp": "L_RC", "month": "Mar", "feats": "sbert", "test": 0.6659, "summ1": ["Trump administration concedes coal is collapsing on its watch as renewables soar", "Climate Change Is Too Serious for Political Labels", "Devastating Floods Are Breaking Records in Nebraska", "Remington Can Be Sued Over Marketing of Rifle Used in Sandy Hook Massacre"], "summ2": ["After 2018 floods, Keralites want climate change to drive poll narrative", "UN’s stark warning on climate change", "Eleanor Flegg: If gardening is not your thing, you can still enjoy your outdoor space by bringing the inside, out", "B.C. seeks judicial approval from Court of Appeal to regulate heavy oil shipments"]}
{"comp": "C_L", "month": "Mar", "feats": "sbert", "test": 0.6655, "summ1": ["Study Finds Great Lakes Climate Change Could Be Disastrous", "Varadkar backs climate change strike by school children", "Voters have not been told the full story on cost of carbon", "'The water kept rising': How Mozambicans were caught in path of deadly cyclone"], "summ2": ["Yes! These 21 Heroic Kids Are Suing The Government Over Climate Change", "Climate Change Is Too Serious for Political Labels", "Trump—and Fox—are lying about a corporate lobbyist being ‘the founder of Greenpeace’", "Remington Can Be Sued Over Marketing of Rifle Used in Sandy Hook Massacre"]}
{"comp": "LC_R", "month": "Mar", "feats": "bow", "test": 0.6654, "summ1": ["Why Democrats say the U.S. needs a Green New Deal to combat climate change", "Cyclone Idai: satellite images show extent of flooding around Beira", "Trump climate deregulation could boost CO2 emissions by 200 mln tonnes a year -study", "How climate change is costing you in the vegetable aisle"], "summ2": ["Denying climate change is like saying the moon is made of cheese, argues Obama as he takes on global warming deniers at commencement speech", "Connecticut Bill Would Mandate Teaching Kids About Climate Change", "Plastic pollution is one of the major health threats to the world", "'I'M NOT OWNED!': Ocasio-Cortez Gets Mocked After Her Green New Deal Fails In Senate Vote"]}
{"comp": "L_LC", "month": "Jul", "feats": "sbert", "test": 0.6651, "summ1": ["Why We’re Challenging the 2020 Democrats to a Climate Summit", "Donald Trump has found a whole new way to screw us over", "Summer In Alaska In 2019 \"Basically Off The Charts\" In Terms Of Heat, Humidity, Melting", "'Congress Needs to Wake Up': Demanding Lawmakers Declare Climate Emergency, Extinction Rebellion Activists Superglue Themselves to Capitol"], "summ2": ["Eskilstuna: how a Swedish town became the world capital of recycling", "World will not meet 2C warming target, climate change experts agree", "A new team is working to predict the danger zones of Australia's deadliest heatwaves", "China Pursues More Renewable Energy At Home & Abroad"]}
{"comp": "L_LC", "month": "Feb", "feats": "sbert", "test": 0.6639, "summ1": ["Alexandria Ocasio-Cortez Wants the Country to Think Big", "'Complete Wiping Away of Clean Water Act': Trump EPA Rule Would Free Corporations to Pollute Nation's Water as Much as They Please", "How Militarization Impedes The Green New Deal", "How Greed, Fear and Our Own Biases Blind Us to the Realities of Climate Change"], "summ2": ["Climate change set to disrupt Australia's summer sports calendar", "Government foreshadows border protection announcements in the wake of historic loss in Parliament", "Nuclear Power: Still Not Viable without Subsidies (2011)", "For One City Manager, Climate Becomes A Matter Of Conscience"]}
{"comp": "LC_R", "month": "Jun", "feats": "sbert", "test": 0.6636, "summ1": ["Climate change: Ways farmers can help the environment", "Production Interior Confirms That BYTON’s M-Byte Will Keep Its Massive Display", "European heat wave: France, Germany, Poland and the Czech Republic set June records, and the worst is still to come", "Watch Live: Court Hears Arguments in Youth Climate Lawsuit"], "summ2": ["Loose Ends (84)", "GUNTER: McKenna’s smear of oil industry will cost Canada billions", "Girl, 15, uses BBC's Tory leadership debate as a platform to peddle climate change agenda", "Climate Change Is Real. Too Bad Accurate Climate Models Aren't."]}
{"comp": "LC_R", "month": "Feb", "feats": "bow", "test": 0.6623, "summ1": ["Conservation groups press world leaders to protect 30% of the planet", "Powerful storm dumps more rain and snow across the West", "Limitless clean energy ‘could be here by 2030’ and solve the climate crisis", "UPDATE 3-Clashing with Trump, US govt report says climate change will batter economy"], "summ2": ["House climate-change hearing adjourns after not enough Democrats show up", "Alexandria Goes Too Far – Tells Americans Not To Have Children Due To Climate Change… – CITIZEN FREE PRESS", "This is not a national emergency: Congress must update the National Emergency Act", "Top 2020 Democrats co-sponsor Ocasio-Cortez’s bonkers Green New Deal plan"]}
{"comp": "L_R", "month": "Apr", "feats": "sbert", "test": 0.6608, "summ1": ["Jay Inslee Calls For a Climate Change Only Primary Debate", "Good News Roundup for Tuesday (with Attitude)", "Making Investments Climate Smart: Globally and in India", "Farmers held on to a mountain of grain because of Trump's trade war—now it's underwater"], "summ2": ["Corbyn’s brother labels climate change a ‘hoax’ and slams London protestors - ‘DERANGED!'", "Global warming is shrinking glaciers faster than we thought", "Campus Police Chief Put On Leave After Student Outrage For Liking NRA And Trump Tweets", "DOMINIC LAWSON: Deluded middle-class climate warriors can’t see the real danger of their bright idea"]}
{"comp": "ER_R", "month": "Jun", "feats": "bow", "test": 0.6607, "summ1": ["$10 Trillion ‘To Have A Shot’: Ocasio-Cortez Updates Climate Change Price Tag", "Poll: Climate Change, Guns, Abortion Biggest Topics for Democratic Debates", "UN Debuts New Global Warming Hysteria Buzzword: ‘Climate Apartheid’", "POLL: American’s Believe Fake News Is A Much Bigger Problem Than Climate Change"], "summ2": ["Piers Morgan gets the only interview with Trump while he's in the UK", "The Left’s Green Giant: Litigating Climate Change", "GOLDSTEIN: Scheer’s climate pledge is nonsense, just like Trudeau’s", "Feeling the Senior Climate Change Blues"]}
{"comp": "LC_R", "month": "Sep", "feats": "bow", "test": 0.6607, "summ1": ["Hurricane Dorian at standstill, pounding the Bahamas; US coastline braces for impact", "The global climate strike could make history. Here’s what you need to know", "State governors support Bolsonaro’s Amazon mining, agribusiness plans", "Climate change severely damaging world’s oceans, UN report warns"], "summ2": ["Bernie Sanders Makes One of the Most 'Horrifying' Arguments During CNN Climate Town Hall", "The Tragedy Of Greta Thunberg", "Environmental apocalypse predictions have failed for half a century", "Julian Castro Calls on Public Schools To Push Climate Change Narrative"]}
{"comp": "C_R", "month": "Mar", "feats": "bow", "test": 0.6604, "summ1": ["Air Force says it needs $4.9 billion in disaster relief", "Trump climate deregulation could boost CO2 emissions by 200 million tonnes a year: study", "Hundreds of thousands join world youth climate demo", "PM considers underwriting coal to appease Nationals"], "summ2": ["Report: Rep. Ocasio-Cortez Has Violated Her Own Green New Deal", "Connecticut Bill Would Mandate Teaching Kids About Climate Change", "O'Rourke: Global Warming Activists Are Just Like D-Day Soldiers", "Al Gore sees another climate change ‘tipping point,’ declares the ‘science’ no longer debatable (bonus prediction fail)"]}
{"comp": "R_RC", "month": "Sep", "feats": "bow", "test": 0.6597, "summ1": ["“Climate Change” Is A Hoax", "BAM: Ken Cuccinelli Reminds Us What The Global Warming Protest Is Really About", "Bernie Sanders's Abortion Population Control Comments -- 2020 Candidate Knocked for Comments", "Eco-activist Greta Thunberg's language is 'terrifying children'"], "summ2": ["How dare you? You have stolen my childhood: Climate activist Thunberg to world leaders at UN Climate summit", "PM Modi holds series of bilateral meetings on sidelines of UNGA in New York", "Climate change protest: Thousands expected at Global Strike 4 Climate", "Andaman, Nicobar Islands may not be inhabitable in future due to rise in sea level: IPCC"]}
{"comp": "C_L", "month": "Sep", "feats": "bow", "test": 0.6597, "summ1": ["'You have stolen my dreams,' an angry Thunberg tells U.N. climate summit", "Malaysia to require banks to report exposure to climate risks", "Pensacola considers climate change task force", "Hurricane Dorian: Cat 4 storm creeps over Bahamas with 155 mph winds"], "summ2": ["Scientists Say Climate Change Will Bring More Storms Like Hurricane Dorian", "Trump administration takes war on climate crisis action to new level", "Greta Thunberg puts delegates at United Nations climate summit on notice: \"You are failing us\"", "Global Climate Strike: a tipping point for change"]}
{"comp": "C_L", "month": "Aug", "feats": "sbert", "test": 0.6596, "summ1": ["Merkel's Bavarian allies call for German climate bond - BamS", "World warned: change now or endanger food and climate", "Groton-New London area sees July that's 5.1 degrees warmer than usual", "Nasa releases disturbing photos of Amazon fires captured from space"], "summ2": ["Key Question About DNC Race: Why Did Obama White House Recruit Perez to Run Against Ellison?", "Saving the Planet Means Fighting Bipartisan Corruption", "Elie Mystal Gets Serious About Greenland ... But Not How You Think", "Sen. John Cornyn was ruthlessly mocked on social media after ridiculous climate change joke"]}
{"comp": "C_L", "month": "Sep", "feats": "sbert", "test": 0.6592, "summ1": ["New wave of global climate protests: Are Friday strikes here to stay?", "Cannon-Brookes' plan to power Singapore", "World must adapt to 'inevitable' climate change, warns report", "No trees, no shade, no relief in cities as climate heats up"], "summ2": ["The evil twins: Climate change and ocean acidification |...", "Sanders on rolling back Trump climate change actions: \"Duh!\"", "Climate Action Is Not Controversial—The Data Proves It", "Greta Thunberg's sassy reaction to Donald Trump mocking her"]}
{"comp": "LC_R", "month": "Apr", "feats": "bow", "test": 0.6582, "summ1": ["Let nature heal climate and biodiversity crises, say campaigners", "Record Easter temperatures in three nations of the UK", "These 9 ​Companies Are Leading the Fight Against Climate Change", "Cyclone Kenneth: at least five dead as heavy rain lashes Mozambique"], "summ2": ["What David Attenborough and Netflix’s 'Our Planet' Get Wrong About Climate Change", "London protests: How long will Extinction Rebellion climate change protest last?", "Beto O’Rourke wants to spend $5 trillion in taxpayer money fighting climate change", "Report: Green New Deal Would Have ‘No Effect’ on Climate"]}
{"comp": "L_R", "month": "Jan", "feats": "sbert", "test": 0.6577, "summ1": ["Want to Pass Medicare for All? Fix American Democracy First.", "Trump Once Again Confuses Weather and Climate in Response to Deadly Winter Storm", "Climate Action in NY: 2019 Could Be Even Bigger than 2018", "The Science of Sea Spray"], "summ2": ["Diversity, climate, debt: Democrats rewrite House rules", "Lindsey Graham ZINGS Ocasio-Cortez over her ridiculous climate change comments…", "Mona Charen: Who's Right About Sweden?", "Yellowstone eruption: Supervolcano threatens food shortages for ENTIRE Northern Hemisphere"]}
{"comp": "ER_L", "month": "Feb", "feats": "sbert", "test": 0.6577, "summ1": ["MOSELEY: It’s Time To Send The CO2-Obsessed Back To Science Class", "Ocasio-Cortez Calls for ‘Massive Government Intervention’ to Combat Climate Change", "Soros Revealed as Ocasio-Cortez’s Green New Deal Financier", "Delingpole: BBC Caught Lying Again. And Again…"], "summ2": ["Local Water Reliability Act Boosts CA Coastal Water Supplies", "'All my friends are running for president': How Senate Democrats are navigating 2020", "Britain: student climate strikes demand radical change – we need a revolution", "How Greed, Fear and Our Own Biases Blind Us to the Realities of Climate Change"]}
{"comp": "R_RC", "month": "May", "feats": "bow", "test": 0.6569, "summ1": ["Trump Climate Panel Could Expose Huge Fraud, Hence the Hysteria", "National Weather Service issues tornado watch for more than 24 million people", "'I'll Be Damned': Ocasio-Cortez Blasts Biden's 'Middle Of The Road' Plans", "Around the world, backlash against expensive climate change policies"], "summ2": ["Warmer summer expected in the West spells bad news for forest fires", "Federal election 2019: Bill Shorten’s climate change policy could cost $264 billion", "One million youth joining forces to fight climate change", "Nature in unprecedented decline around the globe, landmark assessment says"]}
{"comp": "LC_R", "month": "Jan", "feats": "sbert", "test": 0.6569, "summ1": ["When Worlds Collide: My Work as a GCE at Environment and Climate Change Canada", "Ten worst climate-linked disasters of 2018 caused $85 bln in damage", "'Won't die wondering': NSW to deploy aerators to keep fish stocks live", "The Problem With Using Old Weather Reports to Track Climate Change"], "summ2": ["Lindsey Graham ZINGS Ocasio-Cortez over her ridiculous climate change comments…", "Blocking sunlight to cool the Earth will not work", "No Need to Repent for Support of Iraq War", "The 'Green New Deal': A Radical Mandate for Government Control of American Society"]}
{"comp": "ER_LC", "month": "May", "feats": "bow", "test": 0.6566, "summ1": ["Bernie Tells College Students Climate Change Will Cause War", "Top Climatologist: ‘Global Warming Is A Myth Started By The Nuclear Industry’", "George Clooney Parody PSA Rips Trump and 'Dumb F*cking Idiots' for 'Saying Dumb Sh*t' About Climate Change", "‘I’LL BE DAMNED’ – Ocasio-Cortez Doubles Down, Attacks Joe Biden’s ‘Climate Change’ Policy"], "summ2": ["US refuses to sign Arctic agreement because of climate change wording", "5G signal could jam satellites that help with weather forecasting", "Climate change: 'Big shift' on carbon emissions urged", "In Weymouth, echoes of Flint"]}
{"comp": "C_R", "month": "May", "feats": "bow", "test": 0.6564, "summ1": ["City officials don't expect repeat of 2017 flooding on Toronto Islands", "Companies lobby U.S. Congress on carbon tax; senator expects bill in weeks", "The world invested almost $2 trillion in energy last year. These 3 charts show where it went", "How to fix Nature and avoid human misery: UN report"], "summ2": ["Meteorologist Shuts Down Hysterical Climate Claim From Ocasio-Cortez", "Beto: We only have '10 years' left to address climate change", "Biden tells AOC to 'calm down' on climate change »", "Australia’s Election Shock Shows the Perils of Moralizing Climate Change"]}
{"comp": "LC_R", "month": "Aug", "feats": "sbert", "test": 0.6561, "summ1": ["Tesla Energy Goes Mega", "Gran Canaria: 9,000 flee 'unprecedented' wildfires on holiday island", "What’s in the way of this Texas pipeline? A cute songbird.", "EXPERT VIEWS-U.N. climate and land report flags need for 'new and healthy balance'"], "summ2": ["Elites Caught in Amazon Wildfire Lie as NASA Confirms 'Average' Fire Season", "Teenage Environmental Activist On Meeting Trump: ‘Why Should I Waste Time Talking To Him?’", "Hulu Rom-Com Remake Shrieks 'We're All Gonna Die of Climate Change!'", "UN panel recommends eating less meat and more vegetables to counter climate change"]}
{"comp": "L_RC", "month": "Aug", "feats": "bow", "test": 0.6559, "summ1": ["Bernie Sanders' plan for handling the climate crisis is a genuine revolution", "DNC shuts down climate debate compromise", "'Choosing a Plant-Based Diet' Can Help Save Earth — But There's Not Much Time Left, Experts Warn", "Trump moves to limit state powers to block pipelines"], "summ2": ["Canadian food supplies at risk if climate change not slowed, new UN report shows", "Pacific climate change talks: Scott Morrison trying to water down leaders", "Extinction Rebellion climate extremists prepared to do ‘whatever it takes’ ahead of Perth action", "Kerala: Archbishop of Canterbury cautions about climate change"]}
{"comp": "LC_R", "month": "May", "feats": "sbert", "test": 0.6554, "summ1": ["Climate change being fuelled by soil damage", "US refuses to sign Arctic agreement because of climate change wording", "Fire danger could force SF blackout, PG&E says", "No longer prized Liberal territory, Julia Banks and Labor eye Flinders"], "summ2": ["Actress Emma Thompson spotted on carbon-spewing BA plane jetting to New York", "Australia: Conservatives score surprise upset victory as voters reject Labor climate change and income inequality agenda", "Ocasio-Cortez Rebuffs ‘Fact-Checkers,’ Says The World Ending In 12 Years Was ‘Dry Humor’", "The Science of Climate Change: Are you a Denier?"]}
{"comp": "L_LC", "month": "Jun", "feats": "sbert", "test": 0.6546, "summ1": ["No System of Government Designed by Human Beings Can Survive What the Climate Crisis Will Bring", "“Fracking in the UK doesn’t make much sense”, says former fracking company boss", "Trump Official Goes Rogue, Says Climate Change May Cause Next Financial Crisis", "Democratic presidential candidates call for change at California’s Democratic Party Convention"], "summ2": ["Boston Built a New Waterfront Just in Time for the Apocalypse", "Emissions must be halved to avoid dangerous climate: Scientists", "Rice: The Changing Nature of the World's Most Important Food", "Plea over Scottish Parliament's fossil fuel pensions"]}
{"comp": "ER_R", "month": "Aug", "feats": "bow", "test": 0.6543, "summ1": ["Climate Change Alarmist Suffer Another Blow — Data Proves U.S. Hasn’t Warmed Since 2005", "HILLARIOUS! DNC Votes Down ‘Climate Debate’ For Candidates…BECAUSE IT WOULD HURT THE POLLS!", "Jay Inslee Unlikely to Qualify for CNN’s Climate Change Town Hall", "Barack And Michelle Obama Just Proved That The Left’s ‘Climate Change’ Agenda Is All A HOAX – The Times Of America"], "summ2": ["Nigel Farage attacks Prince Harry and Meghan Markle for 'irrelevant' campaigns", "UN panel recommends eating less meat and more vegetables to counter climate change", "‘Donald Trump is an idiot’: Bernie Sanders doesn’t hold back on Trump and climate change", "Restricting climate strikes to one day a year `not..."]}
{"comp": "L_R", "month": "Aug", "feats": "bow", "test": 0.6539, "summ1": ["Trump’s New Coal Rules Will Bury Rural America", "Democratic National Committee Rejects Possibility of Official Climate Debate", "Report: we have to change how we use land and produce food to fight climate change", "As White House dismisses planetary emergency as ‘niche’ issue, Trump skips G7 climate meeting"], "summ2": ["Prince Harry 'gives barefoot speech' at Google Camp in Italy", "UK weather: Heavy rain and thunderstorms cause hazardous conditions", "Barack Obama made one mistake that just doomed the Democrat Party to defeat", "‘It’s all such a scam’: Guess how teen climate activist Greta Thunberg’s ‘zero-carbon’ yacht is getting back to Europe"]}
{"comp": "ER_L", "month": "May", "feats": "sbert", "test": 0.6537, "summ1": ["Pelosi’s Brother-In-Law’s Company Received $737,000,000 From Obama’s Energy Department As “Loan Guarantee”", "‘Global Warming’ Not Scary Enough, Alarmists Rebrand ‘Climate Crisis’", "MUST READ: Mueller's Reprehensible Ultimatum to General Flynn: Your Son or Your Country? Make Your Decision!", "UN Report: Humans Killing Planet, Globalism the Fix"], "summ2": ["A Decisive Year for the Sunrise Movement and the Green New Deal", "Siberians roast under temperatures as high as 87.8 F as second heat wave melts the Arctic.", "Beef Industry Takes the Biggest Bite Out of Earth's Natural Resources", "Open Letter About WA Governor Inslee's Appeal of Youth Climate Victory"]}
{"comp": "L_R", "month": "Apr", "feats": "bow", "test": 0.6535, "summ1": ["House Democrats Voted for a Natural Gas Future, and Nobody Noticed", "Smoking out the public health threat posed by climate change", "‘Meet the Press’ Won't Give Air Time to Climate Change Deniers", "Trump’s climate policies are so bad even Putin is trolling him"], "summ2": ["Canadian politicians are obsessed with the wrong crisis", "John Kerry says AOC's Green New Deal offered 'more leadership in one day ... than President Trump has in his lifetime'", "Our fight against climate change will be hopeless unless we choose to have smaller families", "Extinction Rebellion suggests group is FINALLY ready to end climate change protests"]}
{"comp": "L_R", "month": "Sep", "feats": "bow", "test": 0.6529, "summ1": ["How much destruction and death before global climate action is taken?", "“This Is Our Time. This Is Our Future.” Voices from the Historic Youth Climate Strike in NYC", "What Is Climate Change? Everything You Need To Know About Global Warming", "California to Trump: 'We’ll see you in court'"], "summ2": ["Pauline Hanson takes a swipe at 16-year-old eco warrior Greta Thunberg after her speech to the UN", "Goose eggs: No climate doomsday warning has come true", "Will the Elite Wake Up in Time & Confront The Left Climate Fear Campaigns?", "Bernie Sanders's Abortion Population Control Comments -- 2020 Candidate Knocked for Comments"]}
{"comp": "ER_L", "month": "Jun", "feats": "bow", "test": 0.6529, "summ1": ["WATCH: Elizabeth Warren Claims Climate Change Is A ‘Bigger Threat Than World War II’ On Eve Of D-Day Anniversary", "$10 Trillion ‘To Have A Shot’: Ocasio-Cortez Updates Climate Change Price Tag", "Poll: Climate Change, Guns, Abortion Biggest Topics for Democratic Debates", "Pope Francis on Global Warming: 'Time is Running Out!'"], "summ2": ["Not 'Freedom Gas' But 'Failure Gas': First-of-Its-Kind Report Details Planetary Perils of US Fracking Infrastructure Boom", "Oregon Republicans are still on the lam to avoid voting on a major climate change bill", "Florida faces a climate crisis as Democratic candidates take the debate stage", "8 Creative Ways Cities Are Combating Rising Temperatures"]}
{"comp": "C_R", "month": "Aug", "feats": "bow", "test": 0.6508, "summ1": ["Where BHP goes on climate change, will others follow?: Russell", "Climate change will make food scarce, expensive, and low in nutritional value, report says", "Brazil’s Amazon rainforest is burning at a record rate", "GOP Florida Governor enlists new officer to prepare state for rising sea level"], "summ2": ["Andrew Yang proposes 'giant space mirrors' to tackle climate change", "'We have a right to be here': Climate activists crash DNC summer meeting", "Elton John Defends Meghan Markle, Prince Harry Against Attacks Over Excessive Private Plane Travels", "The Green New Deal: Less About Climate, More About Control"]}
{"comp": "L_RC", "month": "May", "feats": "bow", "test": 0.65, "summ1": ["Pompeo: Melting sea ice presents 'new opportunities for trade'", "Biden’s Climate Policy Sounds a Lot Like Obama’s", "Report: Trump Admin Plans To Restrict Climate Change Predictions To 2040", "The Planet Is Going Extinct and the People in Power Don't Seem to Care"], "summ2": ["Bengaluru: Citizens rally to protest climate change", "Australian election could have global climate change impact", "'Nowhere across the country will be free to pollute': Trudeau says replacement for Alberta carbon tax under discussion", "One million species facing extinction, posing a risk to human well-being: UN report"]}
{"comp": "R_RC", "month": "Jan", "feats": "bow", "test": 0.6499, "summ1": ["Bernie Sanders Makes Wacky Claim About Climate Change, Gets Instantly Mocked", "Rethinking the Carbon Tax", "NBC's Todd Boasts of Banning Climate Skeptics: 'Didn't Invite Moon Landing Deniers, Flat Earthers, Either'", "Deranged Dems: Ocasio-Cortez is predicting the “end of the world”"], "summ2": ["India calls for cautionary approach to link climate change", "Taking the Carbon Out of Climate Change", "Australia weather: Emergency warnings issued for Sydney, Melbourne, Adelaide amid week-long heatwave", "Remember Dallas' plastic bag fees? They'll buy the city a $500k climate plan"]}
{"comp": "C_L", "month": "Jan", "feats": "bow", "test": 0.6497, "summ1": ["CES 2019: How connected leafy canopies could fight climate change in our cities", "Coal will remain part of the US grid until 2050, federal energy projections say", "Abe calls for rebuilding of trust in international trade at World Economic Forum meeting in Davos", "Scientists reveal 'ideal diet' for peoples' and planet's health"], "summ2": ["Trump Once Again Confuses Weather and Climate in Response to Deadly Winter Storm", "Fossil Fuels: The Dirty Facts", "Sunrise Movement: Pelosi’s Actions on Climate Fall Woefully & Inexcusably Short of What We Need", "Whoopi Goldberg Rips Ocasio-Cortez: 'Before You Start Pooping on People…You Got to Do Something'"]}
{"comp": "LC_R", "month": "Jan", "feats": "bow", "test": 0.6496, "summ1": ["Climate Report Warns Of Extreme Weather, Displacement Of Millions Without Action", "Renewables overtake coal as Germany's main energy source", "Climate change should be a bridge, rather than a wedge issue", "Does talking to people about climate change make any difference?"], "summ2": ["Bernie Sanders Makes Wacky Claim About Climate Change, Gets Instantly Mocked", "Rethinking the Carbon Tax", "NBC's Todd Boasts of Banning Climate Skeptics: 'Didn't Invite Moon Landing Deniers, Flat Earthers, Either'", "Deranged Dems: Ocasio-Cortez is predicting the “end of the world”"]}
{"comp": "ER_R", "month": "Feb", "feats": "bow", "test": 0.6491, "summ1": ["Climate Change Extremists Use Children to Attack Sen. Feinstein for Not Supporting Green New Deal", "The Leftists Who See Trump’s Face in a Da Vinci", "Bast: If There’s No Global Warming, There’s No Climate Change Problem", "Ocasio-Cortez: Abolish ICE and Defund DHS Because ‘We Are a Nation of Laws’"], "summ2": ["Power bills could surge by 50% under new Labor plan that would see workers lose $9,000 a year", "House Democrats To Hold Global Warming Hearing After Record-Breaking Cold Subsides", "Ocasio-Cortez says maybe people should stop having kids because of climate change", "REPORT: Rand Paul Says 10 GOP Senators Will Vote Against Trump’s National Emergency Declaration"]}
{"comp": "L_R", "month": "Aug", "feats": "sbert", "test": 0.6487, "summ1": ["Agriculture’s role in climate change draws scrutiny from 2020 Democrats", "Protests Against G7 Summit Finish With Citizen Manifesto", "Court: Arizonans Have Right to Internet Privacy From Authorities Without Warrant", "Trump wants to offer up largest U.S. national forest to commercial logging"], "summ2": ["Humans will soon be REPLACED by cyborgs AI, futurist predicts", "UN panel recommends eating less meat and more vegetables to counter climate change", "Elton John Defends Meghan Markle, Prince Harry Against Attacks Over Excessive Private Plane Travels", "DNC rebuffs push for unofficial climate change-focused presidential 'debates'"]}
{"comp": "ER_L", "month": "Sep", "feats": "bow", "test": 0.6486, "summ1": ["Hudson: Greta Thunberg, Take Your Climate Tour to China; America’s Reduced Its Carbon Emissions for Decades", "Biden's Eye Fills with Blood While Onstage During Climate Town Hall", "D.C. Mom: Climate Activist ‘Twerking on the Front of My F*cking Car’ Made Kids Late for School", "Bernie Sanders Says U.S. Taxpayers Should Fund Abortions In 'Poor Countries' To Fight Global Warming"], "summ2": ["How much destruction and death before global climate action is taken?", "How Climate Change Is Sinking African Cities", "More Americans than ever agree: climate change is a crisis and Trump needs to do more", "Youth leaders at UN demand bold climate change action"]}
{"comp": "L_RC", "month": "Feb", "feats": "bow", "test": 0.6477, "summ1": ["'The Climate Is a Disaster': Fourth Week of Student-Led Strike as Tens of Thousands March in Belgium", "Trump is already tweeting justifications for his ‘national emergency’", "FOCUS: It's Climate Change That's Scary, Not the Green New Deal", "Why Democrats need to talk about the national interest"], "summ2": ["Climate change: Oceans could turn green by 2100, scientists warn", "ED 'crackdown' will not stop our fight against climate change: Greenpeace India", "Under Trump's Tariffs, The US Lost 20,000 Solar Energy Jobs", "Federal election 2019: Laura Jayes on Coalition climate change policy"]}
{"comp": "C_RC", "month": "May", "feats": "sbert", "test": 0.6473, "summ1": ["UK climate panel sets big goals: less meat, drive electric", "We asked Kenyan students about climate change. They didn’t know much", "Pentagon warns on risk of Chinese submarines in Arctic", "Watch again: EU top job hopefuls clash in Eurovision Presidential Debate"], "summ2": ["Next government urged to focus on climate", "Kenney’s stand on oil and gas divestment is likely to leave Alberta out of position", "Why Americans Are Still Waiting on Congress for Disaster Relief", "Pauline Hanson denies humans behind climate change"]}
{"comp": "LC_R", "month": "Feb", "feats": "sbert", "test": 0.6471, "summ1": ["Teens school U.K. leaders on climate change", "These probiotics for plants help farms suck up extra carbon dioxide", "'Lot of grief' as acute water shortages threaten drought-hit NSW towns", "6 glimmers of climate optimism for the end of a dark year"], "summ2": ["Alexandria Ocasio-Cortez's Green New Deal is mocked by critics", "Climate alarmists – prophets they're not", "Alexandria Ocasio-Cortez on climate change: ‘Is it OK to still have children?’, ‘It’s a basic moral question’", "Obama Raided $500M for Zika to Finance UN’s Green Climate Fund"]}
{"comp": "ER_R", "month": "Apr", "feats": "bow", "test": 0.6464, "summ1": ["O’Rourke announces $5 trillion plan to fight climate change", "Ecosexuals believe Having Sex with Earth will Save It, and stop ‘Climate Change’", "Alec Baldwin: Americans Must Make ‘Certain Sacrifices’ to Save the Planet from Climate Change", "John Kerry: ‘Ocasio-Cortez Has Offered More Leadership in One Day…Than President Trump Has in His Lifetime on This Subject’"], "summ2": ["More than 100 arrests amid London climate change protests", "Todd: Trump's 'Keystone Cops' Wanted to Collude, Too Incompetent to Figure It Out", "Antarctica could turn GREEN due to global warming", "In pictures: climate change activists call for action in Europe"]}
{"comp": "R_RC", "month": "Apr", "feats": "bow", "test": 0.6464, "summ1": ["MIT-educated GOP congressman grills John Kerry for ‘pushing pseudo science’ on climate change", "Netflix Walruses 'fell to deaths because they were being chased by polar bears' NOT climate change", "Extinction Rebellion suggests group is FINALLY ready to end climate change protests", "Ocasio-Cortez: Pass the Green New Deal or we’ll have “blood on our hands”"], "summ2": ["Canada’s failure to fight climate change ’disturbing,’ environment watchdog says", "Climate change will bring heat, rain, pests to Saskatoon: report", "London climate-change street protest arrests reach 290 on second day", "Kenney promises carbon tax court fight by end of April if he wins election"]}
{"comp": "L_RC", "month": "Sep", "feats": "bow", "test": 0.6459, "summ1": ["Scientists Say Climate Change Will Bring More Storms Like Hurricane Dorian", "Trump’s Refusal to Dream Devastating to U.S. Economy, Environment", "Trump administration takes war on climate crisis action to new level", "Climate activist Greta Thunberg used her superpower of shaming adults on Senate Democrats"], "summ2": ["Climate change: India pitches for financial support by developed nations", "64% glaciers in Hindu Kush Himalayan region may be lost by 2100: IPCC report", "How dare you? You have stolen my childhood: Climate activist Thunberg to world leaders at UN Climate summit", "Climate change protest: Thousands expected at Global Strike 4 Climate"]}
{"comp": "ER_L", "month": "Feb", "feats": "bow", "test": 0.6458, "summ1": ["Alarmists: Climate Changes Caused UK Chips to ‘Shrink by an Inch’", "Obama Economist Says GOP Tax Bill Will Literally Kill People", "FAKE SCIENCE: Heat “records” heavily manipulated by dishonest climate change propagandists to try to push global warming lie", "Ocasio-Cortez Tells Democrats That She Is In Charge Now"], "summ2": ["Wildfires Follow Record Hot Temperatures in UK, Burn in Famous Woodland That Inspired 'Winnie the Pooh'", "Trump taps donor with deep coal ties for top U.N. position – ThinkProgress", "What do Green New Deal naysayers propose for dealing with the climate crisis? Thoughts and prayers?", "Saving the future"]}
{"comp": "ER_R", "month": "Mar", "feats": "sbert", "test": 0.6456, "summ1": ["Greenpeace Founder: Climate Change Hoax Being Pushed by Corrupt Scientists ‘Hooked on Government Grants’", "Independent Audit Exposes Massive Fraud In Global Warming Data", "WATCH: Ocasio-Cortez Goes POSTAL Defending Green New Deal – ‘People Are Dying!’", "Senate Votes Down Green New Deal Resolution 0-57"], "summ2": ["Bell: Kenney rips Toronto councillor's attack on oilpatch", "Climate Change Activist Admits: Being Green \"Requires the End of Capitalism\"", "Investors have a duty to act against climate change", "‘Ridiculous’! 125 House Dems – and one Republican – vote in favor of bill to lower voting age to 16"]}
{"comp": "L_LC", "month": "Aug", "feats": "sbert", "test": 0.645, "summ1": ["Agriculture’s role in climate change draws scrutiny from 2020 Democrats", "Trump officials angry about G7 focus on ‘niche issues’ like climate change and gender equality", "Court: Arizonans Have Right to Internet Privacy From Authorities Without Warrant", "Saving the Planet Means Fighting Bipartisan Corruption"], "summ2": ["UK power cut: Why it caused so much disruption", "MMR vaccine: one in seven five-year-olds in England may not be immunised", "Ben McAdams: What the world will see in Utah on responding to climate change", "EXPERT VIEWS-U.N. climate and land report flags need for 'new and healthy balance'"]}
{"comp": "L_R", "month": "Jun", "feats": "sbert", "test": 0.6439, "summ1": ["Climate got more time in the Democrats’ first 2020 debate than in all 2016 debates combined", "Climate Change is Devastating India With Heat Waves and Water Shortages", "Hey, Oregon Senators: You Can’t Run Away From Climate Change", "Trump Official Goes Rogue, Says Climate Change May Cause Next Financial Crisis"], "summ2": ["Britain to intensify fight against climate change", "Another Celebrity Apparently Comes Out As an Anti-Vaxxer", "Antarctica shock: Why Al Gore was left ‘surprised’ after scientists dug below ice", "Austrian police are accused of using excessive force at climate rally attended by Greta Thunberg"]}
{"comp": "L_LC", "month": "Sep", "feats": "sbert", "test": 0.6437, "summ1": ["The evil twins: Climate change and ocean acidification |...", "Daily Kos", "Climate Action Is Not Controversial—The Data Proves It", "Greta Thunberg's sassy reaction to Donald Trump mocking her"], "summ2": ["World must adapt to 'inevitable' climate change, warns report", "Tesla Model 3 Takes #1 Spot In Dutch Auto Market", "From Texas to Maine, in search of a kinder climate", "LGBT teaching row: Schools minister rejects 'silence' claim"]}
{"comp": "R_RC", "month": "Aug", "feats": "bow", "test": 0.6436, "summ1": ["Progressives in uproar over DNC vote against climate change debate for presidential candidates", "Elton John Defends Meghan Markle, Prince Harry Against Attacks Over Excessive Private Plane Travels", "Upheaval: AOC's chief of staff and top spokesman quit", "Univ. BANS BURGERS to ‘tackle climate change.' Where could it happen next?"], "summ2": ["World Record: Ethiopia Plants 35 Cr Trees In 12 Hrs To Tackle Climate Change; India Should Too!", "Environment groups warned saying climate is real could be seen as partisan", "Australia urged to hasten renewable uptake", "Canadian food supplies at risk if climate change not slowed, new UN report shows"]}
{"comp": "ER_R", "month": "Jul", "feats": "sbert", "test": 0.6402, "summ1": ["Prince Harry Says People ‘Don’t Understand’ Their ‘Unconscious’ Racism", "Kirsten Gillibrand Wants Ten Trillion of Your Dollars to Fight Climate Change Or Whatever", "Think Progress: If Trump Is Reelected, The Earth Is DOOMED!", "Ocasio-Cortez Tries To Blame Flooding On Climate Change, Gets Wrecked By REAL Meteorologist"], "summ2": ["Environment apocalypse: Shocking photos show how UK will look after climate change", "Extinction Rebellion climate change protestors have their day in court", "AOC’s chief of staff: We don’t think of the Green New Deal as a climate thing but as a “change the entire economy” thing", "Go ahead and print your emails, US forests have been growing for 50 years and a global forest regrowth is coming"]}
{"comp": "L_R", "month": "Jul", "feats": "sbert", "test": 0.6401, "summ1": ["Another Trump administration official resigns ‘in protest’ after the White House blocked his testimony: report", "Why We’re Challenging the 2020 Democrats to a Climate Summit", "Brazil's Jair Bolsonaro Takes Aim at Amazon Conservation Measures Amid Climate Change", "More than 185 million people are under watches and warnings as the heat wave begins to reach peak temperatures"], "summ2": ["Environment apocalypse: Shocking photos show how UK will look after climate change", "Johnny Ball booed by atheists over climate change denial", "AOC’s chief of staff: We don’t think of the Green New Deal as a climate thing but as a “change the entire economy” thing", "Ethiopia breaks World Record for planting a 350 million trees"]}
{"comp": "L_LC", "month": "Feb", "feats": "bow", "test": 0.6395, "summ1": ["Youth Climate Strike Coming to U.S. Next Month", "Donald Trump is walking into a ‘trap’ by threatening to declare a ‘national emergency’ to get his border wall", "Let’s Say I Wanted to Escape Climate Change. Where Should I Go?", "FOCUS: It's Climate Change That's Scary, Not the Green New Deal"], "summ2": ["Sea levels could rise by 1.3 meters on global warming: draft report", "World’s First Antarctic Expedition Powered Solely By Renewable Energy — Climate Solutions Follow", "Australian floods send dirty water across Great Barrier Reef", "Whitmer: Polar vortex has passed, but there's still work to do"]}
{"comp": "LC_R", "month": "May", "feats": "bow", "test": 0.6392, "summ1": ["First U.S. Patients Treated With CRISPR As Human Gene-Editing Trials Get Underway", "Energy industry needs national strategy that includes pipelines and carbon tax, report argues", "Rising heat scorches recovery efforts in cyclone-hit Indian state", "Elections 2019: Green wave sees tide go out for Varadkar and Sinn Féin"], "summ2": ["Climate-focused Democratic candidate Jay Inslee proposes $9T clean energy jobs and infrastructure plan", "After protests, Britain’s parliament declares climate change ’emergency’", "Poll: 67% of Democrats Believe the World Only Has 12 Years Left to Fight Climate Change", "'Very pleased' Donald Trump predicted Scott Morrison would win the Australian election"]}
{"comp": "L_R", "month": "Feb", "feats": "sbert", "test": 0.6368, "summ1": ["Alexandria Ocasio-Cortez Wants the Country to Think Big", "'Complete Wiping Away of Clean Water Act': Trump EPA Rule Would Free Corporations to Pollute Nation's Water as Much as They Please", "How Greed, Fear and Our Own Biases Blind Us to the Realities of Climate Change", "How the mega-rich are preparing for the apocalyse"], "summ2": ["Britain gears up for the hottest weekend of the year", "The Myth of Overpopulation Refuses to Die. The Truth is the Planet Has Too Few People", "AOC declined spot on new climate change committee", "Lords sleaze watchdog launches probe into Tory peer John Gummer"]}
{"comp": "R_RC", "month": "Mar", "feats": "bow", "test": 0.636, "summ1": ["AOC Declares Herself 'The Boss' Thanks To Climate Change. This Is Wrong, Stupid, And Dangerous.", "Federal judge bars drilling on public lands in Wyoming over 'climate change'", "Greenpeace co-founder clarifies: Climate crisis is ‘fake news and fake science’", "O'Rourke: Global Warming Activists Are Just Like D-Day Soldiers"], "summ2": ["Alienated: Alberta project seeks to find common language on climate change", "Climate Strike Live: School students protest climate change inaction news Australia", "The War Between Trump and the Intelligence Community Poses National Security Risks", "'We are in deep trouble': Greenhouse gas emissions reached record high in 2018, speeding Earth towards catastrophe"]}
{"comp": "C_RC", "month": "Apr", "feats": "bow", "test": 0.6358, "summ1": ["How young people are shaping the future of sustainable fashion", "South Korea steps up shift to cleaner energy, sets long-term renewable power targets", "U.S. aid helped Guatemalan farmers stay rooted to their lands", "UPDATE 2-Extinction Rebellion to end London blockades on Thursday"], "summ2": ["Climate change will bring heat, rain, pests to Saskatoon: report", "London climate-change street protest arrests reach 290 on second day", "Chris Selley: Preston Manning has answer to carbon problem, but clout with conservatives seems in decline", "Canada's failure to fight climate change 'disturbing,' environment watchdog says"]}
{"comp": "L_R", "month": "Jul", "feats": "bow", "test": 0.6354, "summ1": ["Hellish Heat Grips Half The Country", "11% of CNN moderators' questions were about climate crisis at first Detroit debate night", "Climate change, oil profits and the new youth movement", "New study says we have to stop building CO2 emitting infrastructure right now"], "summ2": ["AOC's chief of staff comments just killed the Green New Deal", "World will start COOLING DOWN in 2017, claims one of planet's top climate change experts", "6.9 Magnitude Earthquake Hits Near Indonesia; Tsunami Warning Issued", "Bristol man unable to see his father before he died because Extinction Rebellion protest traffic"]}
{"comp": "L_LC", "month": "Mar", "feats": "sbert", "test": 0.6351, "summ1": ["Trump administration concedes coal is collapsing on its watch as renewables soar", "Climate Change Is Too Serious for Political Labels", "Fox guest says man-made climate change is a hoax and calls Rep. Alexandria Ocasio-Cortez \"shrill\" for talking about it", "Remington Can Be Sued Over Marketing of Rifle Used in Sandy Hook Massacre"], "summ2": ["It's 2050 And This Is How We Stopped Climate Change", "NI council urges end to fossil fuel investments", "Climate change is creating toxic crops and poisoning some of world’s poorest people, scientists warn", "Metro Vancouver hit with another blast of snow"]}
{"comp": "C_R", "month": "Jul", "feats": "bow", "test": 0.6348, "summ1": ["Climate change probably added 4C to Europe's June heatwave: study", "U.S. House climate crisis committee will hold first field hearing in Boulder", "As India Revises State Climate Plans, Who Should Have a Voice?", "Best way to fight climate change? Plant a trillion trees"], "summ2": ["AOC's Green New Deal would boost gas tax $10-$13, 'destroy economy'", "Deadly heatwave to leave DC as hot as DEATH VALLEY this weekend", "Bipartisan Panel Admits Humans Not Responsible for Global Warming", "Bristol man unable to see his father before he died because Extinction Rebellion protest traffic"]}
{"comp": "ER_R", "month": "May", "feats": "sbert", "test": 0.6339, "summ1": ["Pelosi’s Brother-In-Law’s Company Received $737,000,000 From Obama’s Energy Department As “Loan Guarantee”", "‘Global Warming’ Not Scary Enough, Alarmists Rebrand ‘Climate Crisis’", "UN Report: Humans Killing Planet, Globalism the Fix", "How Children Influence Their Parents’ Political Beliefs"], "summ2": ["Australian prime minister Scott Morrison holds on to power in 'miracle' victory for conservatives", "'Climate Catastrophe' Chris Packham Cashing in on Carbon-Belching Luxury Wildlife Tours -", "The Science of Climate Change: Are you a Denier?", "Beto blames climate change for the crisis at the Mexican border"]}
{"comp": "L_LC", "month": "Mar", "feats": "bow", "test": 0.6336, "summ1": ["Best way to cut Arctic \"black carbon\"? Stop burning fossil fuels", "'We Will Have to Mobilize Our Entire Economy': Watch Ocasio-Cortez's Urgent Call for Green New Deal", "Hundreds of Thousands of Students Prepare for Global #ClimateStrike: Here Are 5 Ways You Can Help", "How Democrats can steal the spotlight from Trump"], "summ2": ["Cyclone Idai: Mozambique president says 1,000 may have died", "Climate change adversely affecting Virginians’ health, study says", "As Sea Levels Rise, De Blasio Unveils $10 Billion Plan To Expand Lower Manhattan", "'It Will Be Too Late for My Generation.' Meet the Young People Organizing a Massive Climate Change Protest"]}
{"comp": "C_L", "month": "May", "feats": "bow", "test": 0.6316, "summ1": ["The poorest in Guatemala bear brunt of climate change, research says", "Exxon Presents Its Very Own Solution To Climate Change", "Australians go to polls as government tries to hold off strong Labor challenge", "Seven years on, radioactive water at Fukushima plant still flowing into ocean, study finds"], "summ2": ["Biden tells voters when Trump's gone, Republicans will have an 'epiphany,' will work with Democrats", "Why Do We Call It the Climate Crisis?", "Fox News Is Desperately Trying to Convince Us Climate Science Isn’t Real", "Why mining justice must be central to the Green New Deal"]}
{"comp": "ER_L", "month": "May", "feats": "bow", "test": 0.6315, "summ1": ["Pelosi’s Brother-In-Law’s Company Received $737,000,000 From Obama’s Energy Department As “Loan Guarantee”", "Ocasio-Cortez: Climate Change Will Destroy Earth Claim Not 'Literal'", "IMAGINE THAT! Top Vatican Cardinal Urges “Intervention” Against Climate Change", "Pinkerton: Immigration Curbs Key to Conservative Victory in Australia and a Lesson for Trump"], "summ2": ["Trump Admin Orders End to Long-Term Climate Change Studies", "The other alarming facts from the new UN species extinction report", "Cues from the Midwest Floods: Is Your Community Prepared?", "‘Mysterious’ nuclear institute opens to public"]}
{"comp": "L_R", "month": "Mar", "feats": "sbert", "test": 0.6303, "summ1": ["Trump administration concedes coal is collapsing on its watch as renewables soar", "Climate Change Is Too Serious for Political Labels", "Devastating Floods Are Breaking Records in Nebraska", "Remington Can Be Sued Over Marketing of Rifle Used in Sandy Hook Massacre"], "summ2": ["Why does Jane Philpott keep knifing her fellow Liberals?", "Climate Change Cheaper Than Half Baked Ideas to Fix It", "Greenpeace co-founder clarifies: Climate crisis is ‘fake news and fake science’", "Cyclone Idai 'possibly the worst weather disaster to hit the southern hemisphere', UN declares"]}
{"comp": "L_R", "month": "Feb", "feats": "bow", "test": 0.6299, "summ1": ["Climate Change Is Scary—Not the Green New Deal", "Donald Trump is walking into a ‘trap’ by threatening to declare a ‘national emergency’ to get his border wall", "Let’s Say I Wanted to Escape Climate Change. Where Should I Go?", "Last 5 Years Hottest on Record: NASA, NOAA; & World Hotter than any time in 120,000 years"], "summ2": ["House committee leaders want answers on proposed climate change panel", "Ocasio-Cortez says maybe people should stop having kids because of climate change", "Top 2020 Democrats co-sponsor Ocasio-Cortez’s bonkers Green New Deal plan", "Scientist who popularized term 'global warming' dies at 87"]}
{"comp": "ER_R", "month": "Jul", "feats": "bow", "test": 0.6295, "summ1": ["Rep. Raskin: Border Crisis Fueled in Part by 'Climate Change Refugees'", "Kirsten Gillibrand's Deceptive $10 Trillion Climate Change Plan", "Alexandria Ocasio-Cortez Chief of Staff Admits: Green New Deal About Socialism, Not Climate", "Miley Cyrus Won’t Reproduce Until She’s Confident Her Kid Can ‘Live on an Earth with Fish’"], "summ2": ["Ex-Fox News reporter Carl Cameron and a climate change activist take on Drudge", "Deadly heatwave to leave DC as hot as DEATH VALLEY this weekend", "Humans could evolve webbed feet if sea levels rise, scientist claims", "AOC’s chief of staff: We don’t think of the Green New Deal as a climate thing but as a “change the entire economy” thing"]}
{"comp": "L_LC", "month": "Jul", "feats": "bow", "test": 0.629, "summ1": ["Hellish Heat Grips Half The Country", "Hurricane Expected to Hit Louisiana This Weekend, and New Orleans Is Already Flooding", "At the Democratic Debate, Pete Buttigieg Addresses the Age Issue", "Our Public Lands Must be Part of the Climate Change Solution"], "summ2": ["Electric cars could form battery hubs to store renewable energy", "Climate change probably added 4C to Europe's June heatwave - study", "Yorkshire Dales flash flooding: Roads shut and bridge collapses", "How to fight climate change? Plant many trees"]}
{"comp": "L_R", "month": "Jun", "feats": "bow", "test": 0.6287, "summ1": ["Oregon Statehouse Shut Down After Lawmakers Team Up With Right-Wing Militias", "Maybe the climate won’t change if no one studies it", "Climate Crisis Only Gets 7 Minutes of Airtime at First Dem Debate", "8 Creative Ways Cities Are Combating Rising Temperatures"], "summ2": ["Heathrow Airport: Will flights be affected by Extinction Rebellion protests this summer?", "Did The DNC Reject A Climate Change Debate To ‘Protect’ Joe Biden?", "EU boss Jean Claude Juncker moans that he doesn't have an Air Force One-style private jet", "GOLDSTEIN: Economic benefits of carbon taxes overstated, says Fraser report"]}
{"comp": "LC_R", "month": "Jul", "feats": "bow", "test": 0.6278, "summ1": ["Want to Fight Climate Change? Plant 1 Trillion Trees.", "With An Eye Toward Lower Emissions, Clean Air Travel Gets Off The Ground", "Rare Rhinos Among More Than 200 Animals Killed In Assam Floods", "Paris Could Hit 108 Degrees Thursday as Record-Breaking Heat Wave Scorches Europe"], "summ2": ["David Attenborough blasts 'powerful' Australian politicians over climate change inaction", "Ocasio-Cortez Gets Smacked By Meteorologist Over ‘Climate Crisis’ Claims", "Bristol man unable to see his father before he died because Extinction Rebellion protest traffic", "BBC Says We Only Have 18 Months to Save the Planet from Climate Change"]}
{"comp": "L_RC", "month": "Jun", "feats": "bow", "test": 0.6277, "summ1": ["Week 122: Trump’s Power Plant Rule Could Kill Thousands. He’s Hoping You Won’t Notice.", "Why Bernie Sanders Loves the Most Conservative Man in the Senate", "Florida faces a climate crisis as Democratic candidates take the debate stage", "Noam Chomsky: No Change in US 'Mafia Principle'"], "summ2": ["CEOs Lobbied Congress for a National Carbon Tax. We Listened", "'I totally listened to him': Prince Charles spent 90 minutes trying to convince Trump that climate change is bad", "Study says warming may reduce sea life by 17%", "Minister: 20 districts facing severe water crisis"]}
{"comp": "LC_RC", "month": "Jul", "feats": "bow", "test": 0.6269, "summ1": ["Climate change: UK government 'like Dad's Army'", "The Best Trees To Plant For Global Warming Have Three Blades & Generate Electricity", "Rare Rhinos Among More Than 200 Animals Killed In Assam Floods", "Paris Could Hit 108 Degrees Thursday as Record-Breaking Heat Wave Scorches Europe"], "summ2": ["Trade, tariff issues potential stumbling blocks to growth of India-US partnership: CRS", "Singapore will spend $400m upgrading drains, $10m on studying sea level rise to counter climate change", "Younger voters mobilizing to make federal election about climate change", "David Attenborough says powerful Australians are climate change sceptics"]}
{"comp": "C_L", "month": "Jul", "feats": "bow", "test": 0.6266, "summ1": ["Climate change probably added 4C to Europe's June heatwave: study", "Barry Soper: Green cars - why the Government's plan to clean up vehicle fleet is a no-brainer", "Ethiopia plants more than 200 million trees in 1 day", "Coal is here to stay, says new global chief"], "summ2": ["Hellish Heat Grips Half The Country", "At the Democratic Debate, Pete Buttigieg Addresses the Age Issue", "How the Climate Crisis Is Pushing Central Americans Out of Their Homes Toward the U.S.", "Anchorage Hits 90 Degrees for First Time in Recorded History"]}
{"comp": "L_R", "month": "Mar", "feats": "bow", "test": 0.6261, "summ1": ["Republican Senator Mike Lee: Having Babies the Only Solution to Climate Change", "As Hundreds of Thousands of Students Prepare for Global #ClimateStrike on March 15, Here's How to Get Involved", "Are the Fossil Fuel Industry’s Days Numbered?", "Satellite images show Nebraska and Iowa rivers swallowing towns"], "summ2": ["Group of environmental activists pledge not to have any children because of climate change", "Our Planet Is Not Fragile", "Barack Obama sat on stage and just told the biggest lie of his life", "'I'M NOT OWNED!': Ocasio-Cortez Gets Mocked After Her Green New Deal Fails In Senate Vote"]}
{"comp": "L_LC", "month": "Apr", "feats": "bow", "test": 0.6253, "summ1": ["‘Meet the Press’ Won't Give Air Time to Climate Change Deniers", "Trump’s climate policies are so bad even Putin is trolling him", "Climate Activist Xiuhtezcatl Martinez: This Earth Day, I Believe Bernie Sanders Has Our Back on Climate Change", "Alexandria Ocasio-Cortez town hall resets the Green New Deal debate"], "summ2": ["Help small island states win their battle against climate change", "Britain breaks coal-free power record over Easter weekend", "Federal climate change report 'a strong warning,' Alberta scientist says", "London climate-change street protest arrests reach 290 on second day"]}
{"comp": "LC_RC", "month": "Apr", "feats": "bow", "test": 0.6241, "summ1": ["Solving problems through social enterprise", "Trump administration hits pause on offshore oil plans after court ruling", "Britain breaks coal-free power record over Easter weekend", "Climate change impacts accelerating, report warns"], "summ2": ["Andrew Coyne: What the Conservative carbon tax obsession will cost us", "London climate-change street protest arrests reach 290 on second day", "Report on climate change shows Canada warming at twice the rate of rest of world", "Ottawa and seven other Ontario municipalities have declared states of emergency: what does that mean?"]}
{"comp": "ER_L", "month": "Jan", "feats": "bow", "test": 0.6229, "summ1": ["Record Cold Forces Rethink on Global Warming", "Democrat Socialist Alexandria Ocasio-Cortez gives world 12-year expiration date ‘if we don’t address climate change’ ⋆ Conservative Firing Line", "Sarah Sanders Slams Ocasio-Cortez’s Climate Change Prediction", "John Kerry Blasts The President On Climate Change"], "summ2": ["More coal plants shut down in Trump’s first two years than in Obama’s entire first term", "Return of Supersonic Planes Would Be a Dirty, Noisy Climate Disaster", "Climate Scientist who put 'Polar Vortex' into the Vernacular explains her Findings in plain English", "A New Call to National Climate Action"]}
{"comp": "LC_R", "month": "Jun", "feats": "bow", "test": 0.6214, "summ1": ["One of India's biggest cities has almost run out of water", "Like It or Not, World Government May Be Inevitable", "Coal comeback? Trump plan breathes new life into aging power plants, but critics say climate will suffer", "120 degrees in the shade?! Record-breaking, 'dangerous' heat wave bakes western U.S."], "summ2": ["The Left’s Green Giant: Litigating Climate Change", "Joe Biden practices leading from behind as he bends to AOC’s climate pressure", "BONOKOSKI: Who is Andrew Scheer today — Harper, Ford, Kenney or all three?", "2020 candidate says Trump's climate change skepticism is 'treasonous'"]}
{"comp": "LC_RC", "month": "Apr", "feats": "sbert", "test": 0.621, "summ1": ["What Spy-Satellite Companies Can Teach NASA About Climate Change", "Climate change being fuelled by soil damage - report", "Sex ed, the environment and affordable housing: Colorado General Assembly has 5 days to go and a lot left to do", "Cyclone Kenneth: The international community must step up to help Mozambique in its hour of need"], "summ2": ["Jacob Rees-Mogg Goes Head-To-Head With Extinction Rebellion Spokesperson", "Allison Hanes: Should we put a price on congestion in Montreal?", "Inland drought evidence of a growing problem", "Canada failing in climate change fight: Watchdog"]}
{"comp": "ER_L", "month": "Jan", "feats": "sbert", "test": 0.621, "summ1": ["Climate Change: The Poetry of Dreams and the Prose of Reality", "Delingpole: Britain's Loony Greens Demand Tax on Meat", "JUST IN: Elitist John Kerry Just Told an International Audience That President Trump Should Resign #JohnKerry", "Record Cold Forces Rethink on Global Warming"], "summ2": ["Scientists Melt a Mile-Deep Hole in Antarctica to Study Climate Change", "Climate Action in NY: 2019 Could Be Even Bigger than 2018", "\"It’s infuriating”: Trump-supporting parents turn on the president over lax EPA rules", "Colorado could save $2.5 billion by rapidly shutting down its coal power plants"]}
{"comp": "C_R", "month": "Apr", "feats": "bow", "test": 0.621, "summ1": ["Drones, supercomputers and sonar deployed against floods", "Hydrogen’s Role In The Energy System Of The Future", "UPDATE 4-Climate-change protesters disrupt London docklands train service", "‘Karachi may face dust storms, cyclones, smog in coming years’"], "summ2": ["London protests: How long will Extinction Rebellion climate change protest last?", "Beto O’Rourke wants to spend $5 trillion in taxpayer money fighting climate change", "Netflix Walruses 'fell to deaths because they were being chased by polar bears' NOT climate change", "AOC's linkage of climate change and border situation 'ridiculous,' Crenshaw says"]}
{"comp": "L_LC", "month": "Jun", "feats": "bow", "test": 0.6196, "summ1": ["'This Is What Fascists Do': Trump Attempted to Suppress State Dept Analyst's Testimony on Climate Crisis", "Oregon Republicans are in hiding to avoid voting on a climate bill. They might succeed.", "The Paradox of Global Warming and Colder Winters", "Sanders Says US Leaders Need to Have the Guts to Take on Powerful Corporations"], "summ2": ["One of India's biggest cities has almost run out of water", "Forget the 'Polar Vortex.' Here comes the 'Death Ridge' and record heat for the Southeast", "Welsh Government scraps M4 relief road", "Coal comeback? Trump plan breathes new life into aging power plants, but critics say climate will suffer"]}
{"comp": "C_RC", "month": "Apr", "feats": "sbert", "test": 0.6189, "summ1": ["After Cyclone Idai, thousands still cut off, many more in need: aid agencies", "One of the Largest Native American Tribes Has Just Voted to End Their 100-Year Dependency on Coal", "Primary cause of global warming is force of gravity", "Can capitalism beat climate change?"], "summ2": ["Canada failing in climate change fight: Watchdog", "Easter weekend traffic chaos feared as climate change protesters target Dublin", "Harmful effects of CO2 emissions, fracking can’t be denied", "Six businesses win funds to address coastal flooding"]}
{"comp": "LC_R", "month": "Aug", "feats": "bow", "test": 0.6187, "summ1": ["The Wrong Amazon is Burning", "July 2019 Was the Earth's Hottest Month on Record", "22 states sue the Trump administration over its climate ‘plan’", "EXPERT VIEWS-U.N. climate and land report flags need for 'new and healthy balance'"], "summ2": ["Prince Harry 'gives barefoot speech' at Google Camp in Italy", "Barack Obama made one mistake that just doomed the Democrat Party to defeat", "‘It’s all such a scam’: Guess how teen climate activist Greta Thunberg’s ‘zero-carbon’ yacht is getting back to Europe", "The Green New Deal: Less About Climate, More About Control"]}
{"comp": "LC_RC", "month": "May", "feats": "sbert", "test": 0.6182, "summ1": ["Climate change being fuelled by soil damage", "No longer prized Liberal territory, Julia Banks and Labor eye Flinders", "UK Declares “Climate Emergency” As Committee On Climate Change Urges Net-Zero", "America just had its wettest 12-month period on record"], "summ2": ["Next government urged to focus on climate", "Somerville pushes measure to let 16-year-olds vote", "Kenney’s stand on oil and gas divestment is likely to leave Alberta out of position", "Floating hospitals to the rescue in climate change hit Bangladesh"]}
{"comp": "L_RC", "month": "Jan", "feats": "bow", "test": 0.6181, "summ1": ["Rhode Island Sues Oil Companies Over Climate Change", "Trump Once Again Confuses Weather and Climate in Response to Deadly Winter Storm", "Climate Scientist who put 'Polar Vortex' into the Vernacular explains her Findings in plain English", "A New Call to National Climate Action"], "summ2": ["5 Renewable Energy TED Talks To Start Your 2019", "Australia weather heatwave to bake states and territories", "Carbon tax set to increase to $30 per tonne in 2018; no further increases until 2021", "Davos WEF report reveals concerns of the rich and powerful"]}
{"comp": "L_R", "month": "Jan", "feats": "bow", "test": 0.6177, "summ1": ["Trump Once Again Confuses Weather and Climate in Response to Deadly Winter Storm", "DiCaprio-Funded Study: Staying Below 1.5ºC is Totally Possible", "People Power: 160,000 European Protesters Demand Action On Climate Crisis", "Democratic Leaders Failed Their First Big Test On Climate"], "summ2": ["NBC's Todd Boasts of Banning Climate Skeptics: 'Didn't Invite Moon Landing Deniers, Flat Earthers, Either'", "Deranged Dems: Ocasio-Cortez is predicting the “end of the world”", "Bernie Sanders Claims Climate Change Like a ‘Military Attack,’ Twitter Explodes", "NOT CLIMATE CHANGE! Pacific Gas and Electric's to Blame for Cali Fires"]}
{"comp": "C_L", "month": "Mar", "feats": "bow", "test": 0.6168, "summ1": ["Labor commits to build fast train from Melbourne to Brisbane", "Climate protests: First students, now adults march", "Trump climate deregulation could boost CO2 emissions by 200 million tonnes a year: study", "Poll: Americans should make economic sacrifices to help environment"], "summ2": ["As Hundreds of Thousands of Students Prepare for Global #ClimateStrike on March 15, Here's How to Get Involved", "Advisers Worry Trump May ‘Overreach’ on Mueller Victory Lap", "2018 was a year of alarming climate reports, but you wouldn’t know it watching TV news – ThinkProgress", "'Watch Every Second of This': Ocasio-Cortez Makes Powerful Case for Green New Deal Amid GOP Stunts"]}
{"comp": "C_L", "month": "Apr", "feats": "bow", "test": 0.6167, "summ1": ["Climate-change protesters say they will target London's Heathrow Airport", "Hydrogen’s Role In The Energy System Of The Future", "Africa: As Sea Levels Rise, UN Climbs Aboard Floating-Cities Push", "Carbon tax will deplete millions from Ontario hospitals: Ford government"], "summ2": ["Maine Mayor Samantha Paradis is Ready for More Young Leaders to Fight Climate Change", "Climate Activist Xiuhtezcatl Martinez: This Earth Day, I Believe Bernie Sanders Has Our Back on Climate Change", "Trump’s climate policies are so bad even Putin is trolling him", "Alexandria Ocasio-Cortez town hall resets the Green New Deal debate"]}
{"comp": "ER_R", "month": "Feb", "feats": "sbert", "test": 0.6148, "summ1": ["Unhinged Marxist Ocasio-Cortez blasts tech giants, demands absolute censorship of climate skeptics", "Harrison Ford Issues Apocalyptic Climate Change Warning: 'Greatest Moral Crisis of Our Time'", "THAT WAS QUICK: Anti-Israel Rep. Ilhan Omar Wants to Defund the Department of Homeland Security", "Delingpole: All of Recent U.S. Warming Has Been Faked by NOAA"], "summ2": ["Britain gears up for the hottest weekend of the year", "The Myth of Overpopulation Refuses to Die. The Truth is the Planet Has Too Few People", "AOC declined spot on new climate change committee", "Lords sleaze watchdog launches probe into Tory peer John Gummer"]}
{"comp": "C_RC", "month": "May", "feats": "bow", "test": 0.6142, "summ1": ["In coal we trust: Australia's voters back PM Morrison's faith in fossil fuel", "Tepco tests halting water injection into crippled reactor at Fukushima No. 1 nuclear power plant", "How to fix Nature and avoid human misery: UN report", "New York City passes a green new deal, requiring 'green roofs' on new buildings"], "summ2": ["Nearly two-thirds of Canadians oppose provincial governments spending taxpayers’ dollars to battle federal carbon tax, poll says", "'You idiots ... The planet's on f--ing fire!' Bill Nye's message to leaders stalling on climate change", "West Bengal: 6,000 voters here have proof of residence, but homes lost to the sea", "Trudeau's action plan on climate change brings B.C. politician out of retirement"]}
{"comp": "L_LC", "month": "May", "feats": "bow", "test": 0.6137, "summ1": ["150 Congressional Republicans Represent Fossil Fuel Companies Instead of Their Communities", "Green New Dealers Find A New Villain In Joe Biden’s Climate ‘Middle Ground’", "Trump climate adviser compares Jews to carbon dioxide, as Pompeo looks for Lebensraum in the Arctic", "Fox News Is Desperately Trying to Convince Us Climate Science Isn’t Real"], "summ2": ["Climate change: UK flood planners 'must prepare for worst'", "Whatever these elections are about it’s not climate change", "Federal government gives $8M in latest investment in Calgary-based MEG Energy", "'We know what it was like': Slave Lake residents offer help, open homes to people fleeing wildfire"]}
{"comp": "LC_RC", "month": "May", "feats": "bow", "test": 0.6123, "summ1": ["As a newly-elected Green MEP, I'm excited to start working on our own version of the Green New Deal", "First U.S. Patients Treated With CRISPR As Human Gene-Editing Trials Get Underway", "Climate change forcing Alaskans to hunt for new ways to survive", "Energy industry needs national strategy that includes pipelines and carbon tax, report argues"], "summ2": ["Warmer summer expected in the West spells bad news for forest fires", "Climate inaction: School kids storm political offices to fight for environment", "Federal election 2019: Bill Shorten’s climate change policy could cost $264 billion", "Nature in unprecedented decline around the globe, landmark assessment says"]}
{"comp": "L_LC", "month": "Sep", "feats": "bow", "test": 0.6105, "summ1": ["It’s Time for World Governments and Scientists To Tell Us The Truth About Climate Change", "Scientists Say Climate Change Will Bring More Storms Like Hurricane Dorian", "Trump administration takes war on climate crisis action to new level", "Climate activist Greta Thunberg used her superpower of shaming adults on Senate Democrats"], "summ2": ["The country's top bureaucrats say Government appears unprepared for climate change", "Kamala Harris lays out $10 trillion plan to fight climate change, says she’d ban plastic straws", "How climate change affects children's health", "How warm oceans supercharge deadly hurricanes"]}
{"comp": "L_LC", "month": "Aug", "feats": "bow", "test": 0.6096, "summ1": ["Sanders Unveils Green New Deal Plan to Avoid Climate Catastrophe, Create 20 Million Jobs", "What You Should Know About The Fires Raging In The Amazon", "Trump officials angry about G7 focus on ‘niche issues’ like climate change and gender equality", "The Climate Crisis Is 'a Perfect Storm' Headed for the World's Food Supply"], "summ2": ["No Drips, No Drops: A City Of 10 Million Is Running Out Of Water", "July 2019 Was the Earth's Hottest Month on Record", "EXPERT VIEWS-U.N. climate and land report flags need for 'new and healthy balance'", "Tesla solar panels reportedly caught fire at an Amazon warehouse in 2018"]}
{"comp": "R_RC", "month": "Jun", "feats": "bow", "test": 0.6095, "summ1": ["Jay Inslee ‘Deeply’ Disappointed’ The DNC Won’t Host Climate Change Presidential Debate", "Piers Morgan gets the only interview with Trump while he's in the UK", "LILLEY: Conservatives think locally and act globally with climate plan", "Green New Deal Architect: Climate Change is 25 Holocausts"], "summ2": ["Authorities pour water on road to prevent melting as heat climbs to 50C in India", "Oregon truckers make themselves heard against climate bill in Salem", "Reaching One Billion People in Ten Years: We Have to Try", "Climate change: Young Quebecers present arguments seeking class action against Ottawa"]}
{"comp": "C_RC", "month": "Jun", "feats": "sbert", "test": 0.6078, "summ1": ["Letter: The link between immigration and climate change", "Emissions need to be halved to avoid 3C warming: scientists", "Report: Florida will have to spend $76 billion to prepare for sea level rise", "Coal Industry's Survival in Question as Companies Go Green"], "summ2": ["Land O’Lakes CEO: Farmers Are in Crisis—and America Isn’t Paying Attention", "Heatwave claims 108 lives in Bihar, CM Nitish Kumar visits patients in Gaya hospital", "Live: Reaction to approval of Trans Mountain pipeline expansion", "World Environment Day: How to defeat climate change"]}
{"comp": "LC_RC", "month": "Sep", "feats": "sbert", "test": 0.6073, "summ1": ["Greta Thunberg and Fridays for Future receive Amnesty International’s top honour", "Could Hurricane Dorian become Category 6? No. Here's why.", "Santa Rosa and other cities consider natural gas bans as way spur transition to all-electric homes", "Report: Climate Change Is Hurting Oceans — And Us — More Than…"], "summ2": ["un: We demand a safe and green future: Say students across the globe", "India not doing enough to combat climate change: Dia", "Rising oceans and melting ice caps pose dire threats unless emissions are cut: UN IPCC report", "NP View: How Trudeau's Liberals went from vowing transparency to gagging people"]}
{"comp": "C_L", "month": "Jun", "feats": "bow", "test": 0.6064, "summ1": ["How did Australians become so rich and unhappy?", "Biden unveils $1.7 trillion climate plan to end U.S. carbon emissions by 2050", "Forest fires rage in Spain as Europe swelters under 44 degrees", "Mexico puts US to shame on climate action, but new president’s pledge on oil industry is worrying"], "summ2": ["Oregon Climate Bill Dies After Rogue GOP Lawmakers Flee Capitol with Support of Right-Wing Militias", "Why Bernie Sanders Loves the Most Conservative Man in the Senate", "Florida faces a climate crisis as Democratic candidates take the debate stage", "President Donald Trump state visit: giant penis mowed in protest"]}
{"comp": "L_R", "month": "May", "feats": "bow", "test": 0.6057, "summ1": ["Trump Admin Orders End to Long-Term Climate Change Studies", "Pompeo Cheers 'Opportunity' in Arctic From Climate Change as America Blocks Resolution Language", "European Elections: Leaders Need to Listen to Youth Like Us on the Climate Crisis", "The other alarming facts from the new UN species extinction report"], "summ2": ["Teenage Climate-Change Protestors Have No Idea What They’re Protesting", "'Give us climate change on TV': BAFTA bosses call for green issues to be mentioned more in TV shows", "GOLDSTEIN: No, the world won't end in 12 years", "Political climate change: Australian leaders make last pitch to voters"]}
{"comp": "LC_RC", "month": "Jun", "feats": "sbert", "test": 0.605, "summ1": ["Climate change will be a decisive issue in 2020", "Europe’s youth want climate action. Elected leaders should give it to them", "Yorkshire village faces petrochemical giant in anti-fracking fight", "According to NYT, ‘Relentless Flooding’ in Midwest Just Happens"], "summ2": ["Damon Gameau: 2040 filmmaker on climate change negativity", "'Alarm bells:' It's spring, but B.C. already sounding drought warnings", "The Pentagon emits a staggering level of greenhouse gases, study finds", "Combating climate change needs to be a consolidated effort: Amy Khor"]}
{"comp": "C_L", "month": "Aug", "feats": "bow", "test": 0.6044, "summ1": ["Where BHP goes on climate change, will others follow?: Russell", "Climate change will make food scarce, expensive, and low in nutritional value, report says", "Brazil’s Amazon rainforest is burning at a record rate", "GOP Florida Governor enlists new officer to prepare state for rising sea level"], "summ2": ["'Choosing a Plant-Based Diet' Can Help Save Earth — But There's Not Much Time Left, Experts Warn", "David Koch, billionaire businessman and influential GOP donor, dies", "Democratic National Committee Rejects Possibility of Official Climate Debate", "As White House dismisses planetary emergency as ‘niche’ issue, Trump skips G7 climate meeting"]}
{"comp": "C_LC", "month": "Sep", "feats": "sbert", "test": 0.6043, "summ1": ["These are the world’s most tree-covered countries", "Hurricane Dorian: Cat 4 storm creeps over Bahamas with 155 mph winds", "Climate change takes toll on oceans, ice: UN report", "'This isn't welfare': Morrison pledges $100m in drought aid"], "summ2": ["The key difference between nationalism in the US and Australia", "Melbourne's Upper Stony Creek project left in ruin — with residents to suffer", "Report: Climate Change Is Hurting Oceans — And Us — More Than…", "Critical Mass riders bike past U.N. to support Greta Thunberg - The Villager"]}
{"comp": "C_RC", "month": "Mar", "feats": "sbert", "test": 0.6026, "summ1": ["Trump climate deregulation could boost CO2 emissions by 200 mln tonnes a year -study", "Cyclone Idai and the New Reality of Climate Change in Africa", "Fingal County Council giving away free trees", "Republicans defeat Green New Deal in U.S. Senate vote Democrats call a stunt"], "summ2": ["I am terrified of ‘children’s crusader’ Greta Thunberg – and you should be too", "B.C. brings in tax credit to help spur liquefied natural-gas investment", "US News: Entire communities cut off amid Midwest floods", "Parliament: Big push to grow Singapore's food and water resources to ensure survival in the face of climate change"]}
{"comp": "C_RC", "month": "Jul", "feats": "sbert", "test": 0.6016, "summ1": ["How big data can help us fight climate change faster", "Ethanol vs. environment: Democratic hopefuls campaign on clashing agendas", "Greece: Emergency declared after deadly storm hits resorts", "Warming climate likely leading to larger California fires"], "summ2": ["Globe editorial: Andrew Scheer just gutted his own climate-change plan", "'Urgent action' needed as we are set to fall short of climate change targets", "Navy rescues 700 people on flooded Mumbai", "20 Images Of Freak Weather Phenomena Show Climate Change Is The Biggest Threat To Mankind"]}
{"comp": "C_LC", "month": "Apr", "feats": "sbert", "test": 0.6011, "summ1": ["After Cyclone Idai, thousands still cut off, many more in need: aid agencies", "One of the Largest Native American Tribes Has Just Voted to End Their 100-Year Dependency on Coal", "Primary cause of global warming is force of gravity", "Can capitalism beat climate change?"], "summ2": ["Environmentalists hope for action in wake of 'shocking and utterly unsurprising' climate-change report", "Regenerative agriculture: how it works on the ground", "Extinction Rebellion: Climate protests 'diverting' London police", "Governor Weld's Example on Abortion"]}
{"comp": "LC_RC", "month": "Jul", "feats": "sbert", "test": 0.6, "summ1": ["Eskilstuna: how a Swedish town became the world capital of recycling", "World will not meet 2C warming target, climate change experts agree", "PG&E Wildfire Policies Provide Opportunities For Tesla, Sunrun, And Others", "Hurricane Barry Live Updates: Storm Is Upgraded to a Hurricane"], "summ2": ["David Staples: What the alarmists won't admit, Canada already a world leader in combating climate change", "'Urgent action' needed as we are set to fall short of climate change targets", "Navy rescues 700 people on flooded Mumbai", "Health experts denounce Scheer’s comments on Canada’s Food Guide as ‘irresponsible’ and ‘disingenuous’"]}
{"comp": "C_RC", "month": "Jul", "feats": "bow", "test": 0.5992, "summ1": ["Climate change probably added 4C to Europe's June heatwave: study", "U.S. House climate crisis committee will hold first field hearing in Boulder", "Ethiopia May Have Just Shattered World Record By Planting 350 Million Tree Saplings in One Day", "Trump's not-so-secret war on state environmental protection"], "summ2": ["Younger voters mobilizing to make federal election about climate change", "Government must focus on health and social benefits to encourage climate action, says London academic", "Housing complex sets example in water recycling", "Crowd of UFO fans seeking to ‘raid Area 51’ hits 1 MILLION despite US Air Force warning"]}
{"comp": "C_LC", "month": "Jul", "feats": "sbert", "test": 0.5952, "summ1": ["Climate change could bring woe to Michigan’s lakes, farms, forests", "How BHP's climate stance caught its fellow miners on the hop", "June 2019 was the hottest on record across the globe - NOAA", "The climate change lobby needs a business strategy"], "summ2": ["Eskilstuna: how a Swedish town became the world capital of recycling", "World will not meet 2C warming target, climate change experts agree", "PG&E Wildfire Policies Provide Opportunities For Tesla, Sunrun, And Others", "Hurricane Barry Live Updates: Storm Is Upgraded to a Hurricane"]}
{"comp": "ER_R", "month": "May", "feats": "bow", "test": 0.5948, "summ1": ["Climate change scare stories reach the point of psychological TERRORISM… while scientists blame the fear on the “climate crisis”", "Newsweek Claims Global Warming Will Cause People to be Eaten by Tigers… No, They Are Serious", "Former Obama Officials Form Anti-Trump National Security Think Tank Called “NSA”", "MSNBC Celebrates Kids Skipping School For Climate Change"], "summ2": ["National Weather Service issues tornado watch for more than 24 million people", "'I'll Be Damned': Ocasio-Cortez Blasts Biden's 'Middle Of The Road' Plans", "Corbyn's Filthy Climate Record -", "Around the world, backlash against expensive climate change policies"]}
{"comp": "C_LC", "month": "Jul", "feats": "bow", "test": 0.5939, "summ1": ["Hot weather could force EDF to halt output at Golfech nuclear plant", "YES: Activists should organize boycotts of China's polluting industries", "Climate Change Damaging U.S. Naval Academy In Annapolis", "Earth just recorded its hottest June ever"], "summ2": ["Climate Change Probably Added 4 Degrees To Europe's June Heatwave: Study", "Power-short Zimbabwe removes barriers to solar energy expansion", "Automakers to Trump: Stop trying to force us to pollute more", "New Orleans faces a terrifying future as sea levels rise"]}
{"comp": "C_LC", "month": "May", "feats": "sbert", "test": 0.5935, "summ1": ["UK climate panel sets big goals: less meat, drive electric", "Scientists warn a million species at risk of extinction", "Kenya: We Asked Kenyan Students About Climate Change. They Didn't Know Much", "Russia, eyeing Arctic future, launches nuclear icebreaker"], "summ2": ["Climate change being fuelled by soil damage", "The message Morrison shouldn't take away from the election", "Tornado Alley 'about to wake up': Wall of storms threaten 18 states", "Flooding task force meets behind closed doors"]}
{"comp": "ER_R", "month": "Jan", "feats": "bow", "test": 0.5903, "summ1": ["AOC Stands By Prediction 'World Is Going To End In 12 Years' If We Don't Address Climate Change", "Global Warming Pushers Take 1,500 Private Jets to Preach Climate Change at Davos", "Trump Mocking Global Warming Leftists with Record Cold Temperatures", "Tens of thousands protest in France, Belgium over climate crisis"], "summ2": ["NBC's Chuck Todd: Climate Change Deniers Not Welcome on 'Meet the Press'", "Bell: Team Trudeau doesn't fear backlash over carbon tax", "Global warming costs the world a billion dollars a DAY - but DOUBLE that is needed to combat climate change, claims report", "Alexandria Ocasio-Cortez's 'Green New Deal' is more dangerous than you think"]}
{"comp": "C_LC", "month": "Aug", "feats": "sbert", "test": 0.5899, "summ1": ["Ignoring Great Lakes at Democratic debate was ‘unacceptable’ to environmentalists", "Change now or endanger food and climate, U.N. report warns", "Trump promotes Shell plant that will turn gas into plastics", "Europe Warming Faster Than Expected Due To Climate Change"], "summ2": ["Solidarity against the megadamage of megadams", "‘An April Fool’s Day joke’: Trump’s interest in buying Greenland stuns Danish", "World warned: change now or endanger food and climate", "Why the Arctic Fires Are So Bad for the Planet (Aside from the Actual Flames)"]}
{"comp": "C_RC", "month": "Sep", "feats": "bow", "test": 0.588, "summ1": ["U.S. presidential candidate Booker proposes $3 trillion climate change plan", "Cities could be our best weapon in the fight against climate change", "As Hurricane Dorian Wreaks Havoc, Scientists Discuss Climate Change Connection", "Climate change activists block Washington’s streets"], "summ2": ["Environment Minister McKenna gets security detail as online threats against her and her children move to real world", "How dare you? You have stolen my childhood: Climate activist Thunberg to world leaders at UN Climate summit", "Climate change protest: Thousands expected at Global Strike 4 Climate", "Andaman, Nicobar Islands may not be inhabitable in future due to rise in sea level: IPCC"]}
{"comp": "L_LC", "month": "Jan", "feats": "bow", "test": 0.5872, "summ1": ["Trump Once Again Confuses Weather and Climate in Response to Deadly Winter Storm", "White House patronizes ‘freshman’ AOC to Fox News — and tells her to leave climate change up to God", "Fossil Fuels: The Dirty Facts", "Bolsonaro Welcomes Big Business to Brazil, Alarming Environmentalists and Indigenous Groups"], "summ2": ["Is a Planned Monument to Women’s Rights Racist?", "Temperatures to plunge to 'historic' lows not seen in decades", "Analysis warns of lack of progress on 2020 global emissions target", "In New England, home prices fall as sea levels rise"]}
{"comp": "C_LC", "month": "May", "feats": "bow", "test": 0.5869, "summ1": ["Scientists warn a million species at risk of extinction", "Glasgow aims to become UK's first net-zero emissions city", "Exclusive: Presidential hopeful Biden looking for ‘middle ground’ climate policy", "UN kicks off major climate change effort"], "summ2": ["How the 'Change Generation' Is Motivating Businesses to Commit to Sustainability", "Irish Times view on the elections: Green light for climate action", "What U.S. flooding could mean for Canada's Prairie farmers", "May 4, 2019"]}
{"comp": "LC_RC", "month": "Aug", "feats": "sbert", "test": 0.5857, "summ1": ["Protecting critical resources like forests crucial to slowing climate change: United Nations", "Extinction Rebellion protesters block street in central Manchester", "The Amazon in Brazil is on fire", "Trump off on Puerto Rico funding by $50 billion: Weekly Fact Check"], "summ2": ["How Obama, Clinton crashed a 'secret' meet between China, India", "Today's letters: Time for a leaders' debate on climate change", "Met Office issues storm warning as UK faces wettest August on record", "Forest Protection Crucial To Fight Climate Change"]}
{"comp": "C_RC", "month": "Sep", "feats": "sbert", "test": 0.5856, "summ1": ["UN General Assembly 2019: What to expect at the 74th session this week", "South Carolina scrambles ahead of Dorian's storm surge", "World must adapt to 'inevitable' climate change, warns report", "Eco-Nationalism: The Nature Within Our Borders"], "summ2": ["UN anti-desertification meet Live: Time for world to say bye to single-use plastic, says PM Modi", "More than 70 fires burn in Queensland", "Greta Thunberg’s climate change activism goes global", "World must adapt to 'inevitable' climate change, warns report"]}
{"comp": "C_LC", "month": "Jun", "feats": "sbert", "test": 0.5856, "summ1": ["Emissions need to be halved to avoid 3C warming: scientists", "Report: Florida will have to spend $76 billion to prepare for sea level rise", "Coal Industry's Survival in Question as Companies Go Green", "US-Mexico deal offers few new solutions, political victory"], "summ2": ["Boston Built a New Waterfront Just in Time for the Apocalypse", "Emissions must be halved to avoid dangerous climate: Scientists", "Rice: The Changing Nature of the World's Most Important Food", "Plea over Scottish Parliament's fossil fuel pensions"]}
{"comp": "C_LC", "month": "Mar", "feats": "sbert", "test": 0.585, "summ1": ["Trump climate deregulation could boost CO2 emissions by 200 mln tonnes a year -study", "We must stop turning a blind eye to the world's health crises", "Climate change talk at NMSU to focus on drought patterns", "This Democrat seeks GOP support with new climate action plan"], "summ2": ["Tackling the climate crisis: Moving Pennsylvania from fossil fuel giant to clean energy powerhouse", "Artificial meat: UK scientists growing 'bacon' in labs", "Explaining environmentalism to a taxi driver, in three miles or less", "Trump's National Emergency Stands As House Fails To Override Veto"]}
{"comp": "C_RC", "month": "Jun", "feats": "bow", "test": 0.5848, "summ1": ["Democratic 'climate change candidate' outlines plan to wean U.S. off fossil fuels", "How water scarcity triggers the refugee crisis – and what tech can do to solve it", "Pressure mounts on aviation industry over climate change", "GOP strike in Oregon over climate change bill enters 5th day"], "summ2": ["Donald Trump blames India, China, Russia for not doing enough on climate change, says US has 'cleanest air'", "House passes Oregon’s controversial climate change policy; Senate more challenging", "World's Biggest Companies Will Lose $1 Trillion To Climate Change In The Next 5 Years", "Minister: 20 districts facing severe water crisis"]}
{"comp": "C_LC", "month": "Jan", "feats": "bow", "test": 0.5826, "summ1": ["Renewables overtake coal as Germany's main energy source", "AP-NORC Poll: Disasters Influence Thinking on Climate Change", "We can turn the whole economy carbon neutral. Here's how", "Trump administration working on Arctic oil leases despite shutdown"], "summ2": ["Temperatures to plunge to 'historic' lows not seen in decades", "People are confused about carbon offsetting – Sarah Leugers – Medium", "January 29, 2019", "PG&E Didn't Start the Fire—This Time. But Human-Caused Fires Are on the Rise."]}
{"comp": "ER_R", "month": "Jan", "feats": "sbert", "test": 0.5826, "summ1": ["Climate Change: The Poetry of Dreams and the Prose of Reality", "Putin: Trump Win Is A Massive Defeat Against New World Order", "WATCH: Sarah Sanders Responds to AOC's Climate Change Remarks", "Climate change “expert” arrested for brutally beating, choking fiance and dragging her by hair across apartment"], "summ2": ["Europe weather: Germany CUT OFF by heavy snow in unprecedented SEVERE weather conditions", "Correction: AP Poll-Climate Change story", "Socially responsible investing catching on with Canadians", "Nancy Pelosi: Green energy, gun safety, healthcare will dominate agenda"]}
{"comp": "LC_RC", "month": "Sep", "feats": "bow", "test": 0.5825, "summ1": ["Evacuations begin as Hurricane Dorian bears down on northern Bahamas", "ClimateTech is the new hot space for investors in a warming planet – TechCrunch", "Trump administration to revoke California’s power to set stricter auto emissions standards", "Greta Thunberg Says Asperger’s Is Her 'Superpower'"], "summ2": ["State of the planet: Key findings from UN climate change panel's special report", "Democratic presidential hopefuls tout trillion-dollar climate change plans", "'How dare you!' – Teen climate activist Greta Thunberg slams world leaders", "Climate Strike Live: School students protest climate change inaction news Australia"]}
{"comp": "C_LC", "month": "Jun", "feats": "bow", "test": 0.5808, "summ1": ["Health impact from smoke rises with more intense U.S. wildfires amid climate change", "Democratic 'climate change candidate' outlines plan to wean U.S. off fossil fuels", "France sets 2050 carbon-neutral target with new law", "Climate change could pose ‘existential threat’ by 2050: report"], "summ2": ["Forget the 'Polar Vortex.' Here comes the 'Death Ridge' and record heat for the Southeast", "Chennai water crisis: City's reservoirs run dry", "Coal comeback? Trump plan breathes new life into aging power plants, but critics say climate will suffer", "Mark Field: police receive reports of assault after minister grabs climate protester"]}
{"comp": "C_LC", "month": "Apr", "feats": "bow", "test": 0.5807, "summ1": ["Climate-change protesters say they will target London's Heathrow Airport", "What can fight climate change and antibiotic resistance? More sustainable meat", "Hydrogen’s Role In The Energy System Of The Future", "Medupi’s R6.8bn New Development Bank injection and ot..."], "summ2": ["Companies Like Ours are Stepping Up to Fight Climate Change — Government Should Too", "Your cotton tote is pretty much the worst replacement for a plastic bag", "Extreme weather affected 62 million people last year, UN climate change report says", "Extinction Rebellion: London climate protest 'ending on Thursday'"]}
{"comp": "LC_RC", "month": "Jan", "feats": "sbert", "test": 0.5802, "summ1": ["Jordan to drill 'fossil water' wells a half-mile underground", "Plants have a memory mechanism that could save them from climate change", "Climate change should be a bridge, rather than a wedge issue", "Consultation shows few support scrapping cap-and-trade, environmental commissioner says"], "summ2": ["Poll: Increase in natural disasters changing minds on climate change", "How Blockchain Can Reduce Costs For The Shifting Electric Vehicle Landscape", "Climate Change and Cities: What We Need to Do", "FLANNERY SUPPORTS ANTI-ABBOTT CANDIDATE. AND GETS JOB"]}
{"comp": "ER_R", "month": "Mar", "feats": "bow", "test": 0.5802, "summ1": ["Vatican Tells U.N. ‘Climate Change’ Is Hardest on the Poor", "Google Deletes Dr. Patrick Moore from Greenpeace Founders List Following President Trump's Praise", "Elizabeth Warren Says She Won't Believe Mueller Report Until She Sees It", "Worst Deal In History: $1.5 Trillion A Year To Reduce Global Warming By 0.048°C"], "summ2": ["Connecticut Bill Would Mandate Teaching Kids About Climate Change", "Plastic pollution is one of the major health threats to the world", "Gov. Inslee: Trump 'Cowardly and Pessimistic' on Climate Change", "'I'M NOT OWNED!': Ocasio-Cortez Gets Mocked After Her Green New Deal Fails In Senate Vote"]}
{"comp": "ER_R", "month": "Sep", "feats": "bow", "test": 0.5798, "summ1": ["President Trump Trolls Greta Thunberg, Climate Change Children’s Crusade, Young Actresses at Climate Week", "Watch — Jerome Hudson Reveals: U.S. Carbon Emissions at Lowest Level Since 1992", "Insane Environmentalists In Sweden Suggest CANNIBALISM To Stop Climate Change", "Bernie Sanders Says U.S. Taxpayers Should Fund Abortions In 'Poor Countries' To Fight Global Warming"], "summ2": ["Christians Respond to Bernie Sanders’ Disturbing Call for US to Fund Abortions in ‘Poor Countries’ to Control Population", "Gut Punch: Top Democratic Candidates Ditching MSNBC’s Climate Forum", "The Rush To Renewable Energy Defies Science, Economics, And Common Sense", "Eco-activist Greta Thunberg's language is 'terrifying children'"]}
{"comp": "LC_RC", "month": "Aug", "feats": "bow", "test": 0.5795, "summ1": ["The fires in the Amazon are the result of seasonal burning that farmers do every year. Here's why they have gotten so bad this summer.", "Our food system accounts for a whopping 37% of greenhouse-gas emissions, a UN report found. But it could also offer a solution to the climate crisis.", "Whaley Bridge dam: 'Two days' more pumping needed", "Trump says he won't risk US wealth for 'dreams and windmills'"], "summ2": ["World Record: Ethiopia Plants 35 Cr Trees In 12 Hrs To Tackle Climate Change; India Should Too!", "City council backs Saskatoon low-emissions plan in principle", "Canadian food supplies at risk if climate change not slowed, new UN report shows", "American oceanographer Sylvia Earle to join NTU institute's scientific advisory board"]}
{"comp": "C_LC", "month": "Aug", "feats": "bow", "test": 0.5770000000000001, "summ1": ["Trump, on climate, says he won't jeopardize U.S. wealth on 'dreams'", "Leonardo DiCaprio Launches $5 Million Emergency Fund to Help Combat Amazon Rainforest Fires", "Change now or endanger food and climate, U.N. report warns", "Democrats quash climate debate push from activists"], "summ2": ["The Wrong Amazon is Burning", "22 states sue the Trump administration over its climate ‘plan’", "EXPERT VIEWS-U.N. climate and land report flags need for 'new and healthy balance'", "57 people are dead and 18,000 were hospitalized in Japan as the country grapples with a stifling heat wave"]}
{"comp": "C_LC", "month": "Feb", "feats": "bow", "test": 0.5767, "summ1": ["Democrats float 'Green New Deal' to end fossil fuel era", "Text - H.R.1201 - 116th Congress (2019-2020): Climate Change National Security Strategy Act of 2019", "French, German farmers destroy crops after GMOs found in Bayer seeds", "Low-Carbon Growth Is a $26 Trillion Opportunity. Here Are 4 Ways to Seize It."], "summ2": ["Everything You Need to Know About The Green New Deal", "Robinson becomes pescatarian, urges people to ‘get angry’ over climate change", "UK weather forecast: February temperature record likely to be topped as Britain enjoys balmy conditions", "Trump’s Comments on Climate Change Report Debunked by Scientist Who Wrote It"]}
{"comp": "C_RC", "month": "Aug", "feats": "bow", "test": 0.5758, "summ1": ["Trump, on climate, says he won't jeopardize U.S. wealth on 'dreams'", "Leonardo DiCaprio Launches $5 Million Emergency Fund to Help Combat Amazon Rainforest Fires", "Change now or endanger food and climate, U.N. report warns", "Democrats quash climate debate push from activists"], "summ2": ["World Record: Ethiopia Plants 35 Cr Trees In 12 Hrs To Tackle Climate Change; India Should Too!", "Environment groups warned saying climate is real could be seen as partisan", "City council backs Saskatoon low-emissions plan in principle", "Canadian food supplies at risk if climate change not slowed, new UN report shows"]}
{"comp": "C_RC", "month": "Aug", "feats": "sbert", "test": 0.5754, "summ1": ["60 toxic algae blooms reported across New York state", "Change now or endanger food and climate, U.N. report warns", "Climate change, defence and Kashmir in the spotlight as Modi meets Macron ahead of G7 summit", "USDA Distributes Millions to Boost Energy Efficiency for Rural Farmers and Businesses"], "summ2": ["Climate change: Rising sea levels threaten to sink Welsh village", "Droughts to flash floods: Can India weather the climate crisis?", "Melania Trump, Justin Trudeau: G7 air kiss like a ‘Vogue ad’", "Forest Protection Crucial To Fight Climate Change"]}
{"comp": "C_LC", "month": "Sep", "feats": "bow", "test": 0.5742, "summ1": ["Greta Thunberg's four simple steps to combat climate change", "Trump probes threaten to overshadow Democrats' agenda", "Africa to seek declaration of global climate emergency at UN summit", "'Monster' Hurricane Dorian pummels Bahamas, forecast to threaten Florida"], "summ2": ["‘Catastrophic’ Hurricane Dorian unleashing devastating blow in northern Bahamas, takes aim at Southeast U.S.", "Editorial: Trump is trying to bully California and carmakers into giving up on climate change", "One tonne living (wk 3): dairy", "Greta Thunberg Says Asperger’s Is Her 'Superpower'"]}
{"comp": "C_LC", "month": "Feb", "feats": "sbert", "test": 0.5734, "summ1": ["Democrats float 'Green New Deal' to end fossil fuel era", "Green New Deal must cut fossil fuel supply and demand", "Winemaking in 10 years: How climate change is affecting Marlborough, New Zealand's largest wine region", "Greenpeace: Indonesian Firms Failed To Pay Billions In Fines Linked To Forest Fires"], "summ2": ["Australia weather: Townsville warned as floodgates open", "Black snow falls from the sky in Siberia, and it's toxic", "A winner: Alexandria Ocasio-Cortez's Green New Deal", "Maine Voices: None of us can afford to sit back as climate change poses threat to all life on Earth"]}
{"comp": "LC_RC", "month": "Jun", "feats": "bow", "test": 0.5727, "summ1": ["Study Claims 90% Of Humans Will Die By 2050, Mumbai Will Drown Due To Climate Change", "Forget the 'Polar Vortex.' Here comes the 'Death Ridge' and record heat for the Southeast", "That's a wrap: First night of the Democratic debate, featuring 10 candidates talking policy and tossing barbs, is over", "Coal comeback? Trump plan breathes new life into aging power plants, but critics say climate will suffer"], "summ2": ["'I totally listened to him': Prince Charles spent 90 minutes trying to convince Trump that climate change is bad", "Bloomberg Pledges $500 Million to Combat Climate Change", "Western Raj faces climate change perils: Report", "Globe editorial: A climate-change plan that hides the cost of fighting climate change"]}
{"comp": "LC_RC", "month": "Feb", "feats": "sbert", "test": 0.5707, "summ1": ["How Lindsey Graham Went From Trump Skeptic to Trump Sidekick", "American Airlines will let super-rich passengers take private helicopters to avoid long lines", "'Lot of grief' as acute water shortages threaten drought-hit NSW towns", "6 glimmers of climate optimism for the end of a dark year"], "summ2": ["‘Population before climate’: new Victorian MP Clifford Hayes hits out at Greens", "Climate Triage: Swift Action Is Required To Save Humanity from Dangerous Global Warming", "With renewables, sun kissed lands like India could boast almost-free power within a generation", "Accelerator Plans 100 New Ocean Startups By 2021"]}
{"comp": "C_RC", "month": "Jan", "feats": "sbert", "test": 0.5697, "summ1": ["Keep humans in good jobs in the robot era, ILO commission urges", "Letter: Climate change claims fail the test", "How compressed-air storage could give renewable energy a boost", "'Contact your local ranger': Here's what to do if you find a pine marten in your home"], "summ2": ["Fast north magnetic pole shift prompts navigation update", "No Trans Mountain, no payment: Alberta rancher refuses to pay carbon tax portion of heating bill", "The 7 Most Promising Aviation Biofuels", "Perceptions and Reality about Climate Change"]}
{"comp": "C_RC", "month": "Mar", "feats": "bow", "test": 0.5686, "summ1": ["Study Finds Great Lakes Climate Change Could Be Disastrous", "Mozambique: Cyclone Idai 'one of the worst disasters' in the southern hemisphere", "Leo says he supports school students going on strike next week as part of global action on climate change", "U.S. Republicans set Green New Deal vote in bid to divide Democrats"], "summ2": ["Climate Strike Live: School students protest climate change inaction news Australia", "Alienated: Alberta project seeks to find common language on climate change", "Dori: Jay Inslee wants billions from us to build national ‘green’ image", "Floods suggest national security threat from climate change"]}
{"comp": "C_RC", "month": "Feb", "feats": "sbert", "test": 0.5659, "summ1": ["Exclusive: China's Dalian port bans Australian coal imports, sets 2019 quota - source", "Which cities are at risk from ice sheets melting? This tool holds the answers", "EPA report predicts catastrophic global warming", "How much money every Green New Deal sponsor gets from environmental and fossil fuel interests"], "summ2": ["Climate Triage: Swift Action Is Required To Save Humanity from Dangerous Global Warming", "Another Viewpoint: One farmer's perspective on climate change", "World's driest desert floods as extreme weather hits Chile, Americas News & Top Stories", "New St. Paul's Hospital gets green light from B.C. government"]}
{"comp": "ER_R", "month": "Sep", "feats": "sbert", "test": 0.5603, "summ1": ["Steve Milloy Contradicts Climate Alarmists on Plastic Straw Bans", "\"Control Freaks\": CNN Climate Change Fiasco Should Be Seen By Every American To Understand That Radical Liberals Want To Control Every Aspect Of Your Life", "Enron Environmentalism: The Carbon Credits Scam Pumps Millions of Tonnes More Greenhouse Gases Into The Atmosphere", "Climate change and 'neurodiversity'"], "summ2": ["G-7 Summit: Misinformed Action On Amazon Rainforest Fires", "More Scientists Debunking Climate Change Myths", "No, Don't Listen to Greta Thunberg", "Bernie Sanders says US should pay for abortions and birth control in 'poor countries' to combat climate change"]}
{"comp": "C_LC", "month": "Mar", "feats": "bow", "test": 0.5589999999999999, "summ1": ["Flooded U.S. Air Force base underscores climate risk to security: experts", "Mozambique: Cyclone Idai 'one of the worst disasters' in the southern hemisphere", "Leo says he supports school students going on strike next week as part of global action on climate change", "U.S. Republicans set Green New Deal vote in bid to divide Democrats"], "summ2": ["Michael Bloomberg Will Not Run for President in 2020", "Climate change adversely affecting Virginians’ health, study says", "Cyclone Idai: Mozambique survivors desperate for help", "'It Will Be Too Late for My Generation.' Meet the Young People Organizing a Massive Climate Change Protest"]}
{"comp": "C_RC", "month": "Jan", "feats": "bow", "test": 0.5584, "summ1": ["5 resolutions you should make for the planet in 2019", "More Americans view climate change as 'imminent' threat: Reuters/Ipsos Poll", "Who's coming to Davos 2019?", "World is going to miss its 'best chance' of preventing runaway climate change: Study"], "summ2": ["Australia weather: The extreme heat in South Australia and Victoria has come at a cost of $1.1 billion in energy bills", "Donald Trump doesn’t understand climate change", "A 'climate emergency' has been declared in Leicester", "Free Markets to Combat Climate Change"]}
{"comp": "LC_RC", "month": "Feb", "feats": "bow", "test": 0.552, "summ1": ["UK weather: Is hot February down to climate change?", "World’s First Antarctic Expedition Powered Solely By Renewable Energy — Climate Solutions Follow", "Trump’s Comments on Climate Change Report Debunked by Scientist Who Wrote It", "Branford creates $1M fund to counter sea level rise; likely 1st in state"], "summ2": ["The Unrealistic Economics of the Green New Deal", "Bloomberg rips Trump for not taking action on climate change", "Plunging Prices Mean Building New Renewable Energy Is Cheaper Than Running Existing Coal", "Harrison Ford delivers apocalyptic climate change warning"]}
{"comp": "LC_RC", "month": "Mar", "feats": "bow", "test": 0.5506, "summ1": ["At least 120 dead after cyclone hits Mozambique, Zimbabwe", "Record-breaking temperatures hit Yukon with a splash", "Trump climate deregulation could boost CO2 emissions by 200 mln tonnes a year -study", "Time for Congress to Stand Up for Democracy"], "summ2": ["Alienated: Alberta project seeks to find common language on climate change", "Trump climate deregulation could boost carbon emissions by 200 million tonnes a year, study says", "NZ govt promises climate action at strike", "Floods suggest national security threat from climate change"]}
{"comp": "LC_RC", "month": "Mar", "feats": "sbert", "test": 0.5498, "summ1": ["Tackling the climate crisis: Moving Pennsylvania from fossil fuel giant to clean energy powerhouse", "Artificial meat: UK scientists growing 'bacon' in labs", "Explaining environmentalism to a taxi driver, in three miles or less", "Trump's National Emergency Stands As House Fails To Override Veto"], "summ2": ["Editorial: Don't play politics with road safety", "kerala droughts: Kerala is fast losing its forest cover: What are we doing about it?", "Trump climate deregulation could boost carbon emissions by 200 million tonnes a year, study says", "Obama urges action on climate change, inequality in Western Canada speeches"]}
{"comp": "C_RC", "month": "Feb", "feats": "bow", "test": 0.5497, "summ1": ["Pelosi on Green New Deal: ‘I can’t say we’re going to take that and pass it’", "Polar bear 'invasion': how climate change is making human-wildlife conflicts worse", "San Diego region way off track to meet state mandates for limiting climate pollution from driving", "Trump urges U.S.-owned TVA to keep coal plant open"], "summ2": ["The Unrealistic Economics of the Green New Deal", "Caldwell: A few suggestions from an environmentalist for the United We Roll Convoy", "Bloomberg rips Trump for not taking action on climate change", "electricity prices: Morrison Government announces plans to cut high energy costs"]}
{"comp": "C_LC", "month": "Jan", "feats": "sbert", "test": 0.5473, "summ1": ["Keep humans in good jobs in the robot era, ILO commission urges", "Letter: Climate change claims fail the test", "How compressed-air storage could give renewable energy a boost", "Ducey skips over key issues in ‘State of the State’ address"], "summ2": ["What the first two weeks of the legislative session say about Minnesota’s approach to addressing climate change", "Perennial grains could be a key weapon against climate change. But not quite yet.", "Extreme heat shouldn't cause blackouts in SA and Victoria despite pressure on system: AEMO", "Why Are Young People Pretending to Love Work?"]}
{"comp": "LC_RC", "month": "Jan", "feats": "bow", "test": 0.5432, "summ1": ["US government scientists correct Trump over climate change statements: 'Winter storms don't prove global warming isn't happening'", "Tasmanian bushfire emergency warnings upgraded as conditions deteriorate", "Is This the Year for a Redistricting Revolution?", "Nova Scotians need $19/hour to keep heads above water, report says"], "summ2": ["Randall Denley: Ontarians' reaction to competing climate change plans may decide the next federal election", "Why Climate Change Will Burn Energy Production, Water Supplies And The Trump Presidency", "Australia weather heatwave to bake states and territories", "Davos WEF report reveals concerns of the rich and powerful"]}
