{"comp": "ER_RC", "month": "Jan", "feats": "sbert", "test": 0.8109999999999999, "summ1": ["Catholic Priest Slams March for Life as ‘Repulsive and Futile’", "Rep. Ilhan Omar Furthers Homophobic Conspiracy that Lindsey Graham’s ‘Compromised’", "Texas Values Action Warns Against Anti-Christian ‘Ban the Bible’ Bills in Texas That Stigmatize Christian Beliefs in the Name of LGBT SOGI Protections", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"], "summ2": ["Douglas Todd: The many things Lindsay Shepherd is not", "LATEST UPDATES: Supreme Court weighs gay marriage, DOMA on second day", "LGBTQ community raise objections against Transgender Bill", "Billy Porter Joins WorldPride 2019 To Tease Can't-Miss New York City Event Highlights"]}
{"comp": "C_ER", "month": "May", "feats": "sbert", "test": 0.8075, "summ1": ["Indonesian director calls for LGBT+ debate after film ban", "House approves sweeping bill to expand gay rights", "Taiwan gay couples plan weddings even as opponents fight back", "Controversial preacher stops in Vermont, meets with protesters"], "summ2": ["Hillary Clinton, 2020 Dems Celebrate Passage of the Orwellian Equality Act", "This Christian Student Was Taught Pro-Islam Propaganda and Forced to Write the Islamic Conversion Creed, the Shahada. The Thomas More Law Center Is Appealing to the Supreme Court to Prevent Islam From", "Tranny Weightlifter Who Smashed Female Lifting Records Has Wins Stripped", "Buttigieg Flails at Pence Again in Imaginary War with VP"]}
{"comp": "C_ER", "month": "Jan", "feats": "sbert", "test": 0.8068, "summ1": ["Supreme Court allows transgender military ban to be enforced", "Gay Brazilian lawmaker leaves job, country over death threats", "Survey: Offensive sexual jokes top harassment list at UN", "NY ban on conversion therapy is a win for humanity"], "summ2": ["Catholic Priest Slams March for Life as ‘Repulsive and Futile’", "The Sexual Subversion of Ukraine", "Democrats Refuse to Pay for Border Protection as Fed. Gov’t Gives 18K to Gay Movie Festival in India", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"]}
{"comp": "ER_RC", "month": "Jun", "feats": "sbert", "test": 0.7983, "summ1": ["Trump Supporters 'Mostly Middle Aged Angry White Males,' CNN Host Chris Cuomo Says", "Nolte: Trump Is Wrong About Outlawing American Flag Burning", "Whistle-Blowing Mothers Threatened, Doxxed by Antifa for Exposing Drag Queen Event Teaching Graphic Sex to Teens", "Are Abortion and Gay Rights Really American Values?"], "summ2": ["Botswana High Court decriminalises gay sex", "Uber \"Failed to Report Serious Crimes\" to London Police", "Lady Gaga crashes Stonewall gay rights commemoration bash in New York", "‘Fear and shame holding LGBT community back’"]}
{"comp": "C_ER", "month": "Jul", "feats": "sbert", "test": 0.7881, "summ1": ["Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "Colorado attorney general says LGBTQ Americans should be federally protected from job discrimination", "HIV in 2019: Stories Beyond a Medical Lens", "Reading Mayor Reverses Course, Will Allow LGBTQ Rainbow Flag To Over City Hall"], "summ2": ["Trans Predator Demands ‘Topless’ Party For 12-Yr-Olds", "LGBT Outlets Play the Victim After Amazon Banned Books By Renowned Clinical Psychologist Joseph Nicolosi ⋆ Activist Mommy", "Schumer Accepted Thousands in Donations from Child Sex Trafficker Jeffrey Epstein", "Muslim Woman Attacks Gay Man Over Rainbow Flag Puts Liberals in a Pickle"]}
{"comp": "C_ER", "month": "Aug", "feats": "sbert", "test": 0.775, "summ1": ["Indian state bans unnecessary surgery on intersex babies", "Gay pride parade held in Polish city of Plock", "Las Vegas man with ties to hate group accused of plotting to bomb synagogues, LGBTQ bar", "Jackie Webb again leads bipartisan group to push LGBTQ protections"], "summ2": ["Dear Reps. Omar & Tlaib: Palestinian Authority Bans Pro-LGBT Activities In The West Bank — Is That Bigotry?", "LGBT Site Celebrates Middle-Aged Man's \"Relationship\" With 16-Year-Old Boy ⋆ Activist Mommy", "Christians Beware: Biden Declares His #1 Priority Will Be the Anti-Christian LGBTQ 'Equality Act'", "The Political Insider"]}
{"comp": "ER_RC", "month": "Aug", "feats": "sbert", "test": 0.7708, "summ1": ["A Storm Is Brewing in the Americas", "Students Aim to Oust LGBT ‘Pride,’ Events From Houston Campus", "Ilhan Omar calls those who demand LGBT rights in Middle East ‘Deplorable’", "Stacey Abrams Is an Election Fraud, Libs Don't Care About LGBTQ"], "summ2": ["Religious Discrimination Bill: LGBT groups say ‘radical provisions’ allow people of faith to attack minorities", "Kolkata: Man uses LGBT dating app for extortion, held", "John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Israeli Nurse and LGBTQ Advocate is a Bride Like No Other"]}
{"comp": "C_ER", "month": "Jun", "feats": "sbert", "test": 0.7696, "summ1": ["Racist, anti-gay student flyers challenge Wyoming district", "‘We’re still healing’: Orlando marks three years since Pulse tragedy", "Explainer: What is a 'terf' and what's going on with the UK's debate on transgender rights?", "Ministers condemn bishop's 'unchristian' call for boycott of LGBT pride events"], "summ2": ["Nolte: Trump Is Wrong About Outlawing American Flag Burning", "Vladimir Putin: ‘The Liberal Idea Has Started Eating Itself,’ Tells LGBT Community To ‘Let The Children in Peace’", "Whistle-Blowing Mothers Threatened, Doxxed by Antifa for Exposing Drag Queen Event Teaching Graphic Sex to Teens", "Are Abortion and Gay Rights Really American Values?"]}
{"comp": "ER_L", "month": "Apr", "feats": "sbert", "test": 0.7686, "summ1": ["Robert De Niro Attacks Trump, Again: ‘Unrepentant, Lying, Scumbag’", "LGBT Bullies Strike Again: Federal Court Rules Philadelphia Can Discriminate Against Catholic Foster Care Agencies", "Democrats file legislation to force all Americans to accept the LGBTQ agenda", "IMAM Who Masterminded Easter Islamic Attacks Preached Slaughter of “Idolators”"], "summ2": ["Bay Area Reporter :: SF Pride names more honorees", "The Powerful LGBT Message of Pete Buttigieg and Lori Lightfoot Kissing Their Partners On Stage", "UK government agency suspends Brunei project over gay death penalty", "This proud Texas Christian mom is taking on the world for her trans daughter’s rights"]}
{"comp": "C_ER", "month": "Jan", "feats": "bow", "test": 0.7674, "summ1": ["Meet Nashville police's first liaison to the LGBTQ community", "A whole lotta love: 26 mock weddings for Japanese lesbian couple", "Court asked to block lawmaker testimony in LGBT rights case", "Kirkland, Latham and Wilmer Fight Trump's Transgender Troop Ban at SCOTUS"], "summ2": ["Neo-Nazi Rep. Ilhan Omar Defends Anti-Semitic Hate Group Which Calls for Death of Gays", "WATCH: Children as young as FIVE are being taught about homosexuality and sexual intercourse. · Caldron Pool", "Donald Trump Bets It All in Televised 8-Minute Address from Oval Office", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"]}
{"comp": "ER_RC", "month": "Apr", "feats": "bow", "test": 0.7649, "summ1": ["David Hogg: Trump ‘Supports’ ‘Terrorism’ Against Black Churches", "Democrats file legislation to force all Americans to accept the LGBTQ agenda", "Egomaniac: Beto Claims He Didn’t Give To Charity Because He Gave The World Himself", "Female High School Students in Iowa Protest Trans Bathroom Rules After Feeling Violated"], "summ2": ["CA Democrats Author Bill to Protect Sex Offenders Who Lure Minors – California Globe", "New community hub aims to represent, empower LGBTQ youth in Regina", "Supreme Court to take up LGBT job discrimination cases", "UCP’s Kenney opts to keep Alberta candidate on the ballot despite ‘offensive’ comments about LGBTQ people"]}
{"comp": "ER_LC", "month": "Jun", "feats": "sbert", "test": 0.7593, "summ1": ["Public Library Provides Condoms, Lube & Chest Binders at Teen Pride Event", "Hollywood Wants Your Money...and Your Mind", "Trump Celebrates LGBT Pride Month And Calls For Decriminalization of Homosexuality In Nations Where It Is Illegal", "Are Abortion & Gay Rights American Values?"], "summ2": ["London bus attack: Four teenage boys arrested over homophobic attack on lesbian couple", "Utah Pride Festival will draw thousands to celebrate LGBTQ rights, 50 years since Stonewall riots", "Transgender charity Mermaids 'told mum to force son to live as girl'", "EDITORIAL: Fifty years of progress — but fight for gay rights goes on"]}
{"comp": "ER_LC", "month": "May", "feats": "sbert", "test": 0.7583, "summ1": ["Hillary Clinton, 2020 Dems Celebrate Passage of the Orwellian Equality Act", "Pete Buttigieg Tells Liberal Jews U.S. Must Push Israel to Change Policies", "This Christian Student Was Taught Pro-Islam Propaganda and Forced to Write the Islamic Conversion Creed, the Shahada. The Thomas More Law Center Is Appealing to the Supreme Court to Prevent Islam From", "GOP Settles the Score on Girls Sports"], "summ2": ["Police raid at Hares & Hyenas building", "First-ever Pride celebrations a landmark moment for Gimli's LGBT community", "UK to appoint first human rights ambassador", "Taiwan's LGBT community protests ahead of vote"]}
{"comp": "C_ER", "month": "Apr", "feats": "sbert", "test": 0.7571, "summ1": ["Kenney nixed gay rights in citizenship guide: documents", "United Methodist shows support for LGBTQ community amid controversy", "﻿LGBT Progress Seen in Lightfoot’s Win, Rise of ‘Mayor Pete’", "UN slams 'inhuman' Brunei law on stoning for adultery"], "summ2": ["The Catholic Classical School Lyceum Files a Groundbreaking Lawsuit Opposing LGBT Sexual Orientation-Gender Identity Laws in South Euclid, Ohio. This First Amendment Lawsuit Could Change the Rules of", "LGBT Bullies Strike Again: Federal Court Rules Philadelphia Can Discriminate Against Catholic Foster Care Agencies", "Pete Buttigieg to Mike Pence: My Marriage Has ‘Moved Me Closer to God’", "British Muslims admit all Muslims hold to \"extreme\" and \"radical\" views, the West refuses to believe it: \"What are they going to do? Call us all extremists? Deport us all?\" · Caldron Pool"]}
{"comp": "ER_RC", "month": "Apr", "feats": "sbert", "test": 0.7544, "summ1": ["These Stories Prove That Many Democrats Have A Suicidal Death Wish", "LGBT Bullies Strike Again: Federal Court Rules Philadelphia Can Discriminate Against Catholic Foster Care Agencies", "Biden Mocked For 'Make America Straight Again' Message After Launching 2020 White House Bid", "Texas mayor is a homosexual transvestite who wears 4″ high heels"], "summ2": ["Same-sex marriage vote: How your electorate voted", "Loonie commemorating gay rights sparks backlash from activists", "Supreme Court to take up LGBT job discrimination cases", "Corbella: NDP's attack on religious schools violates the Charter"]}
{"comp": "ER_RC", "month": "Feb", "feats": "sbert", "test": 0.7514, "summ1": ["Trump’s Right Wing Takeover of LGBT Agenda", "Colin Flaherty: Jussie Smollett \"Black Actor LGBTQ Activist\" Hoax Exposed", "Bombshell Book Claims 80% of Vatican Prelates Are Gay", "Jackson Gay Rights Leader Accused of Burning Down Own Home"], "summ2": ["United Methodist delegates defeat bid to ease LGBT bans", "He brought an American flag to protest fascism in Portland. Then antifa attacked him", "Alberta health-care workers learn more about transgender patient care", "Valentine's Day: It’s an all-inclusive Valentine’s Day today"]}
{"comp": "ER_LC", "month": "Jan", "feats": "sbert", "test": 0.7477, "summ1": ["Transgender Billionaire: No Donations to GOP While it Supports 2 Sexes", "Neo-Nazi Rep. Ilhan Omar Defends Anti-Semitic Hate Group Which Calls for Death of Gays", "WATCH: Children as young as FIVE are being taught about homosexuality and sexual intercourse. · Caldron Pool", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"], "summ2": ["Fight prejudice by making LGBT+ lives more visible", "Ellen DeGeneres Says She Wants Kevin Hart to Be the Oscars Host Despite Homophobic Comments", "N.Y. advances 'ex-gay' therapy ban, long-awaited transgender protections", "From Our Own Correspondent, Life in Lockdown"]}
{"comp": "ER_RC", "month": "Sep", "feats": "sbert", "test": 0.7469, "summ1": ["Maryland School District Adds Third Gender Option for Students, LGBT 'Safe Space' Classrooms", "Pete Buttigieg: A Wolf in Wolf’s Clothing", "Trans Activist Discusses Genitals, Sexual Preferences With Children for BBC Program ⋆ Activist Mommy", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides"], "summ2": ["Choir director found slain in apartment", "‘Kashmiri LGBT movement is nascent … homophobia in Islamic society is more cultural and less religious’", "10 candidates in Cedar Rapids forum vow to embrace LGBTQ policies", "Cops blast DA Rachael Rollins after SJC tosses Straight Pride case"]}
{"comp": "ER_L", "month": "Jan", "feats": "sbert", "test": 0.7466, "summ1": ["Catholic Priest Slams March for Life as ‘Repulsive and Futile’", "Rep. Ilhan Omar Furthers Homophobic Conspiracy that Lindsey Graham’s ‘Compromised’", "Texas Values Action Warns Against Anti-Christian ‘Ban the Bible’ Bills in Texas That Stigmatize Christian Beliefs in the Name of LGBT SOGI Protections", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"], "summ2": ["The Steven Universe season finale was about trans people, fans say", "LGBTQ leaders warned about a Trump presidency. Two years later, it’s clear they were right. – ThinkProgress", "Texas Wedding Venue Refuses Service to Gay Couple", "Applause as AOC, Porter, Pressley, and Tlaib Head to House Financial Services Committee"]}
{"comp": "ER_LC", "month": "Apr", "feats": "sbert", "test": 0.7433, "summ1": ["Robert De Niro Attacks Trump, Again: ‘Unrepentant, Lying, Scumbag’", "LGBT Author: Pete Buttigieg Threatens to ‘Assimilate The Radical Democratic Energies of Queer Liberation’", "LGBT Bullies Strike Again: Federal Court Rules Philadelphia Can Discriminate Against Catholic Foster Care Agencies", "Elisabeth Moss: America Under Trump ‘Losing the Principles This Country was Built On’"], "summ2": ["Plan with LGBT bans OK'd by United Methodist judicial panel", "Putin’s pride? Six famous gay sons of Russia", "LGBT: The pilot who came out as transgender at 58", "If identity politics is a force for good, how does white nationalism fit in? | Kenan Malik"]}
{"comp": "C_ER", "month": "Jun", "feats": "bow", "test": 0.7398, "summ1": ["Knox mayor: KCSO Detective Grayson Fritt's anti-LGBTQ comments 'vile and reprehensible'", "New York police commissioner apologizes for Stonewall raid in 1969", "'Every day is straight pride': Proposal for Boston 'Straight Pride' parade sparks outrage", "Ecuador's constitutional court approves same-sex marriage"], "summ2": ["MSNBC Freaks Out Because Trump Won't Raise LGBTQ Flags At U.S. Embassies!", "The LGBT agenda has now completely destroyed women’s sports as biological male wins NCAA women’s track championship… women’s rights being obliterated by the Left Cult", "One Nation and One People?", "LGBT parents begin physically maiming their own children in botched transgender mutilations"]}
{"comp": "ER_LC", "month": "Feb", "feats": "bow", "test": 0.7381, "summ1": ["LGBT Teaching Program for Christian Kids is Apostasy from Biblical Belief", "CA Democrats Introduce LGBTQ Bill that would Protect Pedophiles who Rape Children", "FLASHBACK: Democrats Called Jussie Smollett Attack ‘Lynching’; NAACP Blamed Trump", "Transgender Activist Accused of Burning Down Own Home, Killing 5 Pets in Hate Hoax Crime"], "summ2": ["GOP lawmaker under fire after calling LGBTQ groups 'modern day' KKK", "Jussie Smollett charged with filing a false report", "United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "Women's March in Malaysia to push for LGBTI rights"]}
{"comp": "C_R", "month": "Jun", "feats": "sbert", "test": 0.7369, "summ1": ["Emerging Consensus on LGBT Issues: Findings From the 2017 American Values Atlas", "Ministers condemn bishop's 'unchristian' call for boycott of LGBT pride events", "Park Slope Gay Bar Excelsior To Close After 20 Years On Fifth Ave", "Kenya: Scores of LGBT+ Refugees in Kenya Slum Face Homophobic Attacks, Eviction"], "summ2": ["The Nation Defends Rapinoe Protest, Ridicules 'Christianists,' Administration Opposing LGBT Rights", "Philippines President Duterte shakes up world news by claiming he ‘cured’ himself of being gay", "Discovery Family Show ‘My Little Pony’ To Introduce Lesbian Couple", "No, minister. Most parents DON’T approve of gay sex lessons in primary schools"]}
{"comp": "C_ER", "month": "May", "feats": "bow", "test": 0.7345, "summ1": ["Duluth center aims to bridge LGBT+ groups", "House approves sweeping bill to expand gay rights", "Woman held in Poland for adding LGBT rainbow to revered icon", "Taiwan MPs urged to back government in Asia's first same-sex marriage law"], "summ2": ["LGBT Ignores, Denies and Attacks Biblical Truth While Claiming They are Being Assaulted", "Muslim Exodus from LGBT 'Brainwash’ School as Parents Pull 600 Kids", "Tranny Weightlifter Who Smashed Female Lifting Records Has Wins Stripped", "Expert Psychologist Banned From Twitter Over Controversial Statement on Gender Identity ⋆ Activist Mommy"]}
{"comp": "C_ER", "month": "Feb", "feats": "bow", "test": 0.7339, "summ1": ["United Methodist Church Facing Split After Delegates Reject Gay Marriage and LGBT Clergy", "Living in Venezuela now is hard. Being LGBT+ makes it harder", "Washington state House committee passes bill to ban personal, philosophical vaccine exemptions", "Kenya court set to rule on whether to scrap anti-gay laws"], "summ2": ["LGBT Teaching Program for Christian Kids is Apostasy from Biblical Belief", "FL Trump Ally Slammed by Progressives and Family Values Group For Pro-LGBT Legislation", "Transgender Activist Accused of Burning Down Own Home, Killing 5 Pets in Hate Hoax Crime", "Dozens Gather in NYC Rally for Jussie Smollett"]}
{"comp": "ER_RC", "month": "Mar", "feats": "sbert", "test": 0.7321, "summ1": ["Narcissists At The Gates, 2020 Dem Primaries Edition", "Lesbian Feminist Julia Beck Slams Transgender Protections in the Violence Against Women Act (VAWA) as a ‘Misogynistic Trojan Horse'", "The Political Insider", "High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses"], "summ2": ["Officials at Aurora Methodist church speak out in support of LGBTQ community", "Insults dominate gay-marriage debate", "Enter Q Rang, the first LGBTQ theatre group", "'Catalyst for change': LGBTQ advocate Stephanie Mott honored at Statehouse service"]}
{"comp": "C_ER", "month": "Sep", "feats": "sbert", "test": 0.7286, "summ1": ["Bosnians to march for Gay Pride - under heavy police protection", "LGBQ+ adults’ experiences of Improving Access to Psychological Therapies and primary care counselling services: informing clinical practice and service delivery", "Kim Davis, a longtime Democrat, becomes Republican amid gay marriage fury", "Arizona Supreme Court protects business' religious right to reject work for same-sex marriages"], "summ2": ["Presidential Candidate Pete Buttigieg Causing Fractures in the LGBT Community for “Not Being Gay Enough” and a “Being a Gay White Man”", "Trans Activist Discusses Genitals, Sexual Preferences With Children for BBC Program ⋆ Activist Mommy", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides", "Court: City Can't Force Christian Artists to Endorse Gay Wedding"]}
{"comp": "ER_L", "month": "Mar", "feats": "sbert", "test": 0.7281, "summ1": ["Narcissists At The Gates, 2020 Dem Primaries Edition", "San Antonio Bans Chick-Fil-A From Airport Over ‘Anti-LGBTQ Behavior’", "High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses", "The Sinister Side of the Gender War"], "summ2": ["Chick-fil-A donated to anti-LGBTQ group that bars employees from ‘homosexual acts’ – ThinkProgress", "Senate passes resolution to overturn Trump's national emergency declaration", "Transgender Visibility in the Workplace", "The Bachelor: Karamo Brown sparks outrage by asking if star is gay · PinkNews"]}
{"comp": "C_ER", "month": "Feb", "feats": "sbert", "test": 0.7275, "summ1": ["National LGBTQ Task Force’s Winter Party Festival: February 27 to March 5, 2019", "United Methodist delegates defeat bid to ease LGBT bans", "Kenya court set to rule on whether to scrap anti-gay laws", "Looking to WOMEN, LGBTQ for votes — SOLIS tapes name 4 aldermen — A MOVE on graduated income tax"], "summ2": ["LGBT Teaching Program for Christian Kids is Apostasy from Biblical Belief", "Twitter Transgender Critic ‘Questioned by Police and Banned from Leaving UK’", "Trump’s Right Wing Takeover of LGBT Agenda", "Another Hate Hoax: LGBT Activist Accused Of Burning Down Own Home"]}
{"comp": "C_ER", "month": "Jul", "feats": "bow", "test": 0.7271, "summ1": ["Rally In St. Petersburg For Slain LGBT Activist", "Botswana seeks to overturn ruling that legalized gay sex", "U.S. black LGBTQ community celebrates Pride, but says fight is far from over", "Ex-candidate admits lying about operating on Pulse survivors"], "summ2": ["California's Graphic Sex Ed Curriculum Is Even Worse Than You Think ⋆ Activist Mommy", "Muslim Woman Attacks Gay Man Over Rainbow Flag Puts Liberals in a Pickle", "Did USWNT Kick Christian Jaelene Hinkle Out of World Cup?", "NYC Public Students Can Change Gender, Name Without Documentation"]}
{"comp": "ER_LC", "month": "Jul", "feats": "sbert", "test": 0.7259, "summ1": ["Trans Predator Demands ‘Topless’ Party For 12-Yr-Olds", "LGBT Outlets Play the Victim After Amazon Banned Books By Renowned Clinical Psychologist Joseph Nicolosi ⋆ Activist Mommy", "US Women’s Soccer Player Chose God, Withdrew from Nat’l Team Over Jerseys Sporting Rainbow Colors", "Democrats Hire Anti-Trump Pastor to Recruit Evangelicals Ahead of 2020"], "summ2": ["Pa. mayor calls off ceremony to raise LGBTQ flag at City Hall", "If we want realistic bisexuals on screen, let's start with the closeted ones", "Gay tour group’s trip to Ethiopia canceled after death threats, violence", "Marriage equality campaigners celebrate ‘historic day’ for Northern Ireland"]}
{"comp": "C_L", "month": "Sep", "feats": "sbert", "test": 0.7256, "summ1": ["Georgia man fights for gay rights in U.S. Supreme Court 'Hotlanta' case", "Bosnians to march for Gay Pride - under heavy police protection", "L.A. County to Begin Tracking Suicide Rates, Violent Deaths in LGBTQ Community", "Arizona Supreme Court protects business' religious right to reject work for same-sex marriages"], "summ2": ["A winery refused to host a same-sex wedding because of the owner’s ‘religious beliefs’", "Mike Pence argued homosexuality was 'a choice' or 'learned behavior' during 1990s fight against gay rights ordinance", "Watch Kevin Hart Gaslight Lil Nas X Over Homophobia", "Teenage girl is the 17th trans person to be killed in the US in 2019"]}
{"comp": "L_RC", "month": "Feb", "feats": "sbert", "test": 0.7254, "summ1": ["Kacey Musgraves feels guilty that she used to bully gay kids", "Pat Robertson: Gay People Willing to Destroy Fabric of Society Over 'Their Weird Way of Doing Sex'", "Who is Eric Porterfield? What has the anti-LGBT Republican lawmaker said? · PinkNews", "The Full Timeline of the Jussie Smollett Attack Investigation"], "summ2": ["United Methodist delegates defeat bid to ease LGBT bans", "Dilbert Creator Scott Adams Is Evil (And Why You Should Follow His Lead)", "A Texas judge just declared the all-male military draft unconstitutional. Will women be required to register for the draft?", "Don't forget about us, say LGBT+ students"]}
{"comp": "ER_RC", "month": "Jul", "feats": "sbert", "test": 0.7248, "summ1": ["LGBTQ Seeks to ‘Trash’ Witnessing Christians, Use Smutty Display Tactics", "Kamala Harris Says She Won't Let Trump UNDO Legal Gay Marriage!", "Top Disney Executive Arrested For Operating Pedophile Ring", "NYC Public Students Can Change Gender, Name Without Documentation"], "summ2": ["UBC banned from Pride Parade for hosting 'transphobic' speaker", "Eamon Gilmore says his support for gay marriage 'is a Labour policy not Coalition's'", "Police use tear gas on activists at LGBTQI event in Turkey", "Key witness in Mueller probe now facing child sex trafficking charges"]}
{"comp": "C_R", "month": "Aug", "feats": "sbert", "test": 0.7247, "summ1": ["Indian state bans unnecessary surgery on intersex babies", "Attorney who challenged Arkansas gay marriage ban dies", "Watch: First Plock Pride parade in Poland takes place without major incidents", "Jackie Webb again leads bipartisan group to push LGBTQ protections"], "summ2": ["The unhinged left-wing reaction to Log Cabin Republicans’ Trump endorsement", "Critics demand Ilhan Omar condemn Palestinian ban on LGBT activities  — and she just responded", "First Day Of School, CA Teacher Hands Out Gender Identity Graphic To Middle Schoolers. Parents Are Furious.", "Four Weddings And A Funeral's remake SLAMMED by critics for lacking its 'original charm'"]}
{"comp": "L_RC", "month": "Aug", "feats": "sbert", "test": 0.7194, "summ1": ["Texas Congressman says if El Paso shooter is charged with a hate crime, pastors will be next", "Trump claims ‘some of my biggest supporters’ are gay & support his plan to legalize discrimination", "Football game brought to a stop after fans reveal homophobic banners", "11 incredible trans people from history you won't learn about in school"], "summ2": ["NASA astronaut accused of stealing her estranged wife’s identity from space", "John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Anti-LGBT discrimination is now official PA policy", "Ancestors guide LGBT+ South African healers to mend mental scars"]}
{"comp": "ER_RC", "month": "May", "feats": "sbert", "test": 0.7161, "summ1": ["Hillary Clinton, 2020 Dems Celebrate Passage of the Orwellian Equality Act", "Transgender Athlete Smashes Four Women’s Powerlifting Records", "This Christian Student Was Taught Pro-Islam Propaganda and Forced to Write the Islamic Conversion Creed, the Shahada. The Thomas More Law Center Is Appealing to the Supreme Court to Prevent Islam From", "Netanyahu, Christian Leaders Praise Donald Trump’s Support for Israel’s Sovereignty Over the Golan Heights"], "summ2": ["House approves sweeping bill to expand gay rights", "In first for Asia, Taiwan approves same-sex marriage", "Teacher In LGBT Classes Row Leads Birmingham Pride", "‘You have to show up’: Community allies press Dallas police officials on crimes against transgender women"]}
{"comp": "C_L", "month": "May", "feats": "bow", "test": 0.716, "summ1": ["House approves sweeping bill to expand gay rights", "Poles stage protest rally in support of LGBT activist", "Taiwan MPs Urged to Back Government in Asia 1st Same-Sex Marriage Law", "Teens, superheroes lead charge in LGBTQ Hollywood movie characters"], "summ2": ["Donald Trump is preparing for Pride month by revving up his attacks on us", "House of Representatives approve Equality Act in historic move", "Pat Robertson: Gay Marriage Is 'Unnatural' Because No One Has Conceived A Child Through Anal Sex", "A Third Black Trans Woman Has Been Killed Just This Month"]}
{"comp": "ER_LC", "month": "Aug", "feats": "sbert", "test": 0.7145, "summ1": ["Dear Reps. Omar & Tlaib: Palestinian Authority Bans Pro-LGBT Activities In The West Bank — Is That Bigotry?", "Stacey Abrams Is an Election Fraud, Libs Don't Care About LGBTQ", "New Jersey Mayor Takes a Stand Against LGBT Curriculum in Public Schools — \"An Affront to God\" ⋆ Activist Mommy", "Ex-Transgender: Affirming Wrong Gender Is ‘Child Abuse’"], "summ2": ["In Pride Month, India’s LGBT community could be even prouder if it healed internal divisions", "Houston performers weigh in on Taylor Swift's 'Lover'", "Court rejects Kentucky's attempt to shirk legal fees in Kim Davis gay marriage case", "Marvel's The Eternals confirms openly gay character: 'He's married, he's got a family'"]}
{"comp": "C_R", "month": "Jan", "feats": "sbert", "test": 0.7141, "summ1": ["Supreme Court allows transgender military ban to be enforced", "Gay Brazilian lawmaker leaves job, country over death threats", "Survey: Offensive sexual jokes top harassment list at UN", "NY ban on conversion therapy is a win for humanity"], "summ2": ["New York's first openly gay congressman defends Tulsi Gabbard after she apologizes for anti-LGBT past", "Dear Trans People: Want to be Treated Normally? Stop Demanding Special Rights!", "Pence says criticism of wife’s job at anti-LGBT Christian school is ‘deeply offensive to us’", "The Rocky Horror Ideology Show"]}
{"comp": "ER_L", "month": "Jan", "feats": "bow", "test": 0.7121, "summ1": ["Alyssa Milano: ‘The Red MAGA Hat Is the New White Hood’", "Sweden’s New Leftist Govt Stops ‘Gender Equality Authority’ Being Scrapped", "Deaths of Black Men at Home of West Hollywood Donor Just the Latest in a Long Line of Dem Sex Scandals", "WATCH: Children as young as FIVE are being taught about homosexuality and sexual intercourse. · Caldron Pool"], "summ2": ["'Dangerous' Supreme Court Trump military transgender ban ruling condemned · PinkNews", "NYPD officers ‘humiliate trans woman and arrest her in pink handcuffs’", "Indiana senate passes bill requiring permission slip for students to learn about LGBT people", "Time for Tea/LGBTQ News: Kevin Hart on The Ellen DeGeneres Show"]}
{"comp": "ER_LC", "month": "Mar", "feats": "sbert", "test": 0.7098, "summ1": ["High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses", "Barbra Streisand, Pedophilia, and the Left's Slippery Slope of Sexual Deviancy", "Exclusive Audio: CAIR-LA Executive Director Announces Plans to Expand and Mobilize Muslim Community in 80 California Mosques", "Apple Bans Pro-Traditional Marriage App After Campaign From LGBT Group"], "summ2": ["Now is the Time to Pass the Equality Act", "Asia's first LGBT cinema hub launched in Taiwan", "Sam Smith comes out as non-binary: 'I'm not male or female'", "U.S. deaths from alcohol, drugs and suicide hit highest level since record-keeping began"]}
{"comp": "ER_LC", "month": "Jun", "feats": "bow", "test": 0.7082, "summ1": ["The LGBT agenda has now completely destroyed women’s sports as biological male wins NCAA women’s track championship… women’s rights being obliterated by the Left Cult", "Trump Celebrates LGBT Pride Month And Calls For Decriminalization of Homosexuality In Nations Where It Is Illegal", "It’s Not About Tolerance Anymore: LGBT Activists Say They Want Your Kid to See “Kink” at Pride Parades", "Are Abortion & Gay Rights American Values?"], "summ2": ["The Struggles of Rejecting the Gender Binary", "Celebrating LGBTQ Pride Month (in Photos)", "Gay couple beaten for refusing to kiss on London bus", "50 years after Stonewall, nothing has changed for LGBTIs in Egypt"]}
{"comp": "ER_LC", "month": "Sep", "feats": "sbert", "test": 0.708, "summ1": ["NFL QB Drew Brees Under Fire By LGBT Magazine For Pushing \"Bring Your Bible To School Day\"", "Trans Activist Discusses Genitals, Sexual Preferences With Children for BBC Program ⋆ Activist Mommy", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides", "Pedophilia, the Next Chapter in the 'Gay Marriage' Court Saga?"], "summ2": ["Clerics force cancellation of 'immoral' Beirut gay pride opening", "Bristol UKIP candidate John Langley is porn star", "Will LGBTQ Americans ever be treated equally?", "2020 Democratic Candidates Reach Out To LGBTQ Voters At Iowa Forum"]}
{"comp": "ER_RC", "month": "Jan", "feats": "bow", "test": 0.7069, "summ1": ["Neo-Nazi Rep. Ilhan Omar Defends Anti-Semitic Hate Group Which Calls for Death of Gays", "Democrats Refuse to Pay for Border Protection as Fed. Gov’t Gives 18K to Gay Movie Festival in India", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case", "Second Black Man Found Dead at Home of Ed Buck, Democrat Donor"], "summ2": ["Tulsi Gabbard apologizes for her past statement on LGBTQ", "North Dakota Senate votes down LGBT anti-discrimination bill", "NYPD cops used pink handcuffs to arrest transgender woman: suit", "Parliament: Singapore to review adoption law and look into surrogacy issue"]}
{"comp": "ER_RC", "month": "Jun", "feats": "bow", "test": 0.7062, "summ1": ["MSNBC Freaks Out Because Trump Won't Raise LGBTQ Flags At U.S. Embassies!", "The LGBT agenda has now completely destroyed women’s sports as biological male wins NCAA women’s track championship", "Is LGBT Propaganda Lurking In Your Homeschool Curriculum? ⋆ Activist Mommy", "Patrick Buchanan: Are Abortion & Gay Rights American Values?"], "summ2": ["US News: Preacher calls for execution of LGBTQ ‘freaks’", "Scheer won't march in Pride parades this year, but Conservatives say they fight for gay rights in 'many ways'", "Efforts to support LGBT residents spreading", "Hundreds gather at Stonewall 50 years after LGBTQ uprising"]}
{"comp": "C_R", "month": "Jul", "feats": "bow", "test": 0.7045, "summ1": ["Oglala Sioux Tribe legalizes same-sex marriage", "Slain Russian gay-rights activist had received threats: campaigner", "Israeli education minister favours gay 'conversion therapy'", "Millions celebrate LGBTQ pride in New York amid global fight for equality"], "summ2": ["WaPo Claims There's A 'Surge' In Right-Wing Terrorism. There Isn't", "U.S. Women's soccer star Ashlyn Harris calls Jaelene Hinkle homophobic", "‘Pride Summit’: Billboard & Hollywood Reporter Hosting Gay Awareness Bash", "Canadian Woman Forced to Close Business after Refusing to Wax a Trans Woman’s Genitals"]}
{"comp": "C_L", "month": "Feb", "feats": "sbert", "test": 0.7034, "summ1": ["Pride Center Again Barred from S.I. St. Patrick's Day Parade", "Kenya High Court delays ruling on law banning gay sex to May 24 -judge", "Methodists reject a proposal to allow openly gay clergy, same-sex marriage", "Jussie Smollett Chicago attack: 'Empire' actor charged with disorderly conduct for filing false police report, prosecutors say"], "summ2": ["This Republican told LGBTQ youth that homosexuality is equal to bestiality & pedophilia", "Meet the rabidly anti-gay HHS official behind Trump’s plan to defund Planned Parenthood", "‘Empire’ actor Jussie Smollett finally speaks out about his homophobic, racist assault", "The Golden Girls: The Lost Episodes presents a special Valentine Edition"]}
{"comp": "C_R", "month": "May", "feats": "sbert", "test": 0.7017, "summ1": ["Indonesian director calls for LGBT+ debate after film ban", "Buttigieg laments 'crisis of belonging' across nation during Human Rights Campaign speech", "House approves sweeping bill to expand gay rights", "Taiwan MPs urged to back government in Asia's first same-sex marriage law"], "summ2": ["Pete Buttigieg’s Obsession With ‘Fanatical’ Mike Pence Continues During Stephen Colbert Interview", "Transgender woman reveals the moment she came out at 24", "Mormon church opposes LGBT nondiscrimination measure", "Former LGBT Individuals To Hold A ‘Freedom March’ In DC"]}
{"comp": "ER_L", "month": "Jun", "feats": "sbert", "test": 0.701, "summ1": ["Lawmakers want to force churches to embrace LGBTQ ideology instead of the Bible", "“Open borders are the source of Europe’s strength”, says the UN Secretary-General", "Whistle-Blowing Mothers Threatened, Doxxed by Antifa for Exposing Drag Queen Event Teaching Graphic Sex to Teens", "Are Abortion and Gay Rights Really American Values?"], "summ2": ["Anti-LGBTQ Christian hate group cheers as Trump administration shuts down HIV cure research", "Billy Porter Arrived a Long Time Ago. The World Finally Caught Up.", "Finding Pride in the Magic of Gender", "Michelle Rodriguez: ‘Stonewall Is a Symbol for People Who Believe Love Is Ten Times More Powerful Than Hate’"]}
{"comp": "C_R", "month": "May", "feats": "bow", "test": 0.7009, "summ1": ["News Agency Reports Arrests Of LGBT Activists In St. Petersburg", "House approves sweeping bill to expand gay rights", "Bud Light launches rainbow bottles in support of LGBTQ rights", "Taiwan MPs urged to back government in Asia's first same-sex marriage law"], "summ2": ["Transgender Proponent of Mixed-Sex Showers, Locker Rooms Raped Deaf Woman: Johanna Wolf", "Nancy Pelosi’s \"Equality Act\" Would Undo Trump’s Most Significant Achievements", "Student gov’t at Texas Christian college votes to ban Chick-fil-A over LGBT record", "Protests against LGBT lessons spread across the UK"]}
{"comp": "ER_L", "month": "Sep", "feats": "bow", "test": 0.7003, "summ1": ["NFL QB Drew Brees Under Fire By LGBT Magazine For Pushing \"Bring Your Bible To School Day\"", "Pete Buttigieg: ‘I’m Not out to Be President of Gay America’", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides", "Transgender Activists Terrorize Women's Rape Crisis Center with Hateful Graffiti"], "summ2": ["Bosnians March In First LGBTQ Pride Parade Under Police Protection", "Trump claimed that gay people ‘like the job’ he’s doing. Yes, really", "Florida Trans Woman Bee Love Slater Found Burned to Death in Car", "‘Queer Eye’ Star Jonathan Van Ness Reveals He’s HIV-Positive"]}
{"comp": "L_R", "month": "Feb", "feats": "bow", "test": 0.6998, "summ1": ["Black History Month Includes Black Queer History, Too", "Trump called for an end to HIV in the US by 2030. That’s totally realistic.", "Who is Eric Porterfield? What has the anti-LGBT Republican lawmaker said? · PinkNews", "Tunisian man who reported rape and robbery is imprisoned for gay sex · PinkNews"], "summ2": ["Tennis legend and LGBT activist Martina Navratilova says allowing trans female athletes to compete as women is 'insane and cheating'", "Colo. House passes LGBT-inclusive sex ed bill blocking schools from teaching abstinence only", "Actor Chris Pratt Responds to Claims That His Church is 'Anti-LGBTQ'", "Chicago Police Superintendent BLASTS Jussie Smollett, Media, Celebs, Politicians In Press Conference"]}
{"comp": "C_L", "month": "Feb", "feats": "bow", "test": 0.6996, "summ1": ["Chicago police release 2 men questioned in Smollett case", "Living in Venezuela now is hard. Being LGBT+ makes it harder", "Wisconsin Supreme Court candidate once said gay rights ruling could lead to legalization of bestiality", "United Methodist delegates vote to keep ban on same-sex marriage, LGBT clergy"], "summ2": ["Bay Area Reporter :: New ED named for Compton's cultural district", "Kansas Lawmakers File a Bill Voiding Same-Sex Marriage That Reads Like an Anti-LGBTQ Manifesto of Hate", "Chris Pratt Says His Church is Not Anti-LGBTQ, Despite What Ellen Page Says", "Trump condemns 'horrible' attack on gay Empire star Jussie Smollett · PinkNews"]}
{"comp": "L_RC", "month": "May", "feats": "bow", "test": 0.6992, "summ1": ["Pose, Moonlight, and 7 Other LGBTQ+ Shows and Movies to Stream This May", "This U.S. sport organization just voted overwhelmingly to ban trans competitors", "Pete Buttigieg just destroyed Trump’s new insulting nickname for him", "Republican tries to rename Equality Act the ‘Forfeiting Women’s Rights Act’"], "summ2": ["Equality Act: House Democrats approve sweeping anti-discrimination bill to expand gay rights", "Taiwan becomes first country in Asia to legalize same-sex marriage", "United Conservative Party cancels gay conversion therapy ban working group", "Birmingham Council takes out injunction stopping parents protesting against LGBT lessons outside schools"]}
{"comp": "C_R", "month": "Jan", "feats": "bow", "test": 0.6975, "summ1": ["A whole lotta love: 26 mock weddings for Japanese lesbian couple", "Trump transgender troop limits can take effect, top court decides", "Anaheim council changes rules to allow pride flag to be displayed with city flag", "Oregon School Officials Who Discriminated Against Gay Kids Fired"], "summ2": ["ELLIS: Leftist 'Tolerance' And The Vicious Attack On Karen Pence", "Supreme Court lets Pentagon limit transgender military service while lawsuits proceed", "Tulsi Gabbard under fire for past anti-gay remarks amid 2020 bid, says she has since 'evolved'", "Second Black Man Dies In Democratic Mega-Donor’s Home, First Was A Male Sex Worker 17 Months Ago"]}
{"comp": "ER_RC", "month": "Feb", "feats": "bow", "test": 0.6974, "summ1": ["LGBT Teaching Program for Christian Kids is Apostasy from Biblical Belief", "CA Democrats Introduce LGBTQ Bill that would Protect Pedophiles who Rape Children", "FLASHBACK: Democrats Called Jussie Smollett Attack ‘Lynching’; NAACP Blamed Trump", "Another Fake Hate Crime: LGBTQ Activist Burns Down Own Home with Pets Inside"], "summ2": ["United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "Arkansas court rules city can't enforce LGBT protections", "Warsaw Kids Dance In Show Of LGBT Solidarity", "Large crowd for town hall on reported attacks against LGBTQ+ community"]}
{"comp": "ER_L", "month": "Sep", "feats": "sbert", "test": 0.6970000000000001, "summ1": ["NFL QB Drew Brees Under Fire By LGBT Magazine For Pushing \"Bring Your Bible To School Day\"", "Trans Activist Discusses Genitals, Sexual Preferences With Children for BBC Program ⋆ Activist Mommy", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides", "Pedophilia, the Next Chapter in the 'Gay Marriage' Court Saga?"], "summ2": ["Rapper shoots down gay rumors by saying “I like what I like,” tells fans to be better LGBTQ allies", "Mike Pence argued homosexuality was 'a choice' or 'learned behavior' during 1990s fight against gay rights ordinance", "Rio de Janeiro mayor bans Avengers comic book over gay kiss", "LGBT forum: Elizabeth Warren names the 18 black trans women murdered this year"]}
{"comp": "ER_LC", "month": "Jul", "feats": "bow", "test": 0.6966, "summ1": ["California's Graphic Sex Ed Curriculum Is Even Worse Than You Think ⋆ Activist Mommy", "SICK. AOC Starts Tweeting Out Quotes from Nazi Lover who Stole Treasures from European Jews", "US Women’s Soccer Player Chose God, Withdrew from Nat’l Team Over Jerseys Sporting Rainbow Colors", "Marianne Williamson: My Daughter Has 5 Gay Godfathers"], "summ2": ["PHOTOS: Millions celebrate LGBTQ pride in New York", "Just like the Pope, Dattatreya Hosabale of RSS gave the LGBT community hope – and then took it away", "Children with gender identity issues 'need help from all sides'", "Transgender teenager ‘gang-raped by three men’ on first night out as a female"]}
{"comp": "ER_RC", "month": "Mar", "feats": "bow", "test": 0.6964, "summ1": ["Is Sharia Law As Anti-Gay As Some Conservatives Claim? How About Freedom For Women and Non-Muslims?", "Chick-Fil-A Banned From San Antonio Airport For ‘Legacy Of Anti-LGBT Behavior’", "Houston Library Allows Drag Queen Sex Offender to Read to Children", "High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses"], "summ2": ["EXPLAINER: What the School Act and the Education Act say about LGBTQ student and employee rights", "Gay clergy, marriage ban causes rift for Methodists", "Gay people to be whipped or stoned to death under Sultan's new laws", "'Catalyst for change': LGBTQ advocate Stephanie Mott honored at Statehouse service"]}
{"comp": "ER_L", "month": "Mar", "feats": "bow", "test": 0.6959, "summ1": ["The LGBT Push to Add Glitter in Ash Wednesday Undermines the Meaning of Lent: Mortality and Repentance", "NEA President, Trans Advocate Push Gender Ideology on Kindergartners", "School stops LGBT lessons after backlash from angry muslim parents", "The Political Insider"], "summ2": ["Sally Field and her gay son are fighting for LGBT+ equality", "Alyssa Milano apologises for saying she’s trans, gay and a lesbian", "The 67 most stunning lines from Donald Trump's epic 2-hour CPAC speech", "Chick-fil-A gave over $1.8 million to anti-LGBTQ groups according to recent tax returns / LGBTQ Nation"]}
{"comp": "L_RC", "month": "Apr", "feats": "bow", "test": 0.6954, "summ1": ["LGBT Rights Are Under Attack. America Needs the Equality Act—Urgently", "Donald Trump says he’d like to run against Pete Buttigieg", "Chelsea Manning misgendered by NBC reporter", "A Trans Military Ban Will Not Erase Me"], "summ2": ["Supreme Court to Rule on Gay, Transgender Employment Rights", "Jason Kenney says UCP will oppose gay-straight alliance Bill 24", "LGBT activists protest at so-called gay conversion therapy church event", "With Lori Lightfoot victory, Chicago's LGBTQ community hopes to be 'more visible and more relevant'"]}
{"comp": "R_RC", "month": "Sep", "feats": "sbert", "test": 0.6947, "summ1": ["Becket busy defending Catholic foster care from LGBT allies", "WALSH: Drew Brees Is Being Attacked As ‘Anti-Gay.’ All He Did Was Promote The Bible.", "Calif. legislature approves measure criticizing pastors for not embracing LGBT identities", "'Two-spirit, neutrois penguin': Piers Morgan rips school program teaching '100 gender identities'"], "summ2": ["Local LGBT Film Fest opens, changes leadership", "President Nelson details church’s 2015, 2019 LGBT policies at BYU devotional", "Former Security Guard Indicted for Plotting to Bomb Las Vegas Synagogue", "Editorial: Lawmakers can act to make Ohio fair for gay and transgender people"]}
{"comp": "C_R", "month": "Sep", "feats": "sbert", "test": 0.6942, "summ1": ["Bosnians to march for Gay Pride - under heavy police protection", "Tony Dungy has 7 adopted kids living under his roof ages 3 to 18", "Japan grants long-term resident status to transgender foreign national for first time", "Chris Smith votes \"No\" on Violence Against Women Act - again."], "summ2": ["New York Times Cheers 12-Year-Old Drag Queen…", "Why This Christian T-Shirt Printer Has Unlikely LGBT Allies", "California Senate passes resolution calling on Christians to embrace LGBT", "'Two-spirit, neutrois penguin': Piers Morgan rips school program teaching '100 gender identities'"]}
{"comp": "L_RC", "month": "Jan", "feats": "bow", "test": 0.6939, "summ1": ["Who is Jaymes Vaughan, partner of CBB’s Jonathan Bennett?", "'Dangerous' Supreme Court Trump military transgender ban ruling condemned · PinkNews", "Karen Pence Teaches Art at Anti-LGBTQ School", "Another black man found dead in the home of wealthy white Democratic donor: report"], "summ2": ["News & Reporting", "Rising populism threatens LGBTQ in West and around the world", "Kevin Hart apologises again to LGBTQ community, Chris Rock doesn't want to host Oscars", "New House Speaker Dennis Bonnen says Texas lawmakers must focus on ‘real issues,’ not bathrooms"]}
{"comp": "C_L", "month": "Jun", "feats": "sbert", "test": 0.6915, "summ1": ["Same-sex marriages top 1,000 in month", "Lawmakers, Whitmer renew push to expand civil rights protections to Michigan’s LGBTQ residents", "Ministers condemn bishop's 'unchristian' call for boycott of LGBT pride events", "Thousands gather at Stonewall 50 years after LGBTQ uprising"], "summ2": ["Republicans don’t want to see the pride flag flying", "Quillette’s “Antifa Journalists” List Could’ve Gotten Me Killed", "Finding Pride in the Magic of Gender", "Jeremy Hunt backs LGBT-inclusive lessons in schools"]}
{"comp": "C_R", "month": "Jul", "feats": "sbert", "test": 0.6903, "summ1": ["Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "Philadelphia Homicide Rate Climbs, Highest In Over A Decade", "Flags, Chick-fil-A and the UMC: Thoughts By LGBTQ Teenagers", "Alabama sued in transgender driver’s license case"], "summ2": ["WATCH: U.S. Women's Soccer Player Attacks Trump: He's ‘Kind Of An Abuser’", "MPs vote to make same-sex marriage and abortion legal in Northern Ireland", "LGBTQ Activism May Be Turning into Overreach by Supporters", "Parents are left furious as Christian pupils aged just 10 are excluded from school for alleged homophobic remarks"]}
{"comp": "R_RC", "month": "Feb", "feats": "sbert", "test": 0.6902, "summ1": ["Ellen Page Speaks Out After Blaming VP Pence For Smollett Hate Crime. She’s Not Sorry.", "LGBTQ advocates up in arms over Tennessee bill that would prohibit indecently exposing yourself in a locker room designated for the 'opposite sex'", "Will Liberal Norah O’Donnell Replace Jeff Glor at CBS Evening News?", "WALSH: The Left Attacks 'Homophobia' In Christian Churches, Ignores Mosques. The Double Standard Is Insane."], "summ2": ["Historic Chicago election draws national spotlight, praise from black, LGBTQ communities: 'I think Chicago is potentially ready to turn the corner'", "Reinstate scrapped Ontario sex-ed curriculum, lawyers argue in human rights case", "United Methodist delegates defeat bid to ease LGBT bans", "Rapper Hard Kaur on her new song Poison: Freedom means not to be afraid. My art is my freedom"]}
{"comp": "C_ER", "month": "Sep", "feats": "bow", "test": 0.6889, "summ1": ["U.S. man in same-sex marriage sues Japan government for long-term visa", "Democrats hit Scalia over LGBTQ rights", "Court Ruling: Phoenix Artists Don't Have To Serve LGBT Couples", "Bosnians march in first Gay Pride under tight police protection"], "summ2": ["Maryland School District Adds Third Gender Option for Students, LGBT 'Safe Space' Classrooms", "Focus on the Family: Behavior of LGBT Groups Towards NFL’s Drew Brees Reeks of ‘Tyranny’", "Presidential Candidate Pete Buttigieg Causing Fractures in the LGBT Community for “Not Being Gay Enough” and a “Being a Gay White Man”", "What’s next? Acceptance of polygamy growing on left"]}
{"comp": "ER_L", "month": "May", "feats": "sbert", "test": 0.6883, "summ1": ["Hillary Clinton, 2020 Dems Celebrate Passage of the Orwellian Equality Act", "Pete Buttigieg Tells Liberal Jews U.S. Must Push Israel to Change Policies", "This Christian Student Was Taught Pro-Islam Propaganda and Forced to Write the Islamic Conversion Creed, the Shahada. The Thomas More Law Center Is Appealing to the Supreme Court to Prevent Islam From", "GOP Settles the Score on Girls Sports"], "summ2": ["Cuba LGBT+ activists arrested at ‘unauthorised’ Pride march", "Dan Levy is ushering in a new era of queer representation on TV", "Senator Who Blocked LGBT Woman’s Nomination Mocked for Saying Equality Act Is Unnecessary and ‘Divides Our Nation’", "LGBTQ People Will Die Thanks to Trump's Butt Kiss to Antigay Doctors"]}
{"comp": "L_RC", "month": "Jun", "feats": "sbert", "test": 0.6882, "summ1": ["Trump just shivved Mike Pence & he didn’t see it coming", "BREAKING: Trump Administration Omits LGBTQ People from 2020 Census", "Finding Pride in the Magic of Gender", "Lea DeLaria on Stonewall 50: ‘Change Comes From Perseverance, Dedication, and Balls. The Fight Continues.’"], "summ2": ["Israel Folau calls for trolls to stop attacks on Magda Szubanski over GoFundMe page", "Hundreds gather at Stonewall 50 years after LGBTQ uprising", "‘Fear and shame holding LGBT community back’", "Bhutan Has Another Reason To Celebrate As World’s Happiest Country Decriminalises Homosexuality"]}
{"comp": "ER_RC", "month": "Aug", "feats": "bow", "test": 0.6861, "summ1": ["Bernie Slams Trump Over Religious Freedom and LGBT Lives", "Palestinian Police Ban All LGBTQ Activities: Tlaib And Omar SILENT", "Rob Smith: The Left Abandoned Black and Gay Americans After Pulse Nightclub Massacre", "LGBT Leader: ‘Doubt Very Seriously’ Drag Queen Story Hour Draws ‘Predators'"], "summ2": ["Liberals question Scheer’s personal views on LGBTQ issues, though Tory Leader sticks to the law", "Trump Administration Argues Law Doesn’t Protect Gays From Workplace Bias", "Anti-LGBT discrimination is now official PA policy", "Kenney touts 'fiscal restraint' across government at 100 days in office"]}
{"comp": "L_R", "month": "Mar", "feats": "bow", "test": 0.6848, "summ1": ["Ralph Lauren features same-sex couple for first time in advert", "Utah bill banning conversion therapy dies after being replaced with toothless substitute", "Trump to host Brazil’s anti-gay president Jair Bolsonaro at White House", "Bay Area Reporter :: Project Inform has closed, sources say"], "summ2": ["South African court rules Dutch Reformed Church’s gay marriage ban is unconstitutional", "Texas AG investigating Chick-fil-A's exclusion at airport", "Birmingham Schools Cancel LGBT Equality Classes Due Muslim Parent Protests", "Martina Navratilova, Who Beat Communism, Got Eaten By The Trans Mob"]}
{"comp": "ER_LC", "month": "Feb", "feats": "sbert", "test": 0.6846, "summ1": ["And There It Is--> Final Piece of Jussie Smollett MAGA Assault Illusion Turns Out to be Complete Crap", "Report: Pope Knew of McCarrick’s Crimes, Considered Them Unimportant", "Actor Chris Pratt Under Attack Because His CHURCH Doesn’t Toe The LGBTQ Line", "Jackson Gay Rights Leader Accused of Burning Down Own Home"], "summ2": ["LGBTQ parents face 'state-sanctioned discrimination,' American Bar Association says", "NZDF celebrates 25 years of open LGBT+ service – New Zealand Defence Force – Medium", "Commentary: Church needs a vision of how sexual minorities fit into the Creator’s plans", "‘What a star he would be today’: the extraordinary musical legacy of Sylvester"]}
{"comp": "ER_L", "month": "Apr", "feats": "bow", "test": 0.6845, "summ1": ["Adopting Inclusion for Families of Faith", "David Hogg: Trump ‘Supports’ ‘Terrorism’ Against Black Churches", "Democrats file legislation to force all Americans to accept the LGBTQ agenda", "Female High School Students in Iowa Protest Trans Bathroom Rules After Feeling Violated"], "summ2": ["Anti-LGBTQ group Heritage Foundation has hosted four anti-trans panels so far in 2019", "Herland follows three women as they age into their glory days", "European Parliament backs calls for Brunei 'asset freezes and visa bans' · PinkNews", "Mayor Pete Buttigieg Will Keynote the 2019 Las Vegas Dinner"]}
{"comp": "ER_LC", "month": "Sep", "feats": "bow", "test": 0.6844, "summ1": ["Drew Brees Hammered as 'Anti-Gay' For Encouraging Christian Kids to Bring a Bible to School", "Pete Buttigieg: ‘I’m Not out to Be President of Gay America’", "Andrew Sullivan: Gay, Lesbian Kids Being Consumed by Transgenderism", "LGBT and Animal Rights Activists Can't Stop Customers From New Chick-Fil-A Opening! — Lines Wrapped Around Building"], "summ2": ["Bosnians march in first Gay Pride under tight police protection", "LGBT life in rural Ireland: ‘You can feel like you’re the only one’", "Top Philippine court refuses to legalise gay marriage", "Gay married couple say State Department denied child's citizenship claim, said she was born 'out of wedlock'"]}
{"comp": "ER_RC", "month": "Sep", "feats": "bow", "test": 0.6844, "summ1": ["LGBT Activists Seek to Destroy Christianity", "Pete Buttigieg: ‘I’m Not out to Be President of Gay America’", "Watch Some Vegans and Transvestites Protest the New Toronto Chick-fil-A", "UK’s National Health Service Now Offering Gender Transition Services to Children as Young as 3"], "summ2": ["A year since Section 377 repeal, how cafes in Kolkata celebrate LGBTQ community's spirit", "LGBT activist files new court challenge against gay-sex law", "President Nelson details church’s 2015, 2019 LGBT policies at BYU devotional", "Ayanna Pressley, AOC back anti-Straight Pride arrestees"]}
{"comp": "R_RC", "month": "Aug", "feats": "bow", "test": 0.6841, "summ1": ["Palestinian Authority Bans LGBTQ Organizing in West Bank", "Fake outrage over Trump’s ‘anti-LGBT’ Labor Department rule", "Court Backs Christian Videographers in Same-Sex Wedding Case", "As They Maim Children, Activists Claim Criticizing Them Kills Trans People"], "summ2": ["John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Thousands show support for LGBTQ community at Lubbock Pride", "U.S. Court Rules 1964 Civil Rights Law Also Protects LGBT Workers From Bias – Fortune", "Woman Denied Owning Meth In Body Cavity"]}
{"comp": "ER_L", "month": "Jul", "feats": "bow", "test": 0.6836, "summ1": ["US Women’s Soccer Player Chose God, Withdrew from Nat’l Team Over Jerseys Sporting Rainbow Colors", "Democrats Hire Anti-Trump Pastor to Recruit Evangelicals Ahead of 2020", "Amazon Just Banned the Books that Helped Thousands QUIT Homosexuality", "Mass Resistance Outs LGBTQ Library Event Sexualizing Children"], "summ2": ["Japan's First Out Gay Lawmaker Vows Same-Sex Marriage 'Will Happen'", "A History of Queer Direct Action", "Brighton Trans Pride’s ‘amazing turnout’ showcases ‘all that’s been achieved,’ says MP", "Even though ‘he’s racist as f*ck’: Black MAGA supporters explain why they still back Trump"]}
{"comp": "C_L", "month": "Sep", "feats": "bow", "test": 0.6831, "summ1": ["SOGIE: Hard questions over bill vs gender-based discrimination", "Stormy Daniels settles with Columbus, Ohio, for strip club arrest", "Arizona Supreme Court protects business' religious right to reject work for same-sex marriages", "Bosnians march in first Gay Pride under tight police protection"], "summ2": ["WATCH: Woman refuses to let interracial couple get married at her venue because it’s against her ‘Christian beliefs’", "Angelica Ross Will Be First Trans Person to Host Presidential Forum", "Trump’s gay press aide slammed for claiming Mike Pence isn’t ‘anti-gay’", "Malik Yoba Reveals His Attraction to Transgender Women"]}
{"comp": "C_L", "month": "May", "feats": "sbert", "test": 0.6826, "summ1": ["Support for gay rights seen growing in Singapore", "House approves sweeping bill to expand gay rights; conservatives call it attack on women, religion", "Pro-LGBT poster with revered icon stirs Poland", "Florida lawmakers leave gay marriage ban on books"], "summ2": ["Celebrity Big Brother 2018: Ann Widdecombe’s shocking views on gay and transgender people", "Ralph Nader: We Know Exactly Who Gave Us Trump", "Arizona news station uncritically gives Alliance Defending Freedom a platform to promote its anti-LGBTQ arguments", "‘Because He Is Black’ and ‘You Don’t Do Interracial Marriage’: Leaders of Nearly All-White Georgia Town Exposed"]}
{"comp": "C_LC", "month": "Aug", "feats": "sbert", "test": 0.682, "summ1": ["SOGIE bill respects religious freedom, Hontiveros says", "Archbishop warns of 'rainbow plague' amid LGBT tensions in Poland", "'Lock Her Up!' but no 'Send her Back!' chant at Trump rally in Ohio", "Record number of LGBTQ candidates running for office in Nashville"], "summ2": ["In Pride Month, India’s LGBT community could be even prouder if it healed internal divisions", "‘He gets it’: Evangelicals aren’t turned off by Trump’s first term", "Steven Universe's Rebecca Sugar on LGBTQ visibility in cartoons", "'Queer Olympix' banned in Istanbul"]}
{"comp": "C_L", "month": "Jul", "feats": "bow", "test": 0.6807, "summ1": ["Waco day care denies child admission after learning her parents are in same-sex marriage", "Millions celebrate LGBTQ pride in New York amid global fight for equality: organizers", "Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "Title VII Protects Us, LGBTQ Workers Tell Supreme Court"], "summ2": ["Meet the bigots who are trying to ruin Pride Month", "Viewers slam Newsnight for using ‘anti-trans’ professor during healthcare debate", "Mayor Pete wouldn’t be allowed to work at his own high school because he’s gay", "Even though ‘he’s racist as f*ck’: Black MAGA supporters explain why they still back Trump"]}
{"comp": "ER_R", "month": "Mar", "feats": "sbert", "test": 0.6805, "summ1": ["High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses", "The Political Insider", "O'Rourke — Trump Sought To Collude With Russia Beyond A Shadow Of A Doubt", "Satanic Temple: Gay Marriage is 'a Sacrament’"], "summ2": ["San Antonio Bans Airport Chick-Fil-A Due to 'Anti-LGBTQ Behavior'", "Dobson: Dems using 'Equality Bill' to snuff out Christianity", "‘Not fair’: World cycling bronze medalist cries foul after transgender woman wins gold", "Andrea Leadsom says parents should be allowed to choose when children learn about LGBT issues"]}
{"comp": "C_ER", "month": "Mar", "feats": "bow", "test": 0.6795, "summ1": ["Victory for Kenya's LGBT+ community as charity wins right to be recognized", "Kesha to headline Dan Reynolds' LGBTQ festival LOVELOUD", "Tennessee House passes contentious anti-discrimination bill", "Fractured after vote against LGBT clergy, weddings, United Methodists face possible split"], "summ2": ["The LGBT Push to Add Glitter in Ash Wednesday Undermines the Meaning of Lent: Mortality and Repentance", "‘I Feel Violated’: Teen Sues School After Transgender Student Allowed in Girl’s Locker Room", "Chris Evans: Mike Pence an ‘Obsequious Little Worm’ Trying to ‘Sanitize’ Trump’s Lies", "Buffalo, San Antonio ban Chick-Fil-A from airports over Christian views on LGBTQ agenda ⋆ Conservative Firing Line"]}
{"comp": "C_ER", "month": "Mar", "feats": "sbert", "test": 0.6788, "summ1": ["Appeals court reverses Warren County judge in transgender name change", "LGBT hospitality house to be established for 2020 Tokyo Games", "George Clooney calls for hotel boycott over Brunei LGBT death penalty", "LGBT Nondiscrimination Protections: Popular but Not Widely Adopted"], "summ2": ["CNN Blames Gay U.S. Ambassador for Death Threats He Receives", "Evidence Shows Sexual Orientation Can Change", "Liberal Teachers Now Pushing LGBTQ On Kindergartners", "High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses"]}
{"comp": "L_RC", "month": "Jun", "feats": "bow", "test": 0.6776, "summ1": ["9 LGBTQ+ People Explain How They Love, Hate, And Understand The Word \"Queer\"", "Andrew Sullivan: ‘What Drives Me Crazy Is the Attempt to Erase All Gay and Lesbian Activism Before Stonewall’", "Donald Trump ‘celebrates LGBT Pride month’", "This Republican pled guilty to paying two young boys for sex multiple times. Now he denies it all."], "summ2": ["Efforts to support LGBT residents spreading", "Scheer won't march in Pride parades this year, but Conservatives say they fight for gay rights in 'many ways'", "Hundreds gather at Stonewall 50 years after LGBTQ uprising", "Israel Folau GoFundMe page removal sparks furious reaction"]}
{"comp": "ER_L", "month": "Aug", "feats": "bow", "test": 0.6775, "summ1": ["Win for Christian couple threatened with jail time and huge fines if they don’t make pro-LGBTQ films", "Palestine BANS LGBTQ Activists. But You Don’t Hear A Peep From Omar, Tlaib, and AOC Do You?", "Rob Smith: The Left Abandoned Black and Gay Americans After Pulse Nightclub Massacre", "LGBT Leader: ‘Doubt Very Seriously’ Drag Queen Story Hour Draws ‘Predators'"], "summ2": ["Donald Trump Claims He’s Better For LGBT Americans Than Hillary Clinton", "City Council Crowd Erupts in Laughter When ‘Straight Pride’ Organizer Says ‘We’re a Totally Peaceful Racist Group’ — WATCH", "It’s the Misogyny, Stupid", "Fired for Being Trans or for Violating Dress Code? Supreme Court Will Decide."]}
{"comp": "ER_L", "month": "Jul", "feats": "sbert", "test": 0.6775, "summ1": ["Trans Predator Demands ‘Topless’ Party For 12-Yr-Olds", "LGBT Outlets Play the Victim After Amazon Banned Books By Renowned Clinical Psychologist Joseph Nicolosi ⋆ Activist Mommy", "Family Matters: How a US Member of Congress was Raised by the Red-Green Axis", "Schumer Accepted Thousands in Donations from Child Sex Trafficker Jeffrey Epstein"], "summ2": ["Charlize Theron announced that her 7-year-old is transgender", "Pastor Refuses Funeral for Dying Tennessee Man Because His Son Is Gay", "Huge majority of LGBT people in US think homophobia will hurt Buttigieg presidential bid", "UK Black Pride 2019: Best pics from LGBTQ celebration in London’s Haggerston Park"]}
{"comp": "R_RC", "month": "Aug", "feats": "sbert", "test": 0.6773, "summ1": ["Free Speech & Religious Freedom: Federal Court Upholds Constitutional Order", "Twitter Censoring Conservatives is Worse Than it Appears", "Ilhan Omar calls those who demand LGBT rights in Middle East ‘Deplorable’", "School system helped ruin Autistic girl’s life by reinforcing transgender identity AGAINST her parent’s wishes"], "summ2": ["A year after SC's Sec 377 order, LGBT+ community waits for inclusive laws", "Well-known entertainer charged with sexual assault", "To Canada, with Pride: LGBTQ refugees find a home where they can escape fear", "United Methodist progressives gather to discuss LGBTQ-friendly plan"]}
{"comp": "L_R", "month": "Sep", "feats": "bow", "test": 0.6772, "summ1": ["Mayor Pete ‘made history’ by talking about his coming out at the Democratic debate", "Trump claimed that gay people ‘like the job’ he’s doing. Yes, really", "NFL star dismisses outrage over his support of infamous anti-LGBT group: ‘I do not support any groups that discriminate’", "Walk, walk, fashion baby! Here’s the hottest looks from London’s first-ever all-trans fashion show"], "summ2": ["Federal judge sides with Christian orgs in LGBT adoption case", "BBC teaching kids 100 genders exist, can go to prison for 'disrespecting' gender identities", "LGBTQ attack Drew Brees for supporting 'Bring your Bible to school' program", "CNN to Host a Presidential Town Hall on LGBTQ Issues"]}
{"comp": "LC_R", "month": "Jun", "feats": "sbert", "test": 0.6767, "summ1": ["Teens on growing up LGBTI in Iran: 'My boyfriend was killed'", "Pride Month 2019: All the brands giving back to LGBT+ charities", "Julie Bindel: It's not me. It's you", "'Here, I feel free': Mexico City celebrates role as haven for LGBTQ migrants"], "summ2": ["The Nation Defends Rapinoe Protest, Ridicules 'Christianists,' Administration Opposing LGBT Rights", "Lesbian ponies coming to Discovery Family kids show", "Warren Comes Out For 'Gay Reparations'", "No, minister. Most parents DON’T approve of gay sex lessons in primary schools"]}
{"comp": "C_ER", "month": "Aug", "feats": "bow", "test": 0.6761, "summ1": ["Log Cabin Republicans endorse Trump", "U.S. judge allows first transgender person to sue under disability law", "New genetic links to same-sex sexuality found in huge study", "Three federal leaders march together at Vancouver Pride"], "summ2": ["Palestinian Authority Bans LGBTQ Community from Holding Events", "Bernie Slams Trump Over Religious Freedom and LGBT Lives", "CNN's Don Lemon Sued For Allegedly 'Vigorously Rubbing His Genitalia' Then Sticking His Fingers in a Man's Face", "New Study Pokes Massive Hole in the 'Born This Way' Theory"]}
{"comp": "L_R", "month": "Apr", "feats": "bow", "test": 0.6752, "summ1": ["Not Queer, Just Gay. No, Thanks.", "Donald Trump says he’d like to run against Pete Buttigieg", "A Trans Military Ban Will Not Erase Me", "Dua Lipa supports Brunei boycott as gay sex death penalty becomes law · PinkNews"], "summ2": ["Supreme Court to decide whether federal sex discrimination law protects LGBT workers", "Parents sue son's Connecticut school for 'unfairly' suspending him over 'conservative' views", "Pete Buttigieg targets VP Mike Pence while speaking on homosexuality: 'Your quarrel, sir, is with my creator'", "California airport to open a Chick-fil-A — but city council isn’t happy: Make it the ‘gayest Chick-fil-A in the country’"]}
{"comp": "ER_R", "month": "Mar", "feats": "bow", "test": 0.6749, "summ1": ["Is Sharia Law As Anti-Gay As Some Conservatives Claim? How About Freedom For Women and Non-Muslims?", "Houston Library Allows Drag Queen Sex Offender to Read to Children", "Buffalo, San Antonio ban Chick-Fil-A from airports over Christian views on LGBTQ agenda ⋆ Conservative Firing Line", "High School Student Suspended for Responding to LGBT Pride Flags with Bible Verses"], "summ2": ["Supreme Court to Force 50 States to Follow Its Ruling on Same-sex Marriage", "San Antonio bars Chick-fil-A from airport, cites 'legacy of anti-LGBT behavior'", "School Teaches 5-Year-Olds About Transgenderism WO Telling Parents", "LGBTQ group severs ties with tennis great Martina Navratilova after remarks on trans athletes"]}
{"comp": "C_L", "month": "Jan", "feats": "sbert", "test": 0.6729, "summ1": ["Court will take up Phoenix’s anti-discrimination ordinance", "Intersex people should not live in 'fear of humiliation': UK minister", "Gay Indiana mayor joins field of Democratic presidential hopefuls", "Report: Killings of LGBT People in US Rose to Record in 2016"], "summ2": ["The Steven Universe season finale was about trans people, fans say", "LGBTQ leaders warned about a Trump presidency. Two years later, it’s clear they were right. – ThinkProgress", "Internet pastor: Don't masturbate because it's gay sex", "Applause as AOC, Porter, Pressley, and Tlaib Head to House Financial Services Committee"]}
{"comp": "L_RC", "month": "Mar", "feats": "bow", "test": 0.6724, "summ1": ["Ralph Lauren features same-sex couple for first time in advert", "Why You Should Stop Saying ‘Committed Suicide’", "Trump to host Brazil’s anti-gay president Jair Bolsonaro at White House", "Religious Refusal Bill Prepped to Grant Texans License to Discriminate"], "summ2": ["Texas AG: Did San Antonio airport discriminate when it banned Chick-fil-A for 'anti-LGBTQ behavior'?", "Officials at Aurora Methodist church speak out in support of LGBTQ community", "EXPLAINER: What the School Act and the Education Act say about LGBTQ student and employee rights", "The Coming Out Monologues celebrates its 10th anniversary by featuring stories from LGBTQ+ refugees"]}
{"comp": "C_R", "month": "Jun", "feats": "bow", "test": 0.6718, "summ1": ["New York police commissioner apologizes for Stonewall raid in 1969", "Knox County Commission punts on denouncing threats against LGBTQ community", "O'Rourke eyes transgender troop ban, Equality Act in LGBTQ rights protection plan", "Thousands join gay pride parades around the world"], "summ2": ["It’s Not About Tolerance Anymore: LGBT Activists Say They Want Your Kid to See “Kink” at Pride Parades", "Jack Phillips faces third lawsuit over refusal to make gender transition cake", "'Liberalism's had its day', boasts Putin", "REPORT: Trump Admin Says No To Flying Pride Flags On U.S. Embassy Flagpoles"]}
{"comp": "L_RC", "month": "Jan", "feats": "sbert", "test": 0.6718, "summ1": ["Bay Area Reporter :: Lara breaks through pink ceiling", "Trump Attacked LGBT Rights in 2018, and He’s Far From Done", "Covington Catholic School Student Says Wearing Blackface Was Showing 'School Spirit'", "Watch this heartwarming short film about queer love and acceptance"], "summ2": ["U.S. Senate Democrat/.Kamela Harris Anti-Catholic Bigotry is Exposed", "AIDSfree appeal: Gay sex may be legal but lingering stigma means men won’t seek help", "Trump Is Right About One Thing: 'The Economy Does Better Under The Democrats'", "Ontario government’s lawyer says teachers can use own judgment in sex-ed lessons"]}
{"comp": "ER_LC", "month": "Jan", "feats": "bow", "test": 0.6713, "summ1": ["Neo-Nazi Rep. Ilhan Omar Defends Anti-Semitic Hate Group Which Calls for Death of Gays", "WATCH: Children as young as FIVE are being taught about homosexuality and sexual intercourse. · Caldron Pool", "Donald Trump Bets It All in Televised 8-Minute Address from Oval Office", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"], "summ2": ["Ellen DeGeneres defends Kevin Hart, tries to win him back Oscars hosting gig", "European human rights court rejects gay marriage bid", "City Schools Up Resources on LGBTQ Issues - The Villager", "Former Obama-era LGBTI liaison announced as new PFLAG chief"]}
{"comp": "L_RC", "month": "Aug", "feats": "bow", "test": 0.6711, "summ1": ["Head Back To School With LGBTQ Competency", "Straight Pride Organizer Says ‘White Caucasians’ Founded U.S. – Her Gay Son Calls Parade ‘Dog Whistle’ to White Supremacy", "Trump Dodges and Gives an Accidentally Revealing Answer When Confronted on His Anti-LGBT Policies", "Sigh. Fox News goes after Taylor Swift over endorsement of LGBTQ protections."], "summ2": ["Palestinian Authority bans LGBTQ activity in West Bank", "A year after SC's Sec 377 order, LGBT+ community waits for inclusive laws", "Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "To Canada, with Pride: LGBTQ refugees find a home where they can escape fear"]}
{"comp": "C_L", "month": "Jul", "feats": "sbert", "test": 0.6709999999999999, "summ1": ["Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "Philadelphia Homicide Rate Climbs, Highest In Over A Decade", "Flags, Chick-fil-A and the UMC: Thoughts By LGBTQ Teenagers", "Alabama sued in transgender driver’s license case"], "summ2": ["Hey, Obama boys: Back off already!", "This priest allegedly exposed himself to a teen who came out during confession", "Meet the bigots who are trying to ruin Pride Month", "The Cats trailer is here and the internet is terrified"]}
{"comp": "C_L", "month": "Jun", "feats": "bow", "test": 0.6709, "summ1": ["New York police commissioner apologizes for Stonewall raid in 1969", "Emerging Consensus on LGBT Issues: Findings From the 2017 American Values Atlas", "Georgia's first Pride march will go ahead, organizers vow after threats", "Fountain Valley Bans Flying Gay Pride Flag On City Property"], "summ2": ["Happy birthday, Mr President: 33 times Trump was anti-LGBT this past year", "Inside Her Story: Black Trans Women Deserve Safety", "50+ Queer Writers, 50+ Favorite Queer Films", "Michelle Rodriguez: ‘Stonewall Is a Symbol for People Who Believe Love Is Ten Times More Powerful Than Hate’"]}
{"comp": "L_R", "month": "Jun", "feats": "bow", "test": 0.6707, "summ1": ["Donald Trump sued over plan to discriminate against LGBT families · PinkNews", "New York Pride: Huge LGBT parade marks 50 years since Stonewall – PinkNews – Gay news, reviews and comment from the world's most read lesbian, gay, bisexual, and trans news service", "Our Common Quest for Autonomy and Dignity: Reproductive Rights and LGBTQ Equality", "Straight Oklahoma Country Boy’s Pride Month Pickup Truck Goes Viral"], "summ2": ["Are Abortion, Gay Rights American Values?", "Sadiq Khan brands Donald Trump a 'poster boy for racists'", "White House tells U.S. embassies overseas they CAN'T fly rainbow flag with the stars and stripes", "Christian Cake Baker’s Attorney: 3rd Lawsuit Is ‘Rehash’ of ‘Old Claims’"]}
{"comp": "ER_LC", "month": "Aug", "feats": "bow", "test": 0.6703, "summ1": ["Palestinian Police Bans All LGBTQ Activities And Guess What? Tlaib And Omar SILENT", "Bernie Slams Trump Over Religious Freedom and LGBT Lives", "Rob Smith: The Left Abandoned Black and Gay Americans After Pulse Nightclub Massacre", "Children are LGBTQ's Main Target Now"], "summ2": ["Gay marriage bill may lead to 'lesbian queen and artificially inseminated heir'", "Vegas man accused of plotting to bomb synagogues, LGBTQ bar", "Trump administration says transgender workers aren't protected by civil rights, Supreme Court filing reveals", "Ariana Grande returns to Manchester to play poignant Pride show"]}
{"comp": "ER_R", "month": "Sep", "feats": "sbert", "test": 0.6694, "summ1": ["Finland: Christian PM Under Police Hate Crime Investigation After Posting Bible Verse", "UK’s National Health Service Now Offering Gender Transition Services to Children as Young as 3", "Americans for Truth", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides"], "summ2": ["New York Times: 'Meet the Rising Drag Stars of America. They’re Tweens'", "California Senate passes resolution calling on Christians to embrace LGBT", "Ministers failed to tackle LGBT schools row because they are 'posh white men who went to Eton', former integration tsar suggests", "Florist Asks High Court to Uphold Right to Decline Order for Gay Wedding"]}
{"comp": "C_RC", "month": "May", "feats": "sbert", "test": 0.669, "summ1": ["Indonesian director calls for LGBT+ debate after film ban", "House approves sweeping bill to expand gay rights", "Taiwan gay couples plan weddings even as opponents fight back", "Controversial preacher stops in Vermont, meets with protesters"], "summ2": ["House approves sweeping bill to expand gay rights", "Maajid Nawaz Shuts Down Caller Who Likened Teaching LGBT Equality To \"Beating Your Wife\"", "LGBTQ students at Baylor want to form a campus group and the Southern Baptist university should say yes", "Federal election 2019: Liberal Gurpal Singh’s paedophilia comments slammed"]}
{"comp": "L_RC", "month": "Feb", "feats": "bow", "test": 0.6679999999999999, "summ1": ["Ellen Page emotionally slams Trump administration for 'causing suffering' · PinkNews", "Tunisian man who reported rape and robbery is imprisoned for gay sex · PinkNews", "Anti-LGBT County Clerk Kim Davis Ordered to Pay $225,000 for Violating Civil Rights", "Black Queer Resiliency Will Guide Us Through Black History Month"], "summ2": ["United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "More delays on protecting LGBT+ students", "Nikki Joly, transgender gay-rights activist, set own home on fire in hate-crime hoax, police say", "Arkansas justices rule city can’t apply law on gender bias"]}
{"comp": "R_RC", "month": "Feb", "feats": "bow", "test": 0.6678, "summ1": ["Democrat Senator Asks Judicial Nominee to Answer Whether Gay Marriage Is ‘Sinful’", "Report: Jussie Smollett Paid Brothers to Stage Fake MAGA Attack", "Tennis legend and LGBT activist Martina Navratilova says allowing trans female athletes to compete as women is 'insane and cheating'", "Actor Chris Pratt Responds to Claims That His Church is 'Anti-LGBTQ'"], "summ2": ["United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "Court rules for religious student group in clash between LGBTQ, religious rights", "Nikki Joly, transgender gay-rights activist, set own home on fire in hate-crime hoax, police say", "All the companies in Jeff Bezos’s empire, in one (large) chart"]}
{"comp": "ER_L", "month": "Feb", "feats": "bow", "test": 0.6673, "summ1": ["And There It Is--> Final Piece of Jussie Smollett MAGA Assault Illusion Turns Out to be Complete Crap", "United Methodist Church Affirms God’s Plan for Sexuality and Marriage", "Transgender Activist Accused of Burning Down Own Home, Killing 5 Pets in Hate Hoax Crime", "AGAIN: Transgender Athletes Dominate at Connecticut Girls' Track State Meet"], "summ2": ["This Groundbreaking Film Is The First Bollywood Blockbuster To Show A Lesbian Romance", "Kansas Lawmakers File a Bill Voiding Same-Sex Marriage That Reads Like an Anti-LGBTQ Manifesto of Hate", "Stacey Abrams says LGBT people are 'under attack' in State of the Union response · PinkNews", "Bay Area Reporter :: SF supes set to OK leather parklet permit"]}
{"comp": "L_R", "month": "May", "feats": "bow", "test": 0.6672, "summ1": ["Human Rights Campaign", "Trump issues ‘freedom to discriminate’ healthcare order", "Women Photobomb Anti-LGBTQ+ Politician With Kiss Selfie", "In Idaho, Republican Lawmakers Block Bill Banning Child Marriage"], "summ2": ["Brazilian president cancels New York trip under pressure from DeBlasio", "A misnamed legal jackhammer strikes", "Student gov’t at Texas Christian college votes to ban Chick-fil-A over LGBT record", "Judge backs parents who sent transgender son, 4, to school in girl's uniform"]}
{"comp": "LC_R", "month": "Jan", "feats": "bow", "test": 0.6672, "summ1": ["Japanese legislator condemned for making anti-LGBTI comments", "Nancy Pelosi, a Woman in Control, Is a Rival Who Flummoxes Trump", "We Can’t Talk About Bohemian Rhapsody Without Talking About Bryan Singer", "City Schools Up Resources on LGBTQ Issues - The Villager"], "summ2": ["DC restaurant fined $7k for questioning transgender who used women's restroom", "CNN Grills Rep. Omar On Tweet Accusing Lindsey Graham Of Being ‘Compromised’", "Tulsi Gabbard under fire for past anti-gay remarks amid 2020 bid, says she has since 'evolved'", "LGBT-driven 'Fairness for All' adopted by evangelical organization will be 'special rights for a few'"]}
{"comp": "ER_RC", "month": "May", "feats": "bow", "test": 0.6663, "summ1": ["Lesbian teacher admits she 'hides' LGBTQ issues in math classes: 'I just tell their parents, I'm teaching your kid division.' · Caldron Pool", "Cher Urges ‘LGBTQ Friends to Mobilize’ Because ‘Trump’s Pulled the Plug on Democracy’", "Buttigieg on Privilege: I ‘Check Myself’ to Understand Advantages of ‘Whiteness or Maleness’", "LGBT ignores, denies and attacks biblical truth while claiming they are being assaulted"], "summ2": ["New Naper Pride founders want group to be family-focused celebration of LGBTQ residents in Naperville", "Gay couples in Taiwan plan mass wedding registration after same-sex marriage legalised", "House approves sweeping bill to expand gay rights", "Exclusive: Timing of legal challenge against Boris Johnson a 'worry', Dominic Raab tells ITV News"]}
{"comp": "ER_RC", "month": "Jul", "feats": "bow", "test": 0.6657, "summ1": ["Christian Soccer Star Who Refused to Celebrate LGBT Agenda Was Kept Off of U.S. Women’s Team, Report Says", "Chad Felix Greene: Why the LGBT Left Promotes the Sexualization of Children", "Muslim Woman Attacks Gay Man Over Rainbow Flag Puts Liberals in a Pickle", "NYC Public Students Can Change Gender, Name Without Documentation"], "summ2": ["Bhutan LGBT community celebrates after homosexuality is decriminalised", "Stepping into the breach: St. Albert debates ban on conversion therapy after province declines", "LGBTQI activist Laurent McCutcheon died on Thursday after battle with cancer", "Poll: Share of young adults comfortable with LGBTQ people drops from 63% to 45%"]}
{"comp": "L_R", "month": "Jun", "feats": "sbert", "test": 0.6639, "summ1": ["No Shade, But There’s a Wrong Way to Make a Gay Anthem", "Disgusted truckers turn on Trump after their taxes skyrocket $8,000 while Wall Street gets lavished", "Finding Pride in the Magic of Gender", "Living With HIV for 35 Years—and Just Getting Started"], "summ2": ["The Nation Defends Rapinoe Protest, Ridicules 'Christianists,' Administration Opposing LGBT Rights", "Kirsten Gillibrand Panders to LGBT Community During Pride Month", "Warren Comes Out For 'Gay Reparations'", "No, minister. Most parents DON’T approve of gay sex lessons in primary schools"]}
{"comp": "R_RC", "month": "Jan", "feats": "bow", "test": 0.6636, "summ1": ["Democratic 2020 hopeful Rep. Tulsi Gabbard apologizes for past anti-gay beliefs, blames conservative upbringing", "Episcopal Church head Michael Curry punishes NY bishop who won’t allow gay marriage in diocese", "Transgender Republicans 'completely devastated' by Trump's LGBTQ switch", "Hillary donor is pictured with homeless black man he called 'n****r' and injected with meth"], "summ2": ["Gay rights champion makes legal challenge against Section 377A", "Rising populism threatens LGBTQ in West and around the world", "‘Most of them are gay’: Duterte urges Vatican to allow its ‘useless’ priests to have boyfriends", "Kevin Hart apologises again to LGBTQ community, Chris Rock doesn't want to host Oscars"]}
{"comp": "L_R", "month": "Jan", "feats": "bow", "test": 0.6635, "summ1": ["The Super Bowl is set to have its first ever openly gay cameraman · PinkNews", "US Supreme Court allows Trump transgender military ban", "An evangelical group is trying to strip LGBTQ protections from an anti-lynching bill", "Why You Should Care That Karen Pence Is Teaching At A Homophobic School"], "summ2": ["MSNBC anchor implies that Trump is blackmailing Lindsey Graham over extreme secret", "Tulsi Gabbard under fire for past anti-gay remarks amid 2020 bid, says she has since 'evolved'", "UK's first pregnant man reveals emotional trauma of being transgender and giving birth", "Showdown over Ontario’s sex-ed curriculum lands in court"]}
{"comp": "ER_L", "month": "May", "feats": "bow", "test": 0.6634, "summ1": ["NUTS: Democrats Vote Unanimously to Force Schools to Include Biological Males in Women's Sports", "Pete Buttigieg Tells Liberal Jews U.S. Must Push Israel to Change Policies", "Alabama Pushes Back Against LGBT Agenda, Bans Show Promoting Homosexuality To Kids", "Alec Baldwin Declares Lindsey Graham ‘Trump’s Fluffer’"], "summ2": ["Republicans stall LGBT+ rights law by making clerk read entire the bill", "Chick-fil-A may be on chopping block at two universities as opposition to its anti-LGBT record grows", "Civil rights groups sue Trump administration over new religious conscience rule for health providers", "Connie Kopelov, Member of First Same-Sex Couple Wed in NYC, Dies at 90"]}
{"comp": "R_RC", "month": "Jun", "feats": "sbert", "test": 0.6629999999999999, "summ1": ["The Nation Defends Rapinoe Protest, Ridicules 'Christianists,' Administration Opposing LGBT Rights", "Lesbian ponies coming to Discovery Family kids show", "Warren Comes Out For 'Gay Reparations'", "No, minister. Most parents DON’T approve of gay sex lessons in primary schools"], "summ2": ["‘Fear and shame holding LGBT community back’", "Israel Folau GoFundMe: Anti-Izzy crowd funding page gains momentum", "'A matter of great importance': Palm Springs men remember police raid at Stonewall Inn", "Bhutan Has Another Reason To Celebrate As World’s Happiest Country Decriminalises Homosexuality"]}
{"comp": "ER_L", "month": "Jun", "feats": "bow", "test": 0.6628, "summ1": ["MSNBC Freaks Out Because Trump Won't Raise LGBTQ Flags At U.S. Embassies!", "The LGBT agenda has now completely destroyed women’s sports as biological male wins NCAA women’s track championship… women’s rights being obliterated by the Left Cult", "One Nation and One People?", "Whistle-Blower: Middle School Curriculum Teaches 10-Year-Olds To Do Oral, Anal, Put Condoms on Dildos"], "summ2": ["Paid Leave Is an LGBTQ Issue", "It's time for a less compromising queer activism—and media", "The Empire State Building is getting a Pride month makeover", "Greg Rikaart: ‘The Freedom I Have as a Gay Man, Husband and Father Is Fully Because of Stonewall’s Pioneers’"]}
{"comp": "ER_L", "month": "Feb", "feats": "sbert", "test": 0.6628, "summ1": ["Poland Will Legalize Gay Marriage Within 10 Years", "Report: Pope Knew of McCarrick’s Crimes, Considered Them Unimportant", "Jackson Gay Rights Leader Accused of Burning Down Own Home", "JUSSIE SMOLLETT LIED! HATE HOAXER EXPOSED -- Faked ATTACKERS were BLACK MEN FROM NIGERIA!... NOT WHITE MAGA SUPPORTERS"], "summ2": ["Netflix orders Jim Parsons-produced Special, a comedy series about a gay man", "West Virginia GOP legislator compares LGBTQ community to terrorists & the KKK", "Janelle Monáe Dedicates Grammy Noms to 'Trans Brothers and Sisters'", "Pat Robertson: The LGBT community’s ‘weird way of doing sex’ will destroy the fabric of society"]}
{"comp": "ER_LC", "month": "Apr", "feats": "bow", "test": 0.6628, "summ1": ["The Catholic Classical School Lyceum Files a Groundbreaking Lawsuit Opposing LGBT Sexual Orientation-Gender Identity Laws in South Euclid, Ohio. This First Amendment Lawsuit Could Change the Rules of", "Parents Threaten To Withdraw Hundreds Of Children From Second UK School Over LGBT+ Lessons", "David Hogg: Trump ‘Supports’ ‘Terrorism’ Against Black Churches", "We Don't Hate You, We Love You!"], "summ2": ["Supreme Court to decide whether gay, transgender workers are protected by anti-discrimination laws", "The LGBT Community: Sheep Advocating For Butchers", "Brunei defends death by stoning for gay sex in letter to EU", "The Latest: LGBTQ parents' group applauds Mormon change"]}
{"comp": "C_L", "month": "Apr", "feats": "bow", "test": 0.6624, "summ1": ["Supreme Court to decide if LGBT workers protected under sex discrimination law", "Plan with LGBT bans OK'd by United Methodist judicial panel", "Mormon Church reverses policy against children of gay parents", "Buttigieg to Pence: My marriage 'has moved me closer to God'"], "summ2": ["Please oppose two religious privilege bills in Texas House", "15-year-old Nigel Shelby dies by suicide after homophobic bullying", "Donald Trump says he’d like to run against Pete Buttigieg", "This LGBTQ non-profit is accepting “reparations” from folks who still eat at Chick-Fil-A / LGBTQ Nation"]}
{"comp": "L_R", "month": "Mar", "feats": "sbert", "test": 0.6618, "summ1": ["Senate Confirms Trump Court Pick Who Repeatedly Weakened Voting Rights", "Terrence Higgins Trust slams The Sun's 'irresponsible, inaccurate' HIV headline · PinkNews", "Lena Waithe’s “Boomerang” Is Bringing a Gay Reckoning to BET", "Chick-fil-A donated to anti-LGBTQ group that bars employees from ‘homosexual acts’ – ThinkProgress"], "summ2": ["British Overseas Territories could be forced to recognise gay marriages after landmark ruling", "Mo Brooks Was Right About Nazis, Socialists And Democrats", "School Board Scolds Parents for Opposing Drag Queen’s Makeup Lesson", "San Antonio Airport Bans Chick-fil-A Over Anti-Gay Accusations"]}
{"comp": "L_RC", "month": "Mar", "feats": "sbert", "test": 0.6616, "summ1": ["Trump's Judicial Nominees Aren't Just Ideologues. They're Really Young.", "Chick-fil-A donated to anti-LGBTQ group that bars employees from ‘homosexual acts’ – ThinkProgress", "Man contracts HIV while taking PrEP ‘on demand’", "Commemorate the Trans Day of Visibility with these 5 excellent films"], "summ2": ["EXPLAINER: What the School Act and the Education Act say about LGBTQ student and employee rights", "'Where are we going as a church?' In Dallas area, we Methodists have seen this anti-LGBTQ rerun too often", "Worthington is latest central Ohio city to push for LGBTQ protections", "In Muslim Malaysia, uproar over LGBT groups at Women's Day march"]}
{"comp": "ER_R", "month": "May", "feats": "bow", "test": 0.6614, "summ1": ["Cher Urges ‘LGBTQ Friends to Mobilize’ Because ‘Trump’s Pulled the Plug on Democracy’", "Anal Aardvark: Alabama Bans Episode of Children Show Featuring Gay Marriage", "LGBT Ignores, Denies and Attacks Biblical Truth While Claiming They are Being Assaulted", "Lesbian teacher admits she ‘hides’ LGBTQ issues in math classes: ‘I just tell their parents, I’m teaching your kid division.’"], "summ2": ["Chick-fil-A Bill -- Texas LGBTQ Caucus Kills 'Save Chick-fil-A' Bill", "Brazilian president cancels New York trip under pressure from DeBlasio", "Is Christianity harmful to sexual minorities? Ex-lesbian says no, it's an 'invitation to true love'", "Taiwan becomes first country in Asia to legalize same-sex marriage"]}
{"comp": "ER_LC", "month": "May", "feats": "bow", "test": 0.6614, "summ1": ["NUTS: Democrats Vote Unanimously to Force Schools to Include Biological Males in Women's Sports", "Pete Buttigieg Tells Liberal Jews U.S. Must Push Israel to Change Policies", "Alabama Pushes Back Against LGBT Agenda, Bans Show Promoting Homosexuality To Kids", "Alec Baldwin Declares Lindsey Graham ‘Trump’s Fluffer’"], "summ2": ["New Trump Rule Protects Health Care Workers Who Refuse Care For Religious Reasons", "Taiwan approves same-sex marriage in first for Asia", "Indonesian ex-police brigadier says he was fired for being gay", "Doris Day, Hollywood actress and singer, dies aged 97"]}
{"comp": "C_L", "month": "Jan", "feats": "bow", "test": 0.6612, "summ1": ["A whole lotta love: 26 mock weddings for Japanese lesbian couple", "Bernie Sanders' Ratings and Endorsements", "Kirkland, Latham and Wilmer Fight Trump's Transgender Troop Ban at SCOTUS", "U.S. appeals court says Title VII covers discrimination based on sexual orientation"], "summ2": ["Lady Gaga calls Mike Pence the ‘worst’ Christian for anti-LGBT stance", "5 queer artists to look out for in 2019", "South Dakota Lawmakers Kill Bill Targeting Trans Student Athletes", "Time for Tea/LGBTQ News: Kevin Hart on The Ellen DeGeneres Show"]}
{"comp": "L_RC", "month": "Apr", "feats": "sbert", "test": 0.6593, "summ1": ["Pete Buttigieg Shows It’s Possible To Be LGBT, Christian, and Proud", "'Good Girls' Trans Coming Out Story Is Groundbreaking for Network TV", "Commonwealth chief says Brunei ‘death to gays’ law violates human rights", "House Panel Moves to Hold Ex-White House Official in Contempt for Following Trump Admin’s Instructions Not to Testify"], "summ2": ["'Drag story time' event for children cancelled at Dublin library after backlash", "Methodists uphold bans on LGBT clergy, nuptials", "Supreme Court to take up LGBT job discrimination cases", "Alberta doesn’t hate the NDP as much as you’d think"]}
{"comp": "C_ER", "month": "Apr", "feats": "bow", "test": 0.6588, "summ1": ["Buttigieg to Pence: My marriage 'has moved me closer to God'", "Supreme Court takes up major gay, transgender job discrimination cases", "'Door, please!': Sarajevo to host Bosnia’s first-ever LGBTQ pride parade", "Tennessee bill would allow adoption groups to turn away gays"], "summ2": ["Parents Threaten To Withdraw Hundreds Of Children From Second UK School Over LGBT+ Lessons", "Democrats file legislation to force all Americans to accept the LGBTQ agenda", "WATCH: Paris transgender woman abused, humiliated, harassed at Muslim demo", "Elisabeth Moss: America Under Trump ‘Losing the Principles This Country was Built On’"]}
{"comp": "L_R", "month": "Aug", "feats": "sbert", "test": 0.6555, "summ1": ["Texas Congressman says if El Paso shooter is charged with a hate crime, pastors will be next", "A Legendary Gay Writer Reflects on the Past, Present, and Future", "Trump claims ‘some of my biggest supporters’ are gay & support his plan to legalize discrimination", "China just ruled out allowing same-sex marriage"], "summ2": ["Free Speech & Religious Freedom: Federal Court Upholds Constitutional Order", "SCHILLING: LGBT History Effort Is An Assault On Parental Rights", "Takeaway staff 'jeer at lesbian couple for kissing after a night out'", "Ilhan Omar calls those who demand LGBT rights in Middle East ‘Deplorable’"]}
{"comp": "ER_L", "month": "Aug", "feats": "sbert", "test": 0.6553, "summ1": ["Federal Court Rules that Christians Cannot Be Forced to Work a Same-Sex Marriage", "Ilhan Omar calls those who demand LGBT rights in Middle East ‘Deplorable’", "Conspiracy Theories From the Elders of Zion to Epstein’s Youngsters", "Children are LGBTQ's Main Target Now"], "summ2": ["Texas Congressman says if El Paso shooter is charged with a hate crime, pastors will be next", "Trump claims ‘some of my biggest supporters’ are gay & support his plan to legalize discrimination", "Football game brought to a stop after fans reveal homophobic banners", "11 incredible trans people from history you won't learn about in school"]}
{"comp": "L_RC", "month": "Sep", "feats": "sbert", "test": 0.6543, "summ1": ["Pence Said Being Gay Is 'Learned Behavior' or a 'Choice' as He Opposed Granting LGBT People Rights in the '90s", "Transgender barista fired after she refused to serve an anti-LGBTQ activist", "LGBT forum: Elizabeth Warren names the 18 black trans women murdered this year", "The Shiny Shrimps director Cédric Le Gallo: ‘Masculine gay guys can be really disturbed by trans people’"], "summ2": ["President Nelson details church’s 2015, 2019 LGBT policies at BYU devotional", "Former Security Guard Indicted for Plotting to Bomb Las Vegas Synagogue", "Editorial: Lawmakers can act to make Ohio fair for gay and transgender people", "View: 377 anniversary this week but for queers in Kashmir, there is no ‘gay liberation’"]}
{"comp": "ER_R", "month": "Aug", "feats": "bow", "test": 0.6542, "summ1": ["Bernie Slams Trump Over Religious Freedom and LGBT Lives", "Palestinian Police Ban All LGBTQ Activities: Tlaib And Omar SILENT", "Rob Smith: The Left Abandoned Black and Gay Americans After Pulse Nightclub Massacre", "LGBT Leader: ‘Doubt Very Seriously’ Drag Queen Story Hour Draws ‘Predators'"], "summ2": ["'Not a joke': Biden claims he was accused of being gay in 1972 for supporting women's rights", "Palestinian Authority Bans LGBTQ Organizing in West Bank", "What People Who Used To Be Transgender Are Telling SCOTUS", "Andrew Scheer said gay couples lack ‘inherent’ quality of marriage in tape of 2005 speech unearthed by Liberals"]}
{"comp": "LC_RC", "month": "Apr", "feats": "sbert", "test": 0.6532, "summ1": ["Channel 4's documentary on Brazil's LGBT+ community completely ignored queer people of colour and their fight for racial equality", "The Tories’ own research is telling them young people are not stupid enough to vote for them anymore", "The LGBT Mormons Pushing the Church To Accept Equality", "Brunei introduces tough Islamic penal code"], "summ2": ["The LGBT Community Deserves Anti-Discrimation Laws · 71 Republic", "Gays want Christianity to legalise homosexuality", "Teacher sues to get job back after gay students’ maltreatment brought to light", "Alberta doesn’t hate the NDP as much as you’d think"]}
{"comp": "L_LC", "month": "Apr", "feats": "bow", "test": 0.6524, "summ1": ["America's Most Banned Book, George, Is About a Trans Girl", "Please oppose two religious privilege bills in Texas House", "15-year-old Nigel Shelby dies by suicide after homophobic bullying", "Donald Trump says he’d like to run against Pete Buttigieg"], "summ2": ["U.S. Supreme Court takes up major gay, transgender job discrimination cases", "Brunei begins Saudi-style 'death-by-stoning' punishment for gay s", "The LGBT Community: Sheep Advocating For Butchers", "Latest: Mormon leader says view on gay marriage unchanged"]}
{"comp": "ER_R", "month": "Jan", "feats": "sbert", "test": 0.6522, "summ1": ["Catholic Priest Slams March for Life as ‘Repulsive and Futile’", "Rep. Ilhan Omar Furthers Homophobic Conspiracy that Lindsey Graham’s ‘Compromised’", "Texas Values Action Warns Against Anti-Christian ‘Ban the Bible’ Bills in Texas That Stigmatize Christian Beliefs in the Name of LGBT SOGI Protections", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case"], "summ2": ["New York's first openly gay congressman defends Tulsi Gabbard after she apologizes for anti-LGBT past", "Karen Pence’s Christian-School Job Is Attacked by Intolerant Critics", "Supreme Court can’t decide whether to decide key LGBT cases", "UK's first pregnant man reveals emotional trauma of being transgender and giving birth"]}
{"comp": "R_RC", "month": "Jun", "feats": "bow", "test": 0.652, "summ1": ["Activists Push Kids Attending 'Kinky' Pride Parades: 'Nobody Likes Nakedness More Than Children'", "Christian baker Jack Phillips sued for the third time over LGBTQ cake order", "Mike Pence Backs Up Trump in the U.S. Embassy Gay Pride Flag Controversy, Hails ‘One American Flag’", "FLASHBACK: In 2012, Biden Said \"Life Begins At Conception\""], "summ2": ["Efforts to support LGBT residents spreading", "Scheer won't march in Pride parades this year, but Conservatives say they fight for gay rights in 'many ways'", "Thousands gather at Stonewall 50 years after LGBTQ uprising", "Bhutan Has Another Reason To Celebrate As World’s Happiest Country Decriminalises Homosexuality"]}
{"comp": "LC_R", "month": "Feb", "feats": "sbert", "test": 0.6513, "summ1": ["Misgendering: Much Ado About Nothing. – Stevie-Marie James – Medium", "Don Cheadle praised for wearing 'Protect Trans Kids' t-shirt on SNL", "Chiba 1st Japanese city to recognize LGBT couples, common-law marriage", "United Methodists resist push to ease LGBT bans"], "summ2": ["Gay couple demands new law forcing Christian service to prepare their taxes", "Donald Trump Jr., Others Slam Jussie Smollett, Media Coverage Surrounding Alleged Trump Supporter Hate Crime", "Critics Slams Chris Pratt's 'Anti-LGBTQ' Church. Here's How He Responded.", "Tennis legend and LGBT activist Martina Navratilova says allowing trans female athletes to compete as women is 'insane and cheating'"]}
{"comp": "C_LC", "month": "May", "feats": "sbert", "test": 0.6511, "summ1": ["House approves sweeping bill to expand gay rights", "Filipino pastor takes new gay marriage fight to Hong Kong court", "'Silenced' Georgian LGBT+ activists post coded messages to fight discrimination", "Oregon may ditch verdict system rooted in white nationalism"], "summ2": ["Anti-LGBTQ leader says she isn’t homophobic because she has a gay son", "The only thing worse than Chris Grayling in a pilot’s uniform", "Little Mix and Ellie Goulding win big at British LGBT Awards 2019", "Shira Banki's father: 'Extremism, no matter the kind, is a sure path to destruction'"]}
{"comp": "C_L", "month": "Aug", "feats": "bow", "test": 0.6509, "summ1": ["Bill Maher says he's 'glad' David Koch is dead", "U.S. judge allows first transgender person to sue under disability law", "New genetic links to same-sex sexuality found in huge study", "US sends pro-family group to UN fuelling fears over LGBT rights"], "summ2": ["Anti-Gay Tomi Lahren Dragged for Trying to Use LGBTQ People as an Issue Against AOC and 'The Squad'", "The Queen’s gay cousin says royals ‘don’t talk about’ his marriage to another man", "Trump claimed that gay people ‘like the job’ he’s doing. Yes, really", "‘Journalist’ embraced by mainstream Republicans exposed as right-wing troll who hung out with far-right hate groups"]}
{"comp": "C_R", "month": "Feb", "feats": "bow", "test": 0.6505, "summ1": ["Chicago police release 2 men questioned in Smollett case", "LGBT+ Africans optimistic as Kenya set to rule on decriminalizing gay sex", "Bill Requiring CA Schools' Support For LGBTQ Youth Introduced", "United Methodist Church Rejects Move To Ease Same-Sex Marriage, LGBT Clergy Bans – CBS Pittsburgh"], "summ2": ["Tennis legend and LGBT activist Martina Navratilova says allowing trans female athletes to compete as women is 'insane and cheating'", "Chicago Police Superintendent: 'Empire' Star Jussie Smollett 'WILL Be Held Accountable' If He Made A False Crime Report", "Sen. Ted Cruz Fires Back at Sen. Cory Booker for Asking Judicial Nominee if LGBT Relationship Were 'Sin'", "Actor Chris Pratt Responds to Claims That His Church is 'Anti-LGBTQ'"]}
{"comp": "C_L", "month": "Aug", "feats": "sbert", "test": 0.6501, "summ1": ["Appeal to stop gay marriage opens in Cayman Islands", "SOGIE bill respects religious freedom, Hontiveros says", "Trump: Jews who vote Democrat show 'lack of knowledge or great disloyalty'", "LGBTQ advocates gather at Boston City Hall to protest Straight Pride"], "summ2": ["Trump claims ‘some of my biggest supporters’ are gay & support his plan to legalize discrimination", "A trans student had top surgery. His college said that was ‘sexual perversion’ & kicked him out.", "Pedro Zamora's Legacy Hasn't Dimmed 25 Years After His Death", "No, the Democrats Didn’t Ignore Queer Issues at the CNN Debates"]}
{"comp": "ER_R", "month": "Apr", "feats": "sbert", "test": 0.6494, "summ1": ["The Catholic Classical School Lyceum Files a Groundbreaking Lawsuit Opposing LGBT Sexual Orientation-Gender Identity Laws in South Euclid, Ohio. This First Amendment Lawsuit Could Change the Rules of", "More trouble for Macron as his wife brings another controversy home", "California School Caught Teaching Children That Pedophilia Is a ‘Sexual Orientation’", "Criminalizing Christianity by Attacking Free Speech"], "summ2": ["Missouri teacher charged with hiring hitman to kill student, 10, who he allegedly molested: report", "In case with far-reaching implications, Supreme Court will rule on whether LGBT status is a protected class under the Civil Rights Act", "SE Cupp’s hot take on Buttigieg, Pence and gay marriage isn’t new", "‘We Exist’: Former Gays and Transgenders Protest California’s Discriminatory LGBT Therapy Ban"]}
{"comp": "ER_R", "month": "May", "feats": "sbert", "test": 0.6481, "summ1": ["U.S. Soccer Star Megan Rapinoe: ‘I’ll Probably Never Sing the National Anthem Again’", "PBS Changes Its Toon on Marriage", "LGBT Ignores, Denies and Attacks Biblical Truth While Claiming They are Being Assaulted", "2 Students React to Government Threats to Close Their School"], "summ2": ["REPORT: House approves anti-LGBT discrimination bill", "Americans are unaware of surrogacy horrors, fertility 'predators,' advocates say", "Britain's first Muslim gay wedding as man who tried to kill himself over sexuality ties knot", "Texas Christian College Students Vote to Ban Chick-fil-A From Their Campus Over LGBT Issues"]}
{"comp": "L_LC", "month": "Feb", "feats": "bow", "test": 0.6472, "summ1": ["Stacey Abrams says LGBT people are 'under attack' in State of the Union response · PinkNews", "Call Me By Your Name's director is working on a queer coming of age show", "Glenn Greenwald Defends Rep. Ilhan Omar: Criticizing Israeli Lobby & AIPAC Is Not Anti-Semitic", "Kansas lawmakers file bill voiding same-sex marriages that resembles an anti-LGBTQ manifesto of hate"], "summ2": ["‘Homosexual Community’ Controls City Council, One Member Says. He’s Resisting Calls to Resign.", "Jussie Smollett had no role in own attack, lawyers say", "United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "Women's March in Malaysia to push for LGBTI rights"]}
{"comp": "L_LC", "month": "Jan", "feats": "bow", "test": 0.647, "summ1": ["Texas couple hospitalised in ‘homophobic’ attack after birthday drinks", "Evangelicals are lobbying against anti-lynching law because it includes LGBTQ people", "Historians: Howard Schultz could re-elect Donald Trump", "I am trans in the US military and I can do my job just fine, Trump"], "summ2": ["Survivors Claim Chechen Authorities Rape LGBT Prisoners with Electric Shock Sticks", "Karen Pence to teach at school that bans LGBTQ employees, students", "Why legalising gay sex in India is not a Western idea", "Cambodia's government says it has a good record on LGBTI issues"]}
{"comp": "LC_R", "month": "Jan", "feats": "sbert", "test": 0.6465, "summ1": ["Jailing of Egyptian journalist who interviewed gay man condemned by rights group", "Fight prejudice by making LGBT+ lives more visible", "Jameela Jamil and Kristen Bell 'down' for same-sex romance on The Good Place", "Gavin Newsom Takes Over as California Governor and Pledges Fight for Equality"], "summ2": ["Pence says criticism of wife’s job at anti-LGBT Christian school is ‘deeply offensive to us’", "Uh oh: Tulsi Gabbard’s 2020 hopes get CRUSHED by her own past statement!!", "LGBT-driven 'Fairness for All' adopted by evangelical organization will be 'special rights for a few'", "Egypt sentences TV host to jail over gay interview"]}
{"comp": "LC_R", "month": "Sep", "feats": "sbert", "test": 0.6464, "summ1": ["For Trans Women, Silicone 'Pumping' Can Be A Blessing And A Curse", "How your business can make a difference to LGBT inclusion", "PM Imran minces no words at UN, calls out Modi govt for oppression of Kashmiris", "After ‘Straight Pride Parade,’ City Council president says Boston should review permitting process"], "summ2": ["California Senate passes resolution calling on Christians to embrace LGBT", "‘Can't even read it anymore’: Pete Buttigieg is right, the LGBT media is garbage", "Children as young as SIX are to be given compulsory self-touching lessons", "Florist Asks High Court to Uphold Right to Decline Order for Gay Wedding"]}
{"comp": "LC_R", "month": "Apr", "feats": "sbert", "test": 0.6458, "summ1": ["Jobs, LGBT inclusion, sex-ed: P.E.I. candidates tackle youth issues", "Poorer than George Clooney? How you spend your money still sends a message | Frances Ryan", "Photographing Mumbai’s LGBTQ Communities as India Decriminalises Homosexuality", "Philadelphia can exclude foster agency that won't work with same-sex couples -court"], "summ2": ["Parental involvement detects, stops stealth indoctrination", "In case with far-reaching implications, Supreme Court will rule on whether LGBT status is a protected class under the Civil Rights Act", "Karen Pence says Pete Buttigieg is attacking her husband for 'notoriety'", "‘We Exist’: Former Gays and Transgenders Protest California’s Discriminatory LGBT Therapy Ban"]}
{"comp": "LC_R", "month": "Aug", "feats": "bow", "test": 0.6454, "summ1": ["Trump rule would let some businesses bar LGBT workers", "Union quits Pride Glasgow event over 'commercialisation'", "Gay Marriage Plaintiff: What It Was Like to Fight For—And Win—Same-Sex Marriage Equality", "Two years on from Charlottesville, America has failed Heather Heyer"], "summ2": ["Palestinian Authority just banned LGBTQ activities! Where are AOC, Omar, and Tlaib?", "Laura Pradelska called 'ugly' and a 'transgender w***e' by four 'violent' women while shopping", "Andrew Scheer said gay couples lack ‘inherent’ quality of marriage in tape of 2005 speech unearthed by Liberals", "Why LGBT Teens Should Try To Work With Parents, Not Run Away"]}
{"comp": "ER_LC", "month": "Mar", "feats": "bow", "test": 0.6449, "summ1": ["Democrats Diss the Troops: Dump POW/MIA Flags for Transgender Flags", "Chris Evans: Mike Pence an ‘Obsequious Little Worm’ Trying to ‘Sanitize’ Trump’s Lies", "The British LGBT Agenda Finally Gets Huge Pushback – The Millennium Report", "Chick-fil-A Banned From Texas Airport For ‘Legacy Of Anti-LGBTQ Behavior’"], "summ2": ["In Muslim Malaysia, uproar over LGBTQ groups at Women's Day march", "Georgia House approves bill creating penalties for hate crimes", "Weeks after Trump's HIV pledge, report shows U.S. headway stalled", "NHL says Leafs' Morgan Rielly didn't use homophobic slur"]}
{"comp": "L_LC", "month": "Feb", "feats": "sbert", "test": 0.6443, "summ1": ["Trump Uses National Prayer Breakfast Speech to Undermine Civil Rights of LGBT People", "Man Who Died in Democratic Donor Ed Buck’s Home Called Him ‘The Devil’", "Channel 4's trans documentary The Making of Me praised as 'beautiful' · PinkNews", "This anti-LGBTQ bill filed by Kansas Republicans reads like a bonkers hate manifesto"], "summ2": ["LGBTQ+ people make up a big part of our country’s homeless and can’t be ignored", "United Methodists resist push to ease LGBT bans", "I doubted Jussie Smollett. It breaks my heart that I might be right.", "Michael Kirby marries partner Johan van Vloten on 50th anniversary of first meeting"]}
{"comp": "L_R", "month": "Feb", "feats": "sbert", "test": 0.6439, "summ1": ["LGBT+ groups dismiss Trump pledge to beat HIV by 2030 as empty rhetoric", "Netflix orders Jim Parsons-produced Special, a comedy series about a gay man", "West Virginia GOP legislator compares LGBTQ community to terrorists & the KKK", "Kacey Musgraves Has Been an LGBTQ Ally Since Her Career Began"], "summ2": ["Ellen Page Speaks Out After Blaming VP Pence For Smollett Hate Crime. She’s Not Sorry.", "Male Gym Teacher Allegedly Punished By School For Refusing To Watch Girl Shower", "The Latest: Methodist conference rejects same-sex marriage", "Gay rights activist accused of burning down his own home to get attention"]}
{"comp": "C_R", "month": "Feb", "feats": "sbert", "test": 0.6438, "summ1": ["How young filmmakers are protecting artistic freedom in Kenya", "United Methodist delegates defeat bid to ease LGBT bans", "Top Brazilian court to decide key homophobia cases", "Looking to WOMEN, LGBTQ for votes — SOLIS tapes name 4 aldermen — A MOVE on graduated income tax"], "summ2": ["Taxpayers support lavish Hillsong lifestyle", "Tennis legend and LGBT activist Martina Navratilova says allowing trans female athletes to compete as women is 'insane and cheating'", "BUSTED: Jussie Smollett Wrote The Racist Letter That Led To The Alleged Fake Hate Crime Against Him", "WALSH: The Left Attacks 'Homophobia' In Christian Churches, Ignores Mosques. The Double Standard Is Insane."]}
{"comp": "R_RC", "month": "May", "feats": "sbert", "test": 0.6417, "summ1": ["Mormon church opposes LGBT nondiscrimination measure", "Trans woman who heckled Obama feels betrayed by the LGBT community", "Arthur Becomes 1st PBS Cartoon with a Gay Wedding – ‘It’s a Brand-New World’", "Nike a major supporter of abortion, LGBT"], "summ2": ["House approves sweeping bill to expand gay rights", "Teacher In LGBT Classes Row Leads Birmingham Pride", "‘I want gay marriage’: Duterte publicly supports LGBT rights, says he considered bisexuality", "Experts Ranked the Most Dangerous Countries for Women. The U.S. Made the Top 10"]}
{"comp": "C_LC", "month": "May", "feats": "bow", "test": 0.6416, "summ1": ["News Agency Reports Arrests Of LGBT Activists In St. Petersburg", "House approves sweeping bill to expand gay rights", "Bud Light launches rainbow bottles in support of LGBTQ rights", "Taiwan MPs urged to back government in Asia's first same-sex marriage law"], "summ2": ["Texas transgender woman's killing highlights disturbing trend", "Anti-LGBTQ leader says she isn’t homophobic because she has a gay son", "Comment: The journey to full acceptance of LGBTI Arabs continues", "'That Day Wasn't About Us': One Of The 1st Same-Sex Married Couples Looks Back"]}
{"comp": "R_RC", "month": "Jul", "feats": "sbert", "test": 0.6416, "summ1": ["Nobody should listen to Jeremy Corbyn's Iran views", "Transgender teen raped on first night out as a woman escapes by biting attacker on the penis", "LGBTQ Activism May Be Turning into Overreach by Supporters", "U.S. Women's Soccer Team Accused Of Snubbing Star Player For Christian Views"], "summ2": ["Orthodox rabbi blasts gay conversion therapy", "DCW sets up special cell for LGBTQ community", "Bhutan LGBT community celebrates after homosexuality is decriminalised", "Traveling history exhibit on struggle for LGBTQ rights coming to Ross Township"]}
{"comp": "LC_R", "month": "Feb", "feats": "bow", "test": 0.6413, "summ1": ["United Methodist Church Votes To Keep Bans On Same-Sex Weddings, LGBTQ Clergy", "LGBT History Month 2019", "‘Homosexual Community’ Controls City Council, One Member Says. He’s Resisting Calls to Resign.", "Jussie Smollett arrested over false attack report"], "summ2": ["Democrat Senator Asks Judicial Nominee to Answer Whether Gay Marriage Is ‘Sinful’", "DC school boycotting sports at Karen Pence's Christian school over LGBT policy", "Cameron Gray collects a ton of tweets on the alleged Jussie Smollett attack that might not age well", "Actor Chris Pratt Responds to Claims That His Church is 'Anti-LGBTQ'"]}
{"comp": "C_LC", "month": "Jan", "feats": "sbert", "test": 0.6412, "summ1": ["A commitment to bring hope, awareness to mental health work with LGBTQ community", "Cabinet endorses civil partnership bill | Bangkok Post: news", "Court asked to block lawmaker testimony in LGBT rights case", "#BoycottTrumpPrimeTime trends on Twitter ahead of Trump Oval Office address"], "summ2": ["Indonesia govt steps in to protect HIV support group", "Fight prejudice by making LGBT+ lives more visible", "Ellen DeGeneres Says She Wants Kevin Hart to Be the Oscars Host Despite Homophobic Comments", "I’m a newly single mother and confused about my sexuality | Mariella Frostrup"]}
{"comp": "L_R", "month": "Sep", "feats": "sbert", "test": 0.6408, "summ1": ["Truck driver ‘shot trans woman in the chest’ in transphobic hate crime", "Pence Said Being Gay Is 'Learned Behavior' or a 'Choice' as He Opposed Granting LGBT People Rights in the '90s", "Oregon official who shut down Christian bakery loses election", "Watch Kevin Hart Gaslight Lil Nas X Over Homophobia"], "summ2": ["LGBTQ lobby attacks Drew Brees for supporting the 'Bring your Bible to school' program, and he just responded", "If Anyone Can Be A Woman, Then No One Is a Woman", "Readers’ comments: This sinister Leftie conspiracy to undermine society", "Calif. legislature approves measure criticizing pastors for not embracing LGBT identities"]}
{"comp": "C_R", "month": "Mar", "feats": "sbert", "test": 0.6401, "summ1": ["U.S. farmers face devastation following Midwest floods", "A focus on healing, power, respect for LGBT community through Pride", "George Clooney calls for hotel boycott over Brunei LGBT death penalty", "LGBT Nondiscrimination Protections: Popular but Not Widely Adopted"], "summ2": ["Texas AG investigating Chick-fil-A's exclusion at airport", "Tennis great Martina Navratilova apologizes for controversial remarks on 'cheating' trans athletes", "‘Courageous’ Muslim Parents in UK Boycott Brainwashing ‘Homosexuality Project’", "New Dem Party Forbids Candidates Saying Pence Is a “Decent Guy”"]}
{"comp": "L_LC", "month": "Mar", "feats": "bow", "test": 0.64, "summ1": ["Ralph Lauren features same-sex couple for first time in advert", "Why You Should Stop Saying ‘Committed Suicide’", "Trump to host Brazil’s anti-gay president Jair Bolsonaro at White House", "Religious Refusal Bill Prepped to Grant Texans License to Discriminate"], "summ2": ["In Muslim Malaysia, uproar over LGBTQ groups at Women's Day march", "Glide Memorial issues declaration of independence from United Methodist Church", "Georgia House approves bill creating penalties for hate crimes", "Every school 'needs dog as stress-buster'"]}
{"comp": "L_R", "month": "Jan", "feats": "sbert", "test": 0.6394, "summ1": ["Historians: Howard Schultz could re-elect Donald Trump", "Virginia Senate Passes Non-Discrimination Protections", "Brazil’s new president Jair Bolsonaro already let down the LGBT community", "Madonna turned up at Stonewall Inn and gave rousing speech to ring in 2019 · PinkNews"], "summ2": ["New York's first openly gay congressman defends Tulsi Gabbard after she apologizes for anti-LGBT past", "Pence says criticism of wife’s job at anti-LGBT Christian school is ‘deeply offensive to us’", "Saudi interrogators 'forced female human rights activists to kiss each other'", "Divorce: Ignoring the cost"]}
{"comp": "R_RC", "month": "Sep", "feats": "bow", "test": 0.6394, "summ1": ["Federal judge sides with Christian orgs in LGBT adoption case", "California lawmakers pass resolution calling on all 'religious groups' — including Christians — to 'embrace' LGBTQ worldview", "BBC teaching kids 100 genders exist, can go to prison for 'disrespecting' gender identities", "Good grief: We don't need a 7-hour, LGBT CNN town hall"], "summ2": ["LGBT activist files new court challenge against gay-sex law", "10 candidates in Cedar Rapids forum vow to embrace LGBTQ policies", "377 anniversary this week but for queers in Kashmir, there is no ‘gay liberation’", "What could Sen. Mike Lee’s trip to Russia mean for relations with the U.S.?"]}
{"comp": "L_RC", "month": "Jul", "feats": "sbert", "test": 0.6387, "summ1": ["A reminder from the World Health Organization: LGBT people are not \"sick\"", "Brighton Trans Pride’s ‘amazing turnout’ showcases ‘all that’s been achieved,’ says MP", "Liberty University Withdraws From CPAC Because Of Gay Rights Group’s Co-Sponsorship", "Cop says Alexandria Ocasio-Cortez should be shot following Trump’s racist targeting of The Squad"], "summ2": ["Out and proud: Self-affirmation is important for LGBTQ citizens", "In Tamil Nadu, a hostel for transgender kids", "Nicki Minaj pulls out of Saudi Arabia concert", "\"Gay Marriage\" and Father Keenan (Once Again)"]}
{"comp": "L_LC", "month": "Jul", "feats": "sbert", "test": 0.6384, "summ1": ["Anti-LGBT education page blocks ‘every gay’ on Twitter", "This priest allegedly exposed himself to a teen who came out during confession", "Meghan McCain explains why she’s supportive of Pete Buttigieg & Joe Biden", "Meet the bigots who are trying to ruin Pride Month"], "summ2": ["Annual Capital Fringe Fest once again rife with LGBT themes", "Nicki Minaj Cancels Saudi Arabia Performance, Citing Human Rights Concerns", "Marriage equality campaigners celebrate ‘historic day’ for Northern Ireland", "No Blacks, Jews, Gays, or Transgender"]}
{"comp": "LC_R", "month": "May", "feats": "sbert", "test": 0.6383, "summ1": ["Stephen Fry, Paul O’Grady and Cynthia Nixon among winners at British LGBT Awards", "Being Gay Used To Be Terrifying. Being Jewish was Easy. Now It’s The Opposite. – The Forward", "OutSaskatoon gets $1.1M to help LGBT survivors of gender violence", "Taiwan's LGBT community protests ahead of vote"], "summ2": ["Mormon church opposes LGBT nondiscrimination measure", "Alabama Public Television REFUSES to air Arthur same-sex marriage episode", "The Left Is Shunning Liberals With Concerns About Transgender Agenda", "‘Bigot, heal thyself’! How the hell did Ilhan Omar manage to say this without bursting into flames?"]}
{"comp": "R_RC", "month": "Mar", "feats": "sbert", "test": 0.6377, "summ1": ["Sharron Davies slams trans cyclist as web war takes an ugly turn", "Student Posts Bible Verses for LGBT Students, Gets Suspended", "Dobson: Dems using 'Equality Bill' to snuff out Christianity", "Chick-fil-A Banned from Airport for Its 'Legacy of Anti-LGBTQ Behavior'"], "summ2": ["Utah lawmaker's 'LGBT conversion therapy' posts anger activists", "Capital City Equality Center to be named after LGBTQ advocate Stephanie Mott", "Brunei’s law mandating STONING TO DEATH of gays & adulterers to come into force next week", "The Coming Out Monologues celebrates its 10th anniversary by featuring stories from LGBTQ+ refugees"]}
{"comp": "L_RC", "month": "Jul", "feats": "bow", "test": 0.6371, "summ1": ["Fox \"news\"-side anchor Martha MacCallum flat-out lied about Trump’s horrible record on LGBTQ rights", "This gay millennial is challenging a 76-year-old homophobe for a NY Congressional seat", "Brighton Trans Pride’s ‘amazing turnout’ showcases ‘all that’s been achieved,’ says MP", "Rights activists alarmed as Mike Pompeo installs anti-gay anti-abortion activist to head new commission on ‘natural law’"], "summ2": ["Muslim TV station faces ban after broadcasting anti-gay & child marriage content", "LGBTQ UBC students support decision to drop school from Pride Parade", "Bhutan LGBT community celebrates after homosexuality is decriminalised", "AIDSfree appeal: ‘I didn’t think I would live to 40, but I am going to be 70 next year’"]}
{"comp": "C_LC", "month": "Jul", "feats": "sbert", "test": 0.637, "summ1": ["Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "Philadelphia Homicide Rate Climbs, Highest In Over A Decade", "CORRECTED: UN human rights office condemns Trump comments as 'racist'", "Alabama sued in transgender driver’s license case"], "summ2": ["Nicki Minaj backs out of Saudi Arabia concert to show her 'support for the rights of women and the LGBTQ community'", "22 Bible Verses on Welcoming Immigrants", "Why your place of work should be LGBTI-friendly all year, not just for Pride", "'It was very quick and very sudden': Liberal staffers reveal alleged sexual assaults"]}
{"comp": "LC_RC", "month": "Sep", "feats": "bow", "test": 0.6368, "summ1": ["Drew Brees Says He Not Anti-LGBTQ, 'Love and Accept All'", "For Trans Women, Silicone 'Pumping' Can Be A Blessing And A Curse", "From Billy Porter's win to Patricia Arquette's plea: Emmys were queerest they've ever been", "Pride festival to celebrate LGBT+ Muslims launched"], "summ2": ["LGBT activist files new court challenge against gay-sex law", "Cops blast DA Rachael Rollins after SJC tosses Straight Pride case", "377 anniversary this week but for queers in Kashmir, there is no ‘gay liberation’", "What could Sen. Mike Lee’s trip to Russia mean for relations with the U.S.?"]}
{"comp": "C_L", "month": "Mar", "feats": "sbert", "test": 0.6366, "summ1": ["LGBTQ welcome at city Methodist church", "Memorial Service To Honor BRHS Graduate Who Died At 19", "Clooney in boycott calls over Brunei's anti-LGBT laws", "SOGIE Equality Bill might start from scratch 19 years since proposal"], "summ2": ["Piers Morgan mocks Sam Smith for coming out as non-binary", "America's Gay Wedding Cake Divide Hits NYC Stage With Humor And Heart", "Chick-fil-A donated to anti-LGBTQ group that bars employees from ‘homosexual acts’ – ThinkProgress", "Senate passes resolution to overturn Trump's national emergency declaration"]}
{"comp": "L_LC", "month": "May", "feats": "bow", "test": 0.6366, "summ1": ["Mayor Pete is going to hell whether he’s a top or bottom, Christian pundit says", "Trump plans to hijack the annual 4th of July fireworks on the Mall celebration and make himself the featured attraction: report", "Pakistan human rights minister appoints first transgender employee", "House of Representatives approve Equality Act in historic move"], "summ2": ["'I Found Home': Celebrating Ramadan at an Iftar for Queer Muslims", "‘I’m getting death threats,’ says man who threw milkshake on Tommy Robinson", "Taiwan approves same-sex marriage in first for Asia", "Kellyanne Conway says Trump may lead U.N. in effort to decriminalize homosexuality"]}
{"comp": "LC_R", "month": "May", "feats": "bow", "test": 0.6359, "summ1": ["LGBT+ Muslims to lead Birmingham Pride march alongside Parkfield teacher threatened over equality lessons", "Homeless transgender Americans would lose protections under new HUD rule proposal", "Taiwan approves same-sex marriage in first for Asia", "London marathon runners 'called fat and slow' by contractors"], "summ2": ["PBS 'taking advantage' of parent's trust by including gay wedding in 'Arthur': Conservative group", "Democrats vote through ban on gay and transgender discrimination", "Texas college student leaders want Chick-fil-A thrown off campus — and their vote is unanimous", "Report: Colorado High School Shooting Suspect Railed Against Christians and Trump, Shared Leftist Content"]}
{"comp": "C_R", "month": "Sep", "feats": "bow", "test": 0.6359, "summ1": ["U.S. man in same-sex marriage sues Japan government for long-term visa", "Democrats hit Scalia over LGBTQ rights", "School board files appeal to defend its transgender policy", "Bosnians march in first Gay Pride under tight police protection"], "summ2": ["CNN to Host LGBTQ Democratic Presidential Town Hall", "Millennials boldly preach freedom from LGBT lives at Orlando march 3 years after Pulse mass shooting", "7th grade science teacher handed out gender-identity graphic to explain being addressed as 'Mx'", "Federal judge sides with Christian orgs in LGBT adoption case"]}
{"comp": "ER_R", "month": "Feb", "feats": "sbert", "test": 0.6353, "summ1": ["And There It Is--> Final Piece of Jussie Smollett MAGA Assault Illusion Turns Out to be Complete Crap", "Jackson Gay Rights Leader Accused of Burning Down Own Home", "Elementary School BANNED Students From Playing Sports Against One Christian School … Guess Why?", "Homo RICO: The Feds Need to Bust Big Gay"], "summ2": ["Ellen Page Speaks Out After Blaming VP Pence For Smollett Hate Crime. She’s Not Sorry.", "Male Gym Teacher Allegedly Punished By School For Refusing To Watch Girl Shower", "The Latest: Methodist conference rejects same-sex marriage", "Disneyland Paris to host official LGBTQ Pride celebration, a first for Disney parks"]}
{"comp": "R_RC", "month": "Mar", "feats": "bow", "test": 0.635, "summ1": ["Hundreds of Muslim parents launch new protest against school lessons they say promote homosexuality", "Transgender woman, 18, sexually assaulted girl, 10, in Morrisons' female toilets", "San Antonio bans Chick-fil-A from airport over ‘legacy of anti-LGBTQ behavior’ … in the name of ‘equality’", "Tennis Legend Martina Navratilova Called A Nazi For Arguing Against Trans Athletes. She's Not Backing Down."], "summ2": ["Officials at Aurora Methodist church speak out in support of LGBTQ community", "Sir Elton John backs George Clooney’s Brunei hotel boycott over anti-LGBT laws", "‘Catalyst for change’: LGBTQ advocate Stephanie Mott honored at Statehouse service", "UCP would roll back school protections for LGBTQ students, add new provincial exams"]}
{"comp": "C_LC", "month": "Feb", "feats": "sbert", "test": 0.6345, "summ1": ["On Social Ideology, the Left Catches Up to the Right", "Methodists reject a proposal to allow openly gay clergy, same-sex marriage", "Kenya: LGBT+ Africans Optimistic As Kenya Set to Rule On Decriminalising Gay Sex", "State superintendent visits San Diego to push for LGBTQ student support bill"], "summ2": ["Misgendering: Much Ado About Nothing. – Stevie-Marie James – Medium", "US judge stops Air Force from discharging two HIV positive airmen", "Oscars 2019: Rachel Weisz on award ceremonies, shooting The Favourite, and her new LGBT+ admirers", "Eric Porterfield: Republican lawmaker who compared LGBT+ people to KKK urged to resign"]}
{"comp": "R_RC", "month": "May", "feats": "bow", "test": 0.6344, "summ1": ["A High School Girl’s Life After Transgender Students Join Her Sport", "Equality Act Would Impose Sexual Orthodoxy, GOP Leaders Warn", "Teens Protest United Methodist Church Over ‘Immoral’ Stance on LGBTQ Issues", "Madonna opens up on longstanding relationship with the LGBTQ community after receiving GLAAD award"], "summ2": ["Gay couples in Taiwan plan mass wedding registration after same-sex marriage legalised", "House approves sweeping bill to expand gay rights", "Edmonton police chief to apologize to LGBTQ community at Friday news conference", "Maajid Rips Into Esther McVey For Saying \"Parents Know Best\" On LGBT Lessons"]}
{"comp": "L_R", "month": "Aug", "feats": "bow", "test": 0.6333, "summ1": ["Tomi Lahren claims gun rights are gay rights. Huh?", "Head Back To School With LGBTQ Competency", "Straight Pride Organizer Says ‘White Caucasians’ Founded U.S. – Her Gay Son Calls Parade ‘Dog Whistle’ to White Supremacy", "Trump Dodges and Gives an Accidentally Revealing Answer When Confronted on His Anti-LGBT Policies"], "summ2": ["Palestinian Authority bans LGBT activities in West Bank", "Laura Pradelska called 'ugly' and a 'transgender w***e' by four 'violent' women while shopping", "Andrew Scheer said gay couples lack ‘inherent’ quality of marriage in tape of 2005 speech unearthed by Liberals", "California Removes Arrest Reports From Kamala Years"]}
{"comp": "C_R", "month": "Mar", "feats": "bow", "test": 0.6327, "summ1": ["Kesha to headline Dan Reynolds' LGBTQ festival LOVELOUD", "Rights of 'ordinary people' in focus as 1 billion vote in Asia", "Tennessee House passes contentious anti-discrimination bill", "Slim Majority of Methodists Support Same-Sex Marriage"], "summ2": ["Birmingham Schools Cancel LGBT Equality Classes Due Muslim Parent Protests", "Chick-fil-A requests dialogue after city votes to ban restaurant from airport over ‘anti-LGBT behavior’", "Martina Navratilova, Who Beat Communism, Got Eaten By The Trans Mob", "Christian student to appeal university expulsion over gay marriage views"]}
{"comp": "C_L", "month": "Mar", "feats": "bow", "test": 0.6321, "summ1": ["Another Trump judicial nominee backs away from college writings", "LGBTQ welcome at city Methodist church", "'I'm ready,' says first transgender candidate for Thai PM", "LGBT Nondiscrimination Protections: Popular but Not Widely Adopted"], "summ2": ["Jacob Tobia: Cis Men Should Embrace Their Attraction to Trans Folx", "For the first time ever Ralph Lauren has shown a same-sex couple in one of its ads", "Trump to host Brazil’s anti-gay president Jair Bolsonaro at White House", "Religious Refusal Bill Prepped to Grant Texans License to Discriminate"]}
{"comp": "R_RC", "month": "Jul", "feats": "bow", "test": 0.6315, "summ1": ["Report: ANTIFA plans acid attacks on D.C. Free Speech Rally, saying goal is to blind attendees", "Openly gay US soccer star — who unleashed numerous f-bombs during team's World Cup parade — calls Christian player 'homophobic'", "Trump dumping Obama transgender shelter rule to protect women, girls", "Drag Queen Reads During Pride Month Service at Cincinnati Church"], "summ2": ["Muslim TV station faces ban after broadcasting anti-gay & child marriage content", "Poll: Young adults grow uneasier with LGBTQ", "AIDSfree appeal: ‘I didn’t think I would live to 40, but I am going to be 70 next year’", "Nicki Minaj pulls out of Saudi Arabia festival to show support for women's rights and LGBTQ community"]}
{"comp": "C_LC", "month": "Feb", "feats": "bow", "test": 0.6313, "summ1": ["Methodists reject a proposal to allow openly gay clergy, same-sex marriage", "Jussie Smollett charged: 'Empire' actor out on bond, staged attack due to salary dissatisfaction, police say", "Kenya court set to rule on whether to scrap anti-gay laws", "Living in Venezuela now is hard. Being LGBT+ makes it harder."], "summ2": ["Chris Pratt responds to Ellen Page calling his church 'anti-LGBTQ'", "P.E.I.'s LGBT community seeks a welcoming place", "Netflix may cancel One Day At A Time — this is why LGBTIs should be worried", "Jussie Smollett arrested over false attack report"]}
{"comp": "ER_R", "month": "Jun", "feats": "sbert", "test": 0.6302, "summ1": ["Lawmakers want to force churches to embrace LGBTQ ideology instead of the Bible", "There's a Very Good Chance a Straight Pride Flag Will Fly Over Boston City Hall, Parade Organizer Says", "LGBT parents begin physically maiming their own children in botched transgender mutilations", "Book: Female Secret Service Offended by Joe Biden Skinny-Dip Ritual"], "summ2": ["Mixing Kids With Drag Queens Sets Gay Rights Back Decades", "US Women's soccer star keeps promise to ignore national anthem as an 'f-you' to President Trump", "Lady Gaga persuades Prince William to support charity helping homeless LGBT youngsters", "Scientists blast 'innacurate' GCSE paper from Edexcel that replaced word 'sex' with 'gender'"]}
{"comp": "L_RC", "month": "May", "feats": "sbert", "test": 0.63, "summ1": ["An all-trans boy band wants to make history with their groundbreaking reality series", "Pete Buttigieg is reshaping politics and driving the religious right crazy in the process", "Senator Who Blocked LGBT Woman’s Nomination Mocked for Saying Equality Act Is Unnecessary and ‘Divides Our Nation’", "Michelle Washington Is The Third Black Transgender Woman To Die From Violence Within Five Days"], "summ2": ["Australian Christian Lobby car bomb accused pleads ‘not guilty’", "House approves sweeping bill to expand gay rights", "U.S. can be leader in gay rights across globe", "Teacher In LGBT Classes Row Leads Birmingham Pride"]}
{"comp": "C_RC", "month": "Jul", "feats": "bow", "test": 0.63, "summ1": ["Bandwagon builds for LGBTQ diversity on children's TV", "Oglala Sioux Tribe legalizes same-sex marriage", "Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "EEOC Wants Suit Over Gay Workers' Rights Tossed Or Paused"], "summ2": ["Muslim TV station faces ban after broadcasting anti-gay & child marriage content", "In Tamil Nadu, a hostel for transgender kids", "Poll: Share of young adults comfortable with LGBTQ people drops from 63% to 45%", "Nicki Minaj pulls out of Saudi Arabia festival to show support for women's rights and LGBTQ community"]}
{"comp": "L_LC", "month": "Apr", "feats": "sbert", "test": 0.6298, "summ1": ["Spring 2019 TV Preview: Shows That’ll Please Your Eyeballs With LGBTQ+ Women Characters", "A Transgender Anti-Discrimination Law Won't Mark The End Of Women's Sports", "Christian College President Expands His Attacks on LGBT People: “Hate Under the Banner of ‘Love’”", "INDICTED: Trump-Loving Former GOP Congressman, Now Chairman of Republican Party in NC, in Federal Corruption Probe"], "summ2": ["US trans troops return to 'dark days' under new policy, say LGBT+ groups", "LGBTQI need legislation", "Tampa mayor election: Jane Castor easily defeats David Straz in historic race", "Brunei defends gay sex death penalty and says it \"focuses more on prevention than punishment\""]}
{"comp": "ER_R", "month": "Jan", "feats": "bow", "test": 0.629, "summ1": ["Neo-Nazi Rep. Ilhan Omar Defends Anti-Semitic Hate Group Which Calls for Death of Gays", "WATCH: Children as young as FIVE are being taught about homosexuality and sexual intercourse. · Caldron Pool", "Prominent LGBT Activist, Democratic Donor Charged In Teen Sex Abuse Case", "Donald Trump Bets It All in Televised 8-Minute Address from Oval Office"], "summ2": ["Chicago Woman With Concealed Carry License Shoots And Kills Would-Be Robber", "Sex, Tapes & Slurs: GOP Senator Smeared as Hostage to Gay Blackmail Material", "Court allows Christian baker Jack Phillips to sue Colorado for anti-religious hostility", "Kevin Hart admits the chances of him hosting this year's Oscars are 'very slim'"]}
{"comp": "L_LC", "month": "May", "feats": "sbert", "test": 0.6287, "summ1": ["A lesbian employee was outed in a meeting & fired for complaining about it", "An all-trans boy band wants to make history with their groundbreaking reality series", "Pete Buttigieg is reshaping politics and driving the religious right crazy in the process", "Senator Who Blocked LGBT Woman’s Nomination Mocked for Saying Equality Act Is Unnecessary and ‘Divides Our Nation’"], "summ2": ["Being Gay Used To Be Terrifying. Being Jewish was Easy. Now It’s The Opposite. – The Forward", "British doctor providing care for 1,600 trans kids suspended", "Taiwan's LGBT community protests ahead of vote", "New Year Honours: LGBT chief police officer gets BEM"]}
{"comp": "C_LC", "month": "Sep", "feats": "bow", "test": 0.6286, "summ1": ["New ‘It’ film portrays painful true chapter of LGBT history", "Bosnians march in first Gay Pride under tight police protection", "SNP's Mhairi Black says she's been challenged when using women's toilets", "Arizona Supreme Court protects business' religious right to reject work for same-sex marriages"], "summ2": ["Drew Brees Says He's Not Anti-LGBTQ, 'Love and Accept All'", "LGBTQ Equality, Dead Cats, & Whataboutery", "LGBTQ ‘Black Lives Matter’ activists were watching Democratic donor Ed Buck, demanding justice", "Archive on 4, Going to the Gay Bar"]}
{"comp": "L_R", "month": "Apr", "feats": "sbert", "test": 0.6271, "summ1": ["Evangelical Taylor U community in uproar over Pence speech: \"Deeply at odds with following Christ\"", "Netflix’s ‘Special’ Brings Disability and Gay Sex to the Forefront", "Bangladesh gives voting rights to hijra community", "Dua Lipa supports Brunei boycott as gay sex death penalty becomes law · PinkNews"], "summ2": ["Evangelist Franklin Graham distorts the Bible’s message on homosexuality", "Supreme Court to Decide if Job Discrimination Laws Cover LGBT People", "‘We Exist’: Former Gays and Transgenders Protest California’s Discriminatory LGBT Therapy Ban", "BBC warns staff not to tweet 'private' political views after controversial Question Time debate"]}
{"comp": "C_R", "month": "Apr", "feats": "bow", "test": 0.6268, "summ1": ["Human Rights Watch: Brunei's new laws are 'barbaric to the core'", "Lightfoot says Chicago mayoral victory means ‘a city reborn’", "United Methodist shows support for LGBTQ community amid controversy", "Supreme Court takes up major gay, transgender job discrimination cases"], "summ2": ["Supreme Court & LGBT -- SCOTUS to Consider LGBT Job-Discrimination Cases", "Pete Buttigieg targets VP Mike Pence while speaking on homosexuality: 'Your quarrel, sir, is with my creator'", "Parents continue protests over LGBT-inclusive teaching...", "Will LGBT groups block *another* Chick-fil-A at an airport?"]}
{"comp": "ER_R", "month": "Apr", "feats": "bow", "test": 0.6266, "summ1": ["Tunisian Migrant Arrested For Murdering Gay Man and Disemboweling Another", "David Hogg: Trump ‘Supports’ ‘Terrorism’ Against Black Churches", "Democrats file legislation to force all Americans to accept the LGBTQ agenda", "Ted Cruz Launches Investigation Into Yale Law School’s Decision to Discriminate Against Christian Firms, Caving to an LGBT Group’s Complaints Against ADF"], "summ2": ["Americans who favor New Testament most likely to oppose gay marriage, be pro-life: poll", "Supreme Court To Hear Huge Cases On Religious Liberty And LGBT", "‘So Inspired’: Taylor Swift Donates $113,000 to LGBTQ Rights Group in Tennessee", "VP fights back: Buttigieg chooses unwise strategy to attack Pence’s religion"]}
{"comp": "L_LC", "month": "Sep", "feats": "sbert", "test": 0.626, "summ1": ["Straight students with ‘Make America Great Again’ flags hijack LGBT club’s first meeting", "A trans Lyft driver was viciously attacked by a customer. Now she’s too afraid to work.", "Mike Pence argued homosexuality was 'a choice' or 'learned behavior' during 1990s fight against gay rights ordinance", "Betsy DeVos, Ben Carson send anti-trans signals to Trump's evangelical base"], "summ2": ["Section 377 judgment offers lessons on how to use Constitution to build coalitions, bring change", "How your business can make a difference to LGBT inclusion", "FEATURE-'Everyone needs a place': Gay couple fights for Hong Kong public housing", "Sanders to attend latest climate forum while Biden and Warren pass"]}
{"comp": "LC_R", "month": "Jun", "feats": "bow", "test": 0.6247, "summ1": ["Seattle's NAACP is first in nation to appoint an LGBTQ chair", "Where Are Companies Like Verizon Going With Their LGBT Funding?", "Hundreds of thousands expected to celebrate WorldPride in NYC", "London bus attack women: 'We are not scared to be visibly queer'"], "summ2": ["Elizabeth Warren offers reparations to gay couples who couldn't file joint tax returns", "Trump’s LGBT pride tweet reinforces the exploitation of sexual minorities 50 years after Stonewall", "'ONE American flag flies!' Pence defends State Department's ban on flying rainbow flag at embassies", "Christian Cake Baker’s Attorney: 3rd Lawsuit Is ‘Rehash’ of ‘Old Claims’"]}
{"comp": "L_LC", "month": "Jul", "feats": "bow", "test": 0.6247, "summ1": ["Bachelor in Paradise’s Demi Burnett destroys haters after coming out as ‘queer queen’", "Donald Trump’s gay press deputy supports his anti-LGBTQ policies", "GOP Senator With Anti-LGBT Record Has Gay Democratic Challenger – Who Could Be the First Out Gay Man in the Senate", "Home Office and National Crime Agency stalls removed from UK Black Pride"], "summ2": ["Activists set sights on Turkey’s economy in this year’s Istanbul Pride March", "Two Indian grooms have a traditional Hindu wedding and people love it", "The Dalai Lama Supports Gay Marriage, But Only For Non-Buddhists, Which Isn't Quite What We Were Hoping For", "Supreme Court to decide whether gay, transgender workers are protected by anti-discrimination laws"]}
{"comp": "ER_R", "month": "Jul", "feats": "bow", "test": 0.622, "summ1": ["New Teacher Bill a Training Wreck", "Trump Reverses Obama \"Equal Access\" Rule in Favor of Protecting Women and Girls ⋆ Activist Mommy", "Muslim Woman Attacks Gay Man Over Rainbow Flag Puts Liberals in a Pickle", "Amazon Bans ‘Conversion Therapy’ Books"], "summ2": ["Megan Rapinoe says 'not many, if any' of her teammates would visit White House if they win World Cup", "‘This Cannot Go on in America’: Lawyer for Journalist Attacked by Antifa Plans to Take Action Against City Government", "The West Is On the Cusp of Seeing State-Sanctioned Sexual Assaults Thanks to Transgender Activism", "Young Americans Increasingly Uncomfortable With LGBTQ Culture"]}
{"comp": "C_RC", "month": "Mar", "feats": "bow", "test": 0.6218, "summ1": ["Joe Biden takes heat for calling Mike Pence a 'decent guy'", "2019 Session Opening Day: Ron DeSantis prefers shorter speeches", "Brunei urged to halt introduction of strict new anti-LGBT+ laws", "SOGIE Equality Bill might start from scratch 19 years since proposal"], "summ2": ["Yes, It's Time To Book Your LGBT Halloween Getaway, And There's Only One Choice This Year", "EXPLAINER: What the School Act and the Education Act say about LGBTQ student and employee rights", "Texas AG Says Chick-fil-A's Constitutional Rights Violated by Banning from San Antonio Airport", "'Catalyst for change': LGBTQ advocate Stephanie Mott honored at Statehouse service"]}
{"comp": "R_RC", "month": "Jan", "feats": "sbert", "test": 0.6215, "summ1": ["New York's first openly gay congressman defends Tulsi Gabbard after she apologizes for anti-LGBT past", "Omar Defends Black Hebrew Israelites, a Hate Group, in Falsehood-Laden Tweet About Covington Teens", "Karen Pence’s Christian-School Job Is Attacked by Intolerant Critics", "UK's first pregnant man reveals emotional trauma of being transgender and giving birth"], "summ2": ["Douglas Todd: The many things Lindsay Shepherd is not", "AIDSfree appeal: Gay sex may be legal but lingering stigma means men won’t seek help", "Trump administration moves to protect faith-based foster care agencies that don't serve LGBT couples", "Chamber choices"]}
{"comp": "C_L", "month": "Apr", "feats": "sbert", "test": 0.6207, "summ1": ["Plan with LGBT bans OK’d by United Methodist judicial panel", "Lori Lightfoot will be Chicago’s 1st black, female mayor", "Sharp Rise in the Share of Americans Saying Jews Face Discrimination", "Anti-LGBTQ Email Threatens 'Trouble' For LI Street Festival"], "summ2": ["HRC Foundation Youth Ambassador Spotlight: Zimar Batista", "A Transgender Anti-Discrimination Law Won't Mark The End Of Women's Sports", "Christian College President Expands His Attacks on LGBT People: “Hate Under the Banner of ‘Love’”", "'Pose,' 'Steven Universe,' and Hannah Gadsby All to Receive Peabodys"]}
{"comp": "C_RC", "month": "Aug", "feats": "sbert", "test": 0.6205, "summ1": ["Mayor Meets Pope | Inside Mind Of A Serial Killer | LA Today", "French first as 'homophobic chants' stop football game", "Transgender issues sharply divide Republicans, Democrats", "Jackie Webb again leads bipartisan group to push LGBTQ protections"], "summ2": ["NHS worker who blackmailed Grindr dates with naked photos is jailed", "John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Baltimore Museum of Art Dedicates a Year of Exhibitions to Art Made by Women", "Anti-LGBT discrimination is now official PA policy"]}
{"comp": "ER_R", "month": "Aug", "feats": "sbert", "test": 0.6205, "summ1": ["INTOLERANT PALESTINIAN Authorities Ban LGBTQ Members From West Bank…WARN They’ll Be Chased, Arrested, Brought To Trial", "Students Aim to Oust LGBT ‘Pride,’ Events From Houston Campus", "Stacey Abrams Is an Election Fraud, Libs Don't Care About LGBTQ", "The LGBT Lobby: Not The Same Thing as People Who Are Gay"], "summ2": ["Activists Vilify Pastor Arrested For Enacting Plot Of Celebrated Gay Movie", "The unhinged left-wing reaction to Log Cabin Republicans’ Trump endorsement", "Federal government to investigate Connecticut policy allowing biological males to compete in high school girls sports", "Andrew Scheer said gay couples lack ‘inherent’ quality of marriage in tape of 2005 speech unearthed by Liberals"]}
{"comp": "ER_R", "month": "Jul", "feats": "sbert", "test": 0.62, "summ1": ["Trans Predator Demands ‘Topless’ Party For 12-Yr-Olds", "LGBT Outlets Play the Victim After Amazon Banned Books By Renowned Clinical Psychologist Joseph Nicolosi ⋆ Activist Mommy", "Family Matters: How a US Member of Congress was Raised by the Red-Green Axis", "Schumer Accepted Thousands in Donations from Child Sex Trafficker Jeffrey Epstein"], "summ2": ["Nobody should listen to Jeremy Corbyn's Iran views", "Transgender teen raped on first night out as a woman escapes by biting attacker on the penis", "LGBTQ Activism May Be Turning into Overreach by Supporters", "Denomination Kicks Out Whole Congregation Over Disagreement With LGBT Policy"]}
{"comp": "LC_R", "month": "Jul", "feats": "bow", "test": 0.6197, "summ1": ["13 brands giving back to LGBT+ charities with Pride products", "Trans groups to Supreme Court: Title VII bans anti-trans discrimination", "Same-sex marriage: MPs set to vote on Northern Ireland law", "Nicki Minaj cancels performance in Saudi Arabia in show of support for women's rights and gay rights"], "summ2": ["Woman Forced To Close Business After Refusing To Wax Male Genitals Of Transgender Person", "WaPo Claims There's A 'Surge' In Right-Wing Terrorism. There Isn't", "U.S. Women's soccer star Ashlyn Harris calls Jaelene Hinkle homophobic", "Drag Queen Reads During Pride Month Service at Cincinnati Church"]}
{"comp": "C_RC", "month": "Jul", "feats": "sbert", "test": 0.6191, "summ1": ["Norma McCorvey: The Woman Who Became ‘Roe’—Then Regretted It", "Genderqueer lesbian denied a Metro bus ride after Cincinnati Pride", "Polish 'I am LGBT' campaign attracts tens of thousands of Twitter supporters", "Bipartisan bill would improve reporting of hate crimes"], "summ2": ["Titus authors bill to report global LGBT abuses, create asylum path", "Bullied by peers, LGBT+ children in India drop out of schools", "Hindu-Muslim, India-Pakistan, same sex love story breaks all barriers. Internet is in love", "Out and proud: Self-affirmation is important for LGBTQ citizens"]}
{"comp": "C_RC", "month": "Sep", "feats": "sbert", "test": 0.6188, "summ1": ["Bosnians to march for Gay Pride - under heavy police protection", "LGBQ+ adults’ experiences of Improving Access to Psychological Therapies and primary care counselling services: informing clinical practice and service delivery", "Kim Davis, a longtime Democrat, becomes Republican amid gay marriage fury", "Arizona Supreme Court protects business' religious right to reject work for same-sex marriages"], "summ2": ["Chennai LGBTQ community celebrates Section 377 verdict anniversary", "John Abraham was asked why Kerala has not been Modi-fied yet. His answer is pure gold", "Editorial: Lawmakers can act to make Ohio fair for gay and transgender people", "‘Hundreds could be implicated’: With Epstein court docs to be unsealed, who should start worrying?"]}
{"comp": "LC_RC", "month": "May", "feats": "sbert", "test": 0.6187, "summ1": ["Once-prominent 'conversion therapist' will now 'pursue life as a gay man'", "Why Trump judicial nominees won't endorse Brown v. Board of Education", "The case for a 'pregnant male' emoji", "Pride and gay sex illegal: Beirut, Lebanon fights back with LGBTI flags"], "summ2": ["House approves sweeping bill to expand gay rights", "Maajid Nawaz Shuts Down Caller Who Likened Teaching LGBT Equality To \"Beating Your Wife\"", "Ban on gay conversion therapy debated in Texas Legislature, but no vote taken", "EU polls: Meet the desis on two sides of Brexit fight"]}
{"comp": "C_LC", "month": "Jun", "feats": "sbert", "test": 0.6183, "summ1": ["Buttigieg pays tribute to victims on anniversary of Pulse nightclub shooting", "LGBTQ Shelter Opens In San Jose As New Haven Inn", "Two in Three Americans Support Same-Sex Marriage", "Ministers condemn bishop's 'unchristian' call for boycott of LGBT pride events"], "summ2": ["Laura Bullard: One Closet, Two Secrets", "Boston’s 49th Pride Parade is a bright and colorful affair", "Nigel Farage defends Ann Widdecombe over gay therapy comments", "Donald Trump Blasted for 'Fake' Tweets Celebrating and Recognizing LGBT Pride Month"]}
{"comp": "LC_RC", "month": "Mar", "feats": "sbert", "test": 0.6182, "summ1": ["Homophobic arsonists torch HIV testing center in Athens", "Now is the Time to Pass the Equality Act", "Sam Smith comes out as non-binary: 'I'm not male or female'", "Editorial: Blocking H.R. 1, the GOP seems afraid of democracy"], "summ2": ["Capital City Equality Center to be named after LGBTQ advocate Stephanie Mott", "Malaysia will not stop its guests based on sexual orientation: Tourism Ministry", "Gay clergy, marriage ban causes rift for Methodists", "Explainer: What the School Act and the Education Act say about LGBTQ student and employee rights"]}
{"comp": "LC_R", "month": "Jul", "feats": "sbert", "test": 0.6177, "summ1": ["NYC hate crime probe underway after latest Pride flag burning at gay bar", "Nicki Minaj backs out of Saudi Arabia concert to show her 'support for the rights of women and the LGBTQ community'", "Brexit: Bid to make no deal more difficult scrapes through Commons", "Why your place of work should be LGBTI-friendly all year, not just for Pride"], "summ2": ["Nobody should listen to Jeremy Corbyn's Iran views", "Gay people exist because pregnant women have anal sex, says Cypriot bishop in shocking statement", "LGBTQ Activism May Be Turning into Overreach by Supporters", "U.S. Women's Soccer Team Accused Of Snubbing Star Player For Christian Views"]}
{"comp": "C_R", "month": "Apr", "feats": "sbert", "test": 0.6175, "summ1": ["Trump civil rights official wants to defend abortion opponents and religious freedom", "Costa Rica's top court rules against gay marriage ban", "OUT MetroWest Hosts Local LGBTQ Elected Officials", "Baby boomers ‘de-gay’ to survive life in Scottish care homes"], "summ2": ["House Dem: Religious rights must bow to LGBT", "Parental involvement detects, stops stealth indoctrination", "Kentucky BBQ Food Truck Owner Sees Backlash After ‘LGBTQ’ T-Shirts", "Pete Buttigieg targets VP Mike Pence while speaking on homosexuality: 'Your quarrel, sir, is with my creator'"]}
{"comp": "C_LC", "month": "Sep", "feats": "sbert", "test": 0.6175, "summ1": ["Bosnians to march for Gay Pride - under heavy police protection", "Tony Dungy has 7 adopted kids living under his roof ages 3 to 18", "Japan grants long-term resident status to transgender foreign national for first time", "Chris Smith votes \"No\" on Violence Against Women Act - again."], "summ2": ["Normal review – lawyers in bikinis to dogma in the doll's house", "The ex-gay Christianity movement is making a quiet comeback. The effects on LGBTQ youth could be devastating.", "Elizabeth Warren highlights violence against transgender women of color, reads names of those killed this year", "'It’s the one day we’re not outcasts': Hundreds parade through London for first ever Trans Pride march"]}
{"comp": "ER_R", "month": "Feb", "feats": "bow", "test": 0.6166, "summ1": ["Conservative groups in Texas attack gay rights proposals as effort to ‘ban the Bible’", "And There It Is--> Final Piece of Jussie Smollett MAGA Assault Illusion Turns Out to be Complete Crap", "Transgender Activist Accused of Burning Down Own Home, Killing 5 Pets in Hate Hoax Crime", "Victoria to make it against the law to help LGBTQ people who question their own sexuality: They're denying the experiences of all former homosexuals · Caldron Pool"], "summ2": ["Democrat Senator Asks Judicial Nominee to Answer Whether Gay Marriage Is ‘Sinful’", "DC school boycotting sports at Karen Pence's Christian school over LGBT policy", "Black Civil Rights Activist Calls for Arrest of Smollett, “Could’ve Created a Race War”", "Actress lashes out at Chris Pratt for attending ‘anti-LGBTQ’ church — then she doubles down"]}
{"comp": "L_RC", "month": "Sep", "feats": "bow", "test": 0.6148, "summ1": ["Louisiana Is Using Its Anti-Gay Sodomy Laws to Harass Sex Workers", "Trump claimed that gay people ‘like the job’ he’s doing. Yes, really", "'Riverdale' Honored With Major Award For LGBTQ+ Inclusion", "Elizabeth Warren addresses the one anti-LGBTQ blemish on her record – ThinkProgress"], "summ2": ["Swat police ask non-local transgenders to quit Mingora city", "LGBT activist files new court challenge against gay-sex law", "Karl Rove says he didn't engineer anti-gay marriage amendments. He did.", "377 anniversary this week but for queers in Kashmir, there is no ‘gay liberation’"]}
{"comp": "LC_R", "month": "Sep", "feats": "bow", "test": 0.614, "summ1": ["Bosnians march in first Gay Pride under tight police protection", "New York City Debates Repealing Conversion Therapy Ban", "How Do Transgender Women Have An Advantage in Sports?", "Jerry Falwell, Jr. Sends Out a Dog Whistle to Trump’s Racist Base"], "summ2": ["CNN to Host LGBTQ Democratic Presidential Town Hall", "Arizona Supreme Court Upholds Free Speech & Religious Freedom", "Federal judge sides with Christian orgs in LGBT adoption case", "BBC teaching kids 100 genders exist, can go to prison for 'disrespecting' gender identities"]}
{"comp": "C_RC", "month": "Feb", "feats": "bow", "test": 0.6138, "summ1": ["Chicago police release 2 men questioned in Smollett case", "Living in Venezuela now is hard. Being LGBT+ makes it harder", "Methodists reject a proposal to allow openly gay clergy, same-sex marriage", "State superintendent visits San Diego to push for LGBTQ student support bill"], "summ2": ["United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "New NJ law requires students learn about handling money", "Local LGBTQ community disappointed over alleged Smollett incident", "Ontario government considered removing sex-ed classes completely"]}
{"comp": "C_LC", "month": "Aug", "feats": "bow", "test": 0.6137, "summ1": ["Tulsi Gabbard's Ratings and Endorsements", "Bill Maher says he's 'glad' David Koch is dead", "U.S. judge allows first transgender person to sue under disability law", "New genetic links to same-sex sexuality found in huge study"], "summ2": ["Pride Cymru urged to reconsider GE support", "Green party failed to properly investigate child abuser – report", "Same-Sex Marriage in Europe", "Critic's Notebook: At Madison Square Garden, Barbra Streisand Delivers Blistering Attacks on Trump"]}
{"comp": "LC_R", "month": "Apr", "feats": "bow", "test": 0.6121, "summ1": ["U.S. Supreme Court takes up major gay, transgender job discrimination cases", "Chicago Elects First Black Female Mayor", "Brunei begins Saudi-style 'death-by-stoning' punishment for gay s", "Mormon Church Reverses Anti-LGBTQ Policy"], "summ2": ["Supreme Court & LGBT -- SCOTUS to Consider LGBT Job-Discrimination Cases", "Parents sue son's Connecticut school for 'unfairly' suspending him over 'conservative' views", "Bethany Christian to Place Children in LGBT Homes in Michigan", "Pete Buttigieg targets VP Mike Pence while speaking on homosexuality: 'Your quarrel, sir, is with my creator'"]}
{"comp": "C_LC", "month": "Jan", "feats": "bow", "test": 0.611, "summ1": ["Patricia Wald 'Pursued Justice With Passion,' Justice Ginsburg Says", "Dayton conference to focus on aging issues for LGBT community", "Party will honor Boulder County's place in same-sex marriage history", "Exclusive: Retired U.S. military chiefs fight Trump trans ban"], "summ2": ["Time for a woman or person of color to lead the Human Rights Campaign?", "With the chemsex scene booming, are gay men using drugs to medicate complex issues around sex?", "Nearly one in 50 US teen students see selves as transgender, government reports", "Kevin Hart shuts down rumors he'll still host the Oscars: 'It didn't work out'"]}
{"comp": "LC_RC", "month": "Aug", "feats": "sbert", "test": 0.6101, "summ1": ["Ignore the Straight Pride Parade or fight it? LGBTQ community divided over how to respond", "Religious leaders to lobby MPs ahead of abortion vote", "Vegas man accused of plotting to bomb synagogue or LGBTQ bar", "The Ballad of Rowan County — Love Still Wins"], "summ2": ["John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Anti-LGBT discrimination is now official PA policy", "Cos recruit LGBT+, but right talent rare", "Priest accused of stealing $98K from church to pay Grindr hookups"]}
{"comp": "LC_R", "month": "Aug", "feats": "sbert", "test": 0.6097, "summ1": ["‘A cesspool of hate’: U.S. web firm drops 8chan after El Paso shooting", "In Pride Month, India’s LGBT community could be even prouder if it healed internal divisions", "STUNNER: Log Cabin endorses Trump for re-election", "Children’s Media and the Fetishization of Queerness"], "summ2": ["Caleb Kaltenbach on giving grace to the LGBT community", "Study Finds Increasing Number of Republicans and Independents Say Colleges are Bad for America", "Women’s Shelter Is Granted Temporary Legal Protection after Transgender Man Filed Lawsuit for Being Denied Entrance", "Ilhan Omar calls those who demand LGBT rights in Middle East ‘Deplorable’"]}
{"comp": "C_LC", "month": "Mar", "feats": "bow", "test": 0.6081, "summ1": ["Report: Improper Voting Uncovered at Decisive Methodist Vote on LGBT Issues", "Kesha to headline Dan Reynolds' LGBTQ festival LOVELOUD", "Tennessee House passes contentious anti-discrimination bill", "Appeals court clears path for Pentagon to enforce transgender ban April 12"], "summ2": ["Exclusive: Meet the startups in Backstage Capital’s first accelerator cohort", "Global Queer News", "Think being LGBTI has nothing to do with Brexit? Think again", "In Muslim Malaysia, uproar over LGBT groups at Women's Day march"]}
{"comp": "LC_RC", "month": "Jul", "feats": "sbert", "test": 0.6077, "summ1": ["House approves PRIDE Act to give gay couples refund on back taxes", "Megan Rapinoe's message to her critics: 'I think I am extremely American'", "Young people not getting objective advice because of trans lobby pressure", "Why your place of work should be LGBTI-friendly all year, not just for Pride"], "summ2": ["Titus authors bill to report global LGBT abuses, create asylum path", "Bullied by peers, LGBT+ children in India drop out of schools", "Out and proud: Self-affirmation is important for LGBTQ citizens", "Trost's anti-gay marriage ad is discriminatory, OUTSaskatoon says"]}
{"comp": "R_RC", "month": "Apr", "feats": "bow", "test": 0.6069, "summ1": ["Supreme Court & LGBT -- SCOTUS to Consider LGBT Job-Discrimination Cases", "Parents sue son's Connecticut school for 'unfairly' suspending him over 'conservative' views", "Pete Buttigieg targets VP Mike Pence while speaking on homosexuality: 'Your quarrel, sir, is with my creator'", "California airport to open a Chick-fil-A — but city council isn’t happy: Make it the ‘gayest Chick-fil-A in the country’"], "summ2": ["Supreme Court to hear LGBT job discrimination cases", "Lori Lightfoot elected Chicago mayor, making her the first African-American woman to lead the city", "New community hub aims to represent, empower LGBTQ youth in Regina", "United Methodists spar over LGBT policy issues"]}
{"comp": "LC_RC", "month": "Jan", "feats": "sbert", "test": 0.6065, "summ1": ["Gay men plead guilty after having threesome on the London Underground", "Chechnya 'concentration camps' a sickening reminder of LGBTI persecution", "Jerry Brown’s legacy: diversifying the judicial bench", "Ellen DeGeneres' support for Kevin Hart sparks debate in LGBTQ community"], "summ2": ["LGBTQ community raise objections against Transgender Bill", "Trump Is Right About One Thing: 'The Economy Does Better Under The Democrats'", "This ‘Black Israelite’ from Brooklyn sparked the Covington controversy", "Workers can still lose jobs for being gay"]}
{"comp": "L_R", "month": "Jul", "feats": "bow", "test": 0.6054, "summ1": ["This gay millennial is challenging a 76-year-old homophobe for a NY Congressional seat", "Rights Activists Alarmed as Pompeo Installs Anti-Gay Anti-Abortion Activist to Head New Commission on ‘Natural Law’", "Brighton Trans Pride’s ‘amazing turnout’ showcases ‘all that’s been achieved,’ says MP", "Even though ‘he’s racist as f*ck’: Black MAGA supporters explain why they still back Trump"], "summ2": ["DC’s LGBT Community Encouraged To Harass Trump’s Deputy Press Secretary Out Of Gay Bars", "Trans Woman Shutters Immigrant’s Business For Refusing To Wax Male Genitalia", "Openly gay US soccer star — who unleashed numerous f-bombs during team's World Cup parade — calls Christian player 'homophobic'", "Christian Children Suspended For Resisting LGBTQ+ Brainwashing"]}
{"comp": "C_LC", "month": "Jul", "feats": "bow", "test": 0.6048, "summ1": ["Oglala Sioux Tribe legalizes same-sex marriage", "House approves amendment to reverse transgender military ban", "Slain Russian gay-rights activist had received threats: campaigner", "Millions celebrate LGBTQ pride in New York amid global fight for equality"], "summ2": ["A Victim of the Anti-Gay Purge in Chechnya Is Speaking Out", "Northern Ireland bill - what happens next?", "As a black gay man, I won’t be marching at Pride this weekend – here’s why", "Tinder launches new safety feature for LGBTQ users when travelling to 70 countries where being gay is still illegal"]}
{"comp": "LC_RC", "month": "Aug", "feats": "bow", "test": 0.6047, "summ1": ["Barack Obama speaks out and declares support for same-sex marriage", "Vegas man accused of plotting to bomb synagogues, LGBTQ bar", "New Trump administration rule would allow 'religious litmus test' for federal contractors, advocates say", "Ariana Grande returns to Manchester to play poignant Pride show"], "summ2": ["Palestinian Authority bans LGBTQ activity in West Bank", "A year after SC's Sec 377 order, LGBT+ community waits for inclusive laws", "John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Maples, 69, dies, was advocate for gay rights"]}
{"comp": "LC_R", "month": "Mar", "feats": "sbert", "test": 0.6046, "summ1": ["There’s been a huge amount of discussion about a speech I gave last week.", "How Willie Wilson changed his mind on LGBTQ people and endorsed Lori Lightfoot", "Greece's LGBTI people defiant in face of homophobic arson attack", "In Muslim Malaysia, uproar over LGBT groups at Women's Day march"], "summ2": ["San Antonio Bans Airport Chick-Fil-A Due to 'Anti-LGBTQ Behavior'", "Joe Biden Clarifies 'Decent Guy' Pence Comments", "Martina Navratilova, Who Beat Communism, Got Eaten By The Trans Mob", "‘Courageous’ Muslim Parents in UK Boycott Brainwashing ‘Homosexuality Project’"]}
{"comp": "C_RC", "month": "Aug", "feats": "bow", "test": 0.6045, "summ1": ["Bill Maher says he's 'glad' David Koch is dead", "Homophobia seen rising in European countries without gay marriage", "U.S. judge allows first transgender person to sue under disability law", "Gay pride parade held in Polish city of Plock"], "summ2": ["Palestinian Authority Bans LGBTQ Activity in West Bank", "John Ivison: Andrew Scheer goes at his critics head-on over gay marriage and abortion", "Man uses LGBT dating app for extortion, held", "Should Title VII Civil Rights Protections Include the LGBTQ Community?"]}
{"comp": "C_R", "month": "Aug", "feats": "bow", "test": 0.6044, "summ1": ["Armed man arrested on way to L.A. gay pride parade pleads not guilty", "What is the approach across Europe to transgender identity?", "Drag show featuring Down syndrome performers back on following controversy", "New Trump administration rule would allow ‘religious litmus test’ for federal contractors, advocates say"], "summ2": ["Fake outrage over Trump’s ‘anti-LGBT’ Labor Department rule", "Palestinian Authority bans LGBT activities in West Bank", "Activists Vilify Pastor Arrested For Enacting Plot Of Celebrated Gay Movie", "Biden claims he was accused of being gay in 1972 for supporting women's rights"]}
{"comp": "LC_RC", "month": "Sep", "feats": "sbert", "test": 0.603, "summ1": ["Mississippi wedding venue refuses interracial pair over owner's Christian faith", "How your business can make a difference to LGBT inclusion", "Why ‘The Politician’ Star Ben Platt Hopes Trump Is Impeached", "All You Need to Know About the False Link Between Article 370 and Queer Rights"], "summ2": ["Chennai LGBTQ community celebrates Section 377 verdict anniversary", "Editorial: Lawmakers can act to make Ohio fair for gay and transgender people", "‘Hundreds could be implicated’: With Epstein court docs to be unsealed, who should start worrying?", "What could Sen. Mike Lee’s trip to Russia mean for relations with the U.S.?"]}
{"comp": "C_LC", "month": "Apr", "feats": "sbert", "test": 0.6019, "summ1": ["Polish leader: LGBT rights an import that threatens nation", "Our View: Good move to halt discrimination; political mischief blowin' in the wind", "United Methodist shows support for LGBTQ community amid controversy", "Gay Presidential Candidate Who 'Moved Closer to God' after Marrying Husband Addresses Mike Pence"], "summ2": ["Will we elect a white gay man before a woman?", "Brunei defends gay sex death penalty as more for 'prevention than to punish'", "LGBTQI need legislation", "Natalie Morales talks playing the first bisexual lead on a network sitcom"]}
{"comp": "C_RC", "month": "Sep", "feats": "bow", "test": 0.601, "summ1": ["U.S. man in same-sex marriage sues Japan government for long-term visa", "Whistleblower raises new questions for appeals court nominee", "San Ysidro Health opens clinic with specialized services for LGBTQ patients", "Bosnians march in first Gay Pride under tight police protection"], "summ2": ["Father's behaviour toward transgender child an act of violence, B.C. court told", "Chennai LGBTQ community celebrates Section 377 verdict anniversary", "President Nelson details church’s 2015, 2019 LGBT policies at BYU devotional", "Ayanna Pressley, AOC back anti-Straight Pride arrestees"]}
{"comp": "LC_RC", "month": "Apr", "feats": "bow", "test": 0.6009, "summ1": ["US trans troops return to 'dark days' under new policy, say LGBT+ groups", "Supreme Court to hear three cases pitting conservative religious views against LGBTQ rights – Baptist News Global", "Travellers heading to Brunei could face death penalty now applying to blasphemy and gay sex", "How Mayor Pete and Chasten Buttigieg Are Working to Lock up the LGBT Vote"], "summ2": ["Supreme Court to hear LGBT job discrimination cases", "Pete Buttigieg wants ‘the Mike Pences of the world’ to know his same-sex marriage ‘moved me closer to God’", "Saskatchewan NDP calls for province to introduce legislation to protect GSAs", "Twitter reacts to Church policy on children LGBT parents, 'apostasy'"]}
{"comp": "LC_R", "month": "Mar", "feats": "bow", "test": 0.5999, "summ1": ["In Muslim Malaysia, uproar over LGBTQ groups at Women's Day march", "Homophobic arsonists torch HIV testing center in Athens", "Taiwan LGBT Platform GagaOOLala Adds Gol Studios Production Hub", "Ex-Vegas headliner faints at 20-year sentence in porn case"], "summ2": ["Hundreds of Muslim parents launch new protest against school lessons they say promote homosexuality", "Alberta NDP to air ad attacking Jason Kenney’s record on LGBTQ rights", "Martina Navratilova, Who Beat Communism, Got Eaten By The Trans Mob", "San Antonio Airport Bans Chick-fil-A Over Anti-Gay Accusations"]}
{"comp": "L_LC", "month": "Jan", "feats": "sbert", "test": 0.5997, "summ1": ["Bay Area Reporter :: Lara breaks through pink ceiling", "Trump Attacked LGBT Rights in 2018, and He’s Far From Done", "Covington Catholic School Student Says Wearing Blackface Was Showing 'School Spirit'", "Watch this heartwarming short film about queer love and acceptance"], "summ2": ["Gay couple file for marriage in Yokohama, challenges law：The Asahi Shimbun", "Fight prejudice by making LGBT+ lives more visible", "Anti-Catholic bigotry of many in DUP still significant", "Alexandria Ocasio-Cortez: House Speech Breaks C-SPAN Record"]}
{"comp": "ER_R", "month": "Jun", "feats": "bow", "test": 0.5991, "summ1": ["LGBT parents begin physically maiming their own children in botched transgender mutilations", "Trump Celebrates LGBT Pride Month And Calls For Decriminalization of Homosexuality In Nations Where It Is Illegal", "Are Abortion & Gay Rights American Values?", "Whistle-Blower: Middle School Curriculum Teaches 10-Year-Olds To Do Oral, Anal, Put Condoms on Dildos"], "summ2": ["Bernie storms Iowa and says he was gay-friendly before it was 'politically popular'", "Christian baker Jack Phillips sued for the third time over LGBTQ cake order", "Trump’s LGBT pride tweet reinforces the exploitation of sexual minorities 50 years after Stonewall", "Head teacher says 'mass arrests' are a possibility after High Court bans LGBT lesson protests"]}
{"comp": "L_LC", "month": "Sep", "feats": "bow", "test": 0.5985, "summ1": ["Truck driver ‘shot trans woman in the chest’ in transphobic hate crime", "Arizona Supreme Court rules ‘devout Christian’ artists can discriminate against LGBT+ couples", "The world’s first professional transgender boxer has just made history yet again", "Trump’s gay press aide slammed for claiming Mike Pence isn’t ‘anti-gay’"], "summ2": ["On MLK holiday, walking for civil rights and the Second Amendment", "'People need to be educated more now than ever' - LGBT campaigner wants more support for South Asian community", "Homophobic hate crime charges fall as reports soar", "One year after landmark ruling for LGBT+ rights in India, challenges persist"]}
{"comp": "L_LC", "month": "Aug", "feats": "bow", "test": 0.598, "summ1": ["A school is being sued after the vice principal told a trans teen to expose himself", "Trump dodges and gives an accidentally revealing answer when confronted on his anti-LGBT policies", "Straight Pride Organizer Says ‘White Caucasians’ Founded U.S. – Her Gay Son Calls Parade ‘Dog Whistle’ to White Supremacy", "Zambian police stormed a man’s house because he was having gay sex, local reports claim"], "summ2": ["Vegas man accused of plotting to bomb synagogues, LGBTQ bar", "There Is Plenty of Gay Sex in Karachi, Pakistan", "Brave beginnings of Calgary Pride and gay rights movement", "Government contractors could refuse LGBT+ workers under new U.S. religious exemption"]}
{"comp": "C_RC", "month": "Jun", "feats": "sbert", "test": 0.5966, "summ1": ["New York to get 'largest LGBTQ pride flag' at Roosevelt Island", "Emerging Consensus on LGBT Issues: Findings From the 2017 American Values Atlas", "How journalists can take care of themselves while covering trauma", "Ministers condemn bishop's 'unchristian' call for boycott of LGBT pride events"], "summ2": ["On the 50th anniversary of the Stonewall Riots, where to celebrate Pride across the U.S.", "Israel Folau calls for trolls to stop attacks on Magda Szubanski over GoFundMe page", "‘Fear and shame holding LGBT community back’", "Bhutan Has Another Reason To Celebrate As World’s Happiest Country Decriminalises Homosexuality"]}
{"comp": "C_RC", "month": "Mar", "feats": "sbert", "test": 0.5965, "summ1": ["Kamala Harris: Attention surrounding Omar puts her at risk", "Union County Hosts 3rd Annual LGBTQ Pride Event in June", "Botswana's High Court postpones decision in gay sex case", "LGBT Nondiscrimination Protections: Popular but Not Widely Adopted"], "summ2": ["EXPLAINER: What the School Act and the Education Act say about LGBTQ student and employee rights", "'Where are we going as a church?' In Dallas area, we Methodists have seen this anti-LGBTQ rerun too often", "In Muslim Malaysia, uproar over LGBT groups at Women's Day march", "Indefensible: With no good explanation, prosecutors give Jussie Smollett a pass"]}
{"comp": "LC_RC", "month": "Feb", "feats": "sbert", "test": 0.596, "summ1": ["W. Va. lawmaker criticized for comparing LGBT people to the KKK", "The long wait for legalized surrogacy may soon end in New York", "Ek Ladki Ko Dekha Toh Aisa Laga director on Bollywood's first major LGBT film", "The debunking of Jussie Smollett has gotten more attention than his initial allegation"], "summ2": ["Arkansas court rules city can't enforce LGBT protections", "Award-Winning Activist Jay Lin on Sharing LGBT Stories with Asia", "United Methodist delegates defeat bid to ease LGBT bans", "Why do schools like BYU matter? Interfaith panel reflects on the state of faith-based higher education"]}
{"comp": "LC_RC", "month": "May", "feats": "bow", "test": 0.5952, "summ1": ["A brief history of a marketing masterpiece: branding the anti-abortion movement “pro-life”", "Birmingham City Council wins injunction to stop protests against LGBTQ lessons at primary school", "Taiwan man behind Asia's first gay marriage law urges others to fight", "'In our culture, you shut up and put up'"], "summ2": ["West Bengal: Former mayor focuses on youth, LGBT community for poll vault", "Hundreds of children taken out of school during campaign against LGBT lessons", "House approves sweeping bill to expand gay rights", "Taiwan becomes first country in Asia to legalize same-sex marriage"]}
{"comp": "LC_RC", "month": "Mar", "feats": "bow", "test": 0.5936, "summ1": ["In Muslim Malaysia, uproar over LGBTQ groups at Women's Day march", "Beyonce speaks out over Donald Trump plan to abolish trans youth protection", "LGBTQ Reads: A Home at the End of the World", "Georgia House approves bill creating penalties for hate crimes"], "summ2": ["North Shore pastors dismayed at United Methodist Church's LGBTQ stance: 'I am heartbroken and disappointed'", "Sir Elton John backs George Clooney’s Brunei hotel boycott over anti-LGBT laws", "‘Catalyst for change’: LGBTQ advocate Stephanie Mott honored at Statehouse service", "UCP would roll back school protections for LGBTQ students, add new provincial exams"]}
{"comp": "ER_R", "month": "Sep", "feats": "bow", "test": 0.5929, "summ1": ["NFL QB Drew Brees Under Fire By LGBT Magazine For Pushing \"Bring Your Bible To School Day\"", "Pete Buttigieg: ‘I’m Not out to Be President of Gay America’", "Right after San Fran designates all NRA members “terrorists,” California passes resolution blaming “religious groups” for all LGBT suicides", "Transgender Activists Terrorize Women's Rape Crisis Center with Hateful Graffiti"], "summ2": ["CNN to Host LGBTQ Democratic Presidential Town Hall", "Judge spares Catholic adoption agency from violating beliefs on gay marriage amid ongoing litigation", "Brees Rapped For Association With 'Anti-LGBT' Focus On The Family 'Bigots'", "Readers’ comments: This sinister Leftie conspiracy to undermine society"]}
{"comp": "R_RC", "month": "Apr", "feats": "sbert", "test": 0.5922, "summ1": ["Supreme Court to Consider Transgender Employment Rights Cases", "Shazam just 'revealed' the FIRST gay superhero in DC or Marvel and fans are going crazy", "Karen Pence says Pete Buttigieg is attacking her husband for 'notoriety'", "‘We Exist’: Former Gays and Transgenders Protest California’s Discriminatory LGBT Therapy Ban"], "summ2": ["The LGBT Community Deserves Anti-Discrimation Laws · 71 Republic", "Justin Trudeau to apologize for historic persecution of gay Canadians", "Jussie Smollett Tried to Mislead Police by Saying Attackers Were White: Lawsuit", "Methodists uphold bans on LGBT clergy, nuptials"]}
{"comp": "C_RC", "month": "Feb", "feats": "sbert", "test": 0.5892, "summ1": ["Dems mock Trump's pitch for Fourth of July celebration", "Spokane Valley transgender woman reflects on her military service and recent Trump decision", "United Methodist Church on edge of breakup over LGBT stand", "Kenya: LGBT+ Africans Optimistic As Kenya Set to Rule On Decriminalising Gay Sex"], "summ2": ["The United Methodist Church Bans Same-Sex Marriage and LGBTQ Clergy", "Ek Ladki Ko Dekha Toh Aisa Laga writer Gazal Dhaliwal talks about bringing LGBTQ stories to mainstream Bollywood- Entertainment News, Firstpost", "More delays on protecting LGBT+ students", "Pete Buttigieg becomes first openly gay Democrat to run for president"]}
{"comp": "C_LC", "month": "Mar", "feats": "sbert", "test": 0.585, "summ1": ["Trump to host Brazil's Bolsonaro at White House this month", "LGBTQ welcome at city Methodist church", "Clooney in boycott calls over Brunei's anti-LGBT laws", "SOGIE Equality Bill might start from scratch 19 years since proposal"], "summ2": ["Is Chicago as open-minded as we want to believe? We’re going to find out", "Senate GOP confirms Kavanaugh’s replacement, Trump’s 36th pick for powerful appeals courts", "Changing Face of Wales: 'Huge distance' travelled on LGBT attitudes", "In Muslim Malaysia, uproar over LGBT groups at Women's Day march"]}
{"comp": "C_RC", "month": "Jan", "feats": "sbert", "test": 0.5846, "summ1": ["Intersex people should not live in 'fear of humiliation': UK minister", "Gay Indiana mayor joins field of Democratic presidential hopefuls", "Seventh Circuit Rules Civil Rights Law Covers LGBT Bias", "Report: Killings of LGBT People in US Rose to Record in 2016"], "summ2": ["Will not allow gay sex in Indian Army, says Bipin Rawat", "LGBTQ community raise objections against Transgender Bill", "Tempted To Move Out Of The U.S.? New Zealand Wants To Help You Escape", "Viewers SHRED Ellen DeGeneres for forgiving Kevin Hart over 10yr-old homophobic tweets"]}
{"comp": "C_RC", "month": "Jun", "feats": "bow", "test": 0.584, "summ1": ["New York police commissioner apologizes for Stonewall raid in 1969", "Emerging Consensus on LGBT Issues: Findings From the 2017 American Values Atlas", "'Every day is straight pride': Proposal for Boston 'Straight Pride' parade sparks outrage", "O'Rourke pledges protections for LGBTQ people"], "summ2": ["On the 50th anniversary of the Stonewall Riots, where to celebrate Pride across the U.S.", "Scheer won't march in Pride parades this year, but Conservatives say they fight for gay rights in 'many ways'", "Lesbian couple attacked on bus gets blasted on social media ‘for being gay’", "‘Leave kids alone & let them grow up’: Putin says LGBT groups should not enforce their views"]}
{"comp": "LC_RC", "month": "Jun", "feats": "sbert", "test": 0.5837, "summ1": ["June is LGBT Pride Month -- here's everything you need to know", "Laura Bullard: One Closet, Two Secrets", "Prince William: 'I'd support my child if they were gay'", "Chicago elects 1st black female and 1st openly gay mayor"], "summ2": ["UN report lauds decriminalisation of gay sex by SC", "Contentious conversation with rabbi who’s against LGBTQ pride", "'A matter of great importance': Palm Springs men remember police raid at Stonewall Inn", "‘Fear and shame holding LGBT community back’"]}
{"comp": "C_LC", "month": "Jun", "feats": "bow", "test": 0.5829, "summ1": ["New York police commissioner apologizes for Stonewall raid in 1969", "Thousands join gay pride parades around the world", "Taylor Swift Pens Powerful Letter in Support of Pro LGBTQ Equality Act: 'We Have a Great Distance to Go'", "Det. Grayson Fritts won't be fired because of fear of free-speech lawsuits, Knox sheriff says"], "summ2": ["The Struggles of Rejecting the Gender Binary", "Celebrating LGBTQ Pride Month (in Photos)", "Gay couple beaten for refusing to kiss on London bus", "Ryan Murphy Sets Netflix ‘Prom’ Musical: Streep, Corden, Kidman, Ariana Grande, Awkwafina, Key, Rannels To Star"]}
{"comp": "L_LC", "month": "Mar", "feats": "sbert", "test": 0.5821, "summ1": ["The Best LGBTQ Movies On Netflix Right Now", "Senate Confirms Hate Group Staffer with ‘Weakest Legal Resume Imaginable’ to Lifetime Seat on U.S. Circuit Court", "My Pillow Founder: Trump 'Was Chosen by God' to Save America", "Lynn Patton skipped an important HUD meeting to help attack Cohen -- now she might be in trouble"], "summ2": ["How Willie Wilson changed his mind on LGBTQ people and endorsed Lori Lightfoot", "There’s been a huge amount of discussion about a speech I gave last week.", "Greece's LGBTI people defiant in face of homophobic arson attack", "In Muslim Malaysia, uproar over LGBT groups at Women's Day march"]}
{"comp": "C_RC", "month": "Apr", "feats": "bow", "test": 0.5812, "summ1": ["Buttigieg: 'Polite' people can still advance policies that hurt 'you and your family'", "Brunei invokes laws allowing stoning for gay sex, adultery", "The Church of Jesus Christ of Latter-day Saints is repealing controversial rules unveiled in 2015 that banned baptisms for children of gay parents and made gay marriage a sin worthy of expulsion", "Supreme Court takes up major gay, transgender job discrimination cases"], "summ2": ["Supreme Court to hear LGBT job discrimination cases", "UCP’s Kenney opts to keep Alberta candidate on the ballot despite ‘offensive’ comments about LGBTQ people", "Twitter reacts to Church policy on children LGBT parents, 'apostasy'", "Brunei anti-gay laws: Countries where LGBT relations are criminalised"]}
{"comp": "LC_RC", "month": "Jan", "feats": "bow", "test": 0.5802, "summ1": ["Two Winnipeg friends are creating a library by and for queer people of colour", "Hawaii’s Gabbard apologizes for past LGBTQ statements", "Who Will Trump's Transgender Troop Ban Affect?", "Louisiana schools unsafe for LGBT students, education group report says"], "summ2": ["Palm Springs pool getting unisex shower, formal policy after teens encounter trans woman", "Rising populism threatens LGBTQ in West and around the world", "Workers can still lose jobs for being gay", "Viewers SHRED Ellen DeGeneres for forgiving Kevin Hart over 10yr-old homophobic tweets"]}
{"comp": "L_LC", "month": "Jun", "feats": "sbert", "test": 0.5799, "summ1": ["STATEMENT: CAP’s Neera Tanden on ACA Final Rule Protecting LGBT Americans From Discrimination in Health Care and Insurance Coverage", "Trump just shivved Mike Pence & he didn’t see it coming", "Finding Pride in the Magic of Gender", "Jake Shears: I Love the Term ‘Queer.’ It Focuses on What Connects Us, No Matter Your Gender or Orientation"], "summ2": ["'Silenced' children of priests to share stories with French bishops", "'Harmful' gender stereotypes in adverts banned", "Here's What You Need To Know About The Chicago Pride Parade", "EDITORIAL: Fifty years of progress — but fight for gay rights goes on"]}
{"comp": "L_LC", "month": "Jun", "feats": "bow", "test": 0.5791, "summ1": ["This Latinx Millennial Helped Destroy Montana's Anti-Trans Law", "Donald Trump ‘celebrates LGBT Pride month’", "Louie Gohmert: Gay Islanders Would Die Out, Proving Gay Marriage Is Wrong", "Michelle Rodriguez: ‘Stonewall Is a Symbol for People Who Believe Love Is Ten Times More Powerful Than Hate’"], "summ2": ["York Pride 2019: Pupils from city's schools lead parade", "Teenagers held over homophobic attack on two women on London bus", "50 years after Stonewall, nothing has changed for LGBTIs in Egypt", "Ecuador passes same-sex marriage in a 'landmark week', LGBT campaigners say"]}
{"comp": "L_LC", "month": "Aug", "feats": "sbert", "test": 0.5778, "summ1": ["Texas Congressman says if El Paso shooter is charged with a hate crime, pastors will be next", "Trump claims ‘some of my biggest supporters’ are gay & support his plan to legalize discrimination", "Football game brought to a stop after fans reveal homophobic banners", "11 incredible trans people from history you won't learn about in school"], "summ2": ["In Pride Month, India’s LGBT community could be even prouder if it healed internal divisions", "STUNNER: Log Cabin endorses Trump for re-election", "Children’s Media and the Fetishization of Queerness", "Ukip suspends councillor who claimed floods were caused by gay marriage"]}
{"comp": "LC_RC", "month": "Jul", "feats": "bow", "test": 0.5778, "summ1": ["Election of gay lawmaker in Japan spurs hopes for same-sex marriage", "As a black gay man, I won’t be marching at Pride this weekend – here’s why", "Trans Woman's Killer Used the \"Gay Panic Defense.\" It's Still Legal in 42 States.", "NYPD investigating Megan Rapinoe posters vandalized with homophobic slurs as hate crime"], "summ2": ["Muslim TV station faces ban after broadcasting anti-gay & child marriage content", "London business owners double down on anti-LGBTQ statements", "Poll: Share of young adults comfortable with LGBTQ people drops from 63% to 45%", "Second lawsuit accuses Terry Bean, Oregon political influencer, of sex abuse"]}
{"comp": "LC_RC", "month": "Jun", "feats": "bow", "test": 0.5776, "summ1": ["Op-Ed: Why decriminalizing sex work is central for gender equity, public health, and racial justice", "London bus attack: Fifth arrest after gay couple who refused to kiss beaten", "Banning LGBT+ flags outside US embassies during Pride month ‘right decision’, Mike Pence says", "Lady GaGa Hails LGBTQ Community in Empowering Speech at Stonewall Day Concert"], "summ2": ["'6 or 5 genders… no idea what that even is': Putin says LGBT should not enforce their agenda on kids", "GSA membership protected under Alberta's privacy laws, says commissioner", "Why Pride Month Is More Important Than Ever", "Stonewall Inn focal point for gay rights celebrations, Sunday’s parade"]}
{"comp": "C_RC", "month": "May", "feats": "bow", "test": 0.5749, "summ1": ["House Approves Bill to Expand Gay Rights", "Kent State University Is LGBTQ-Friendly Campus", "Poles stage protest rally in support of LGBT activist", "Taiwan MPs Urged to Back Government in Asia 1st Same-Sex Marriage Law"], "summ2": ["Gay couples in Taiwan plan mass wedding registration after same-sex marriage legalised", "House approves sweeping bill to expand gay rights", "Times out and proud: Seeking: Love, acceptance, and the right to live life without apologies", "United Conservative Party cancels gay conversion therapy ban working group"]}
{"comp": "C_LC", "month": "Apr", "feats": "bow", "test": 0.5692, "summ1": ["Teacher at centre of LGBT row in Birmingham received death threat", "Supreme Court takes up major gay, transgender job discrimination cases", "Buttigieg: 'Polite' people can still advance policies that hurt 'you and your family'", "United Methodist shows support for LGBTQ community amid controversy"], "summ2": ["Black churches split over gay marriage and Obama", "Supreme Court to hear three cases pitting conservative religious views against LGBTQ rights – Baptist News Global", "Drag troupe 'The Sisters of Perpetual Indulgence' mark 40 years of 'dragtivism'", "Travellers heading to Brunei could face death penalty now applying to blasphemy and gay sex"]}
{"comp": "L_R", "month": "May", "feats": "sbert", "test": 0.5676, "summ1": ["An all-trans boy band wants to make history with their groundbreaking reality series", "Pete Buttigieg is reshaping politics and driving the religious right crazy in the process", "Senator Who Blocked LGBT Woman’s Nomination Mocked for Saying Equality Act Is Unnecessary and ‘Divides Our Nation’", "Bay Area Reporter :: Political Notebook: Growing list of East Bay cities celebrate Pride"], "summ2": ["Opposition, Alternatives Voiced For Sex Education in California Public Schools", "Trans woman who heckled Obama feels betrayed by the LGBT community", "Arthur Becomes 1st PBS Cartoon with a Gay Wedding – ‘It’s a Brand-New World’", "Mormon church opposes LGBT nondiscrimination measure"]}
{"comp": "L_R", "month": "Jul", "feats": "sbert", "test": 0.5572, "summ1": ["Pastor Refuses Funeral for Dying Tennessee Man Because His Son Is Gay", "Violence Against the Transgender Community in 2019", "'Pose' Just Got Nominated For Six Emmys", "Mexican boxer Dario Larralde says Hitler was right, ‘gays are a plague’"], "summ2": ["State-Enforced Sexual Assault.", "LGBTQ Activism May Be Turning into Overreach by Supporters", "US women's soccer player drops American flag between legs and dances to celebrate World Cup title. Benghazi hero is not pleased.", "Parents are left furious as Christian pupils aged just 10 are excluded from school for alleged homophobic remarks"]}
{"comp": "LC_RC", "month": "Feb", "feats": "bow", "test": 0.5548, "summ1": ["Jussie Smollett case: Hate crime or hoax?", "Olivia Colman and Rachel Weisz said 'gay rights' at the BAFTAs", "Kansas bills calling gay marriage a 'parody' copied from activist who sued to wed laptop", "New Study: Largest U.S. Churches Are Unclear on Women's Leadership"], "summ2": ["United Methodist Church votes to maintain opposition to same-sex marriage, gay clergy", "Gay rights activist accused of setting own home on fire", "More delays on protecting LGBT+ students", "After Losing $1 Billion to Tariffs, General Motors Announces 14,000 Layoffs"]}
{"comp": "C_RC", "month": "Apr", "feats": "sbert", "test": 0.5365, "summ1": ["Teaching acceptance: Las Cruces schools address transgender access", "Economy, Terrorism Top Issues in 2004 Election Vote", "Popular Central Pa. Wedding Venue, ‘Star Barn,’ Bans Gay Weddings Due To Religious Beliefs – CBS Pittsburgh", "Lawyers ask Vatican to denounce criminalization of homosexuality"], "summ2": ["Christians Can’t Back Out of the Foster System Now", "Supreme Court to take up LGBT job discrimination cases", "Ilhan Omar says death threats have increased since Trump tweet", "Loonie commemorating gay rights sparks backlash from activists"]}
{"comp": "C_RC", "month": "Jan", "feats": "bow", "test": 0.534, "summ1": ["A whole lotta love: Japanese lesbian couple plan wedding photos in 26 countries", "Rutgers Law School Welcomes 1st Female, Black, LGBT Dean", "Joe Gruters bill focuses on ending workforce discrimination against LGBTQ employees", "Retired US Military Chiefs Fight Trump Trans Ban"], "summ2": ["New York Police Treating Latest Attack on Orthodox Jew in Crown Heights as Hate Crime", "North Dakota Senate committee rejects LGBT anti-discrimination bill, but amendments expected", "Transgender woman accuses Gov. J.B. Pritzker's campaign of discrimination in federal lawsuit", "Donald Trump Jr. Mocks LGBTQ Students ‘Triggered’ By Chick-fil-A"]}
