{"comp": "C_ER", "month": "Sep", "feats": "sbert", "test": 0.8177, "summ1": ["HIAS opens Brussels office to bring Jews and non-Jewish asylum seekers together", "Mexico's stretched asylum agency needs more resources: U.N. refugee chief", "Judge restores nationwide block on Trump administration's asylum ban", "Scores of Tamil kids' asylum cases in the pipeline, advocates say"], "summ2": ["Sanders: 'Yes' I'm Courageous Enough to Talk About Population Control", "France: Military-aged Afghan migrant kills 1 and injures 9 during stabbing rampage in Lyon", "Lawsuit: Illegal Aliens Worked for 10 Years Using Stolen Identities at Plant", "California Judge Puts National Block on Donald Trump's Asylum Reform"]}
{"comp": "ER_LC", "month": "Sep", "feats": "sbert", "test": 0.7857, "summ1": ["Rosario Dawson: ICE Raids ‘Part of Larger White Nationalist Narrative’", "California Judge Puts National Block on Donald Trump’s Asylum Reform", "Illinois Hospital Set Up Comfort Room for Babies Born Alive after Botched Abortions -- Parents Welcome to Take Photos of Dying Baby", "North Carolina Jails Frees Hundreds of Illegal Immigrant Criminals wanted by Feds"], "summ2": ["Tamil asylum seeker family from Biloela 'terrified' for children after move to Christmas Island", "Federal Court dismisses Afghan interpreter’s protection visa claim", "Brexit: Bercow says parliament must meet 'without delay' as judges rule prorogation unlawful – live news", "Trump administration ready to deport, turn back more asylum seekers after Supreme Court ruling"]}
{"comp": "C_L", "month": "Mar", "feats": "sbert", "test": 0.7749, "summ1": ["Nigeria: Court Declares Deportation of Cameroonians From Nigeria Illegal", "Memo From San Diego Border Patrol Chief Tells Agents to Single Out Spanish-Speaking Asylum Seekers, Require Them to Wait in Mexico", "US struggling with growing number of asylum seekers", "7-year-old Guatemalan migrant died of sepsis while in US custody"], "summ2": ["DHS Secretary Nielsen defends the administration's immigration policies in contentious hearing", "Robert Mueller Recommends No Further Indictments In Russia Probe: Reports", "Republicans Are Denying Trump’s Completely Open Bigotry Against Muslims", "An immigration nightmare is unfolding in El Paso, one purposely created by the Trump administration"]}
{"comp": "ER_L", "month": "Jul", "feats": "bow", "test": 0.7729, "summ1": ["Democrat Congresswoman In Deep After Getting Caught Secretly Sending Staff Into Mexico To Coach Alleged “Illegals” Ie “asylum-seekers” ⋆ Joe For America", "NGO Captain in Court for Abetting Illegal Migration, Ramming Police Boat", "14 Illegals Amongst MS-13 Gang Members Charged with Machete Attacks", "Ilhan Omar Calls Illegal Aliens \"Undocumented Americans\" in Statement Opposing ICE Deportation Raids"], "summ2": ["ICE deportation raids will reportedly start this weekend", "Graham: ‘I Don’t Care’ If Migrants Are Detained For ‘400 Days’…’We’re Not Going To Let These People Go’", "US lost track of 1,500 immigrant children, but says it's not 'legally responsible'", "Policy of Denying Asylum Seekers Bail Struck Down By Judge"]}
{"comp": "C_L", "month": "Sep", "feats": "sbert", "test": 0.7709999999999999, "summ1": ["Trump asylum lockdown turns up heat on tiny Mexican migrant agency", "Judge in CA Reinstates Nationwide Block on Asylum Restrictions Aimed at Central Americans", "Aid budget raided to pay for refugees", "U.S. should side with Hong Kong protesters, says ex-Pentagon chief Mattis"], "summ2": ["Trump’s Asylum Policies Could Get People Killed", "An Invisible Crisis: Thousands of African Migrants Are Stranded in Mexico Hoping to Head North", "Supreme Court Ruling Carries Dire Implications for Asylum-Seekers", "US government watchdog details trauma experienced by separated migrant children"]}
{"comp": "L_RC", "month": "Jul", "feats": "sbert", "test": 0.7685, "summ1": ["The Washington Times Has History of Hyped Stories, Shoddy Reporting and Failing to Correct Errors", "In El Paso court, migrants no longer get legal advocates or pre-hearing briefings on their rights", "Watch: Mother of 19-Month-Old Girl Who Died After ICE Detention Testifies on Abject Cruelty of Trump's Anti-Immigrant Agenda", "If Left Unchecked, Trump Will Obliterate the Right to Asylum"], "summ2": ["Afghan asylum seeker asked shoppers if they were English, before attacking them with 10-INCH KNIFE", "Taiwan will consider granting Hong Kong protesters asylum, President Tsai Ing-wen says", "White House moves to block asylum for migrants crossing Mexico", "Illegal immigrants busted in Mexican cartel-linked drug operation in US"]}
{"comp": "C_R", "month": "Sep", "feats": "sbert", "test": 0.7679, "summ1": ["Mexico's stretched asylum agency needs more resources: U.N. refugee chief", "U.S. judge restores nationwide block on Trump administration's asylum ban", "Scores of Tamil kids' asylum cases in the pipeline, advocates say", "Greece moves to ease asylum-seeker crowding on Lesbos"], "summ2": ["Judge Blocks Ban on Asylum-Seekers Who Travel through Safe Third Country", "Pelosi: ‘Hell to pay’ if gun control bill doesn’t pass", "Loco in MOCO: The newest illegal alien arrested for rape in Montgomery County had criminal history, could have been deported", "Immigration Chief: Change Allows Focus on ‘Legitimate Asylum Claims’"]}
{"comp": "C_ER", "month": "Sep", "feats": "bow", "test": 0.7676, "summ1": ["Judge reinstates nationwide halt on Trump asylum policy plan", "U.S. credits Mexico, Central America for sharp drop in border arrests", "Tent courts set to open on border for U.S. asylum seekers", "U.N. refugee agency regrets U.S. ruling on asylum applications"], "summ2": ["North Carolina Jails Free Hundreds of Illegal Immigrant Criminals Wanted by Feds", "France: One Killed, Nine Wounded by Knife-wielding Afghan Migrant", "Study: 14.3M Illegal Aliens Living in U.S., Costing Americans $132B a Year", "House Democrats to Meet 4 PM Tuesday to Talk Impeachment"]}
{"comp": "ER_L", "month": "Aug", "feats": "sbert", "test": 0.7633, "summ1": ["Germany: Samurai Sword Killing Migrant Was Fake Refugee", "Criminal Illegal Alien Accused of Killing Colorado Father of Five", "TIME Mag: Koch Brothers Helping Illegal Immigrants Get Driver’s Licenses", "Trump Cracked Down On Illegals — Now A Mass Exodus Is Beginning – The Bearded Patriot"], "summ2": ["Trump Administration Launches Attack on Flores Agreement to Indefinitely Detain Migrant Children", "Court accepted gay asylum seeker before claiming boyfriend isn’t ‘effeminate’ enough", "If the Mississippi ICE Raids Were About 'The Law,' Why Were No Executives Marched Out in Cuffs?", "Trump blames everything but his own words for hate in America"]}
{"comp": "ER_LC", "month": "Aug", "feats": "bow", "test": 0.7617, "summ1": ["Beto O’Rourke: ‘Never Forget’ Trump’s ‘Role’ in El Paso Shooting", "Feds: Illegals Arrested in ICE Raid Stole Identities of American Citizens", "Germany: Asylum seeker rapes 9-year-old girl", "Poll: Majority of Blacks, Hispanics Support Anti-Illegal Immigration 2020 Candidates"], "summ2": ["Another Needless Death in US Immigration Detention", "Portland shuts emergency shelter as last asylum seekers move out of Expo", "Channel migrants: Sixty six people found in small boats", "Trump asks U.S. Supreme Court to allow full enforcement of asylum crackdown"]}
{"comp": "ER_LC", "month": "Aug", "feats": "sbert", "test": 0.7605, "summ1": ["Illegal Alien Raped 13-Year-Old Girl Multiple Times", "Former ICE Director: New Federal Arrest Numbers Prove 'Illegal Immigration Is Not A Victimless Crime'", "TIME Mag: Koch Brothers Helping Illegal Immigrants Get Driver’s Licenses", "Germany Rocked After Man Hacked to Death in Street by Syrian Migrant"], "summ2": ["Children forced to live in shipping containers across England", "What Conservative Pastors Didn’t Say After El Paso", "Immigrant advocates ask judge for nationwide policy for asylum-seekers", "Knife attack kills 1, injures 9 near Lyon; suspect detained"]}
{"comp": "ER_LC", "month": "Jan", "feats": "sbert", "test": 0.7563, "summ1": ["Illegal Alien Accused of Aiding Alleged Cop Killer was Deported Twice", "Report: Obama Admin Released Tens of Thousands of Illegal Immigrant Criminals", "‘Voice Of Hispanic America’ Salinas: Many Latinos ‘Buying’ Trump’s Arguments Against Illegal Immigration", "Secure Borders Protect Immigrant Communities"], "summ2": ["After years of Trump’s dire warnings, a ‘crisis’ has hit the border but generates little urgency", "Saudi teen who fled family leaves Thailand for asylum in Canada", "Australia to 'consider' Saudi woman's asylum plea", "U.S. to return first Central American asylum seekers to Mexico"]}
{"comp": "ER_L", "month": "May", "feats": "sbert", "test": 0.7546, "summ1": ["Trump Wants Migrants To Pay A Fee To Request Asylum", "Feds Released 168,000 Illegal Immigrant Into Communities", "The Political Insider", "SCARY! Illegal immigration the most common crime in America"], "summ2": ["Trump Was Tickled by the Idea of Shooting Migrants Because He Loves Violence", "READ: ICE Deputy Director Says of DNA Testing: ‘This is a Pilot Designed to Assess the Usefulness of this Technology in an Investigative Process’", "Trump plans to send a thousand immigrants a month to Broward and Palm Beach counties in Florida.", "Political prejudice of West exposed in granting asylum"]}
{"comp": "C_ER", "month": "Jan", "feats": "sbert", "test": 0.7545, "summ1": ["Saudi asylum seeker in Thailand en route to Canada after saga", "Fact-checking President Trump's Oval Office address on immigration", "The emergency at the border isn’t national. It’s regional", "Pakistani Christian woman freed over blasphemy, heading to Canada: lawyer"], "summ2": ["NY Times: ’40-Year’ Flood of Immigration Turns Orange County Blue", "Illegal Alien Accused of Aiding Alleged Cop Killer was Deported Twice", "Trump Sends Congress DHS Presentation on Illegal Immigration Threat That Dems Snubbed at WH", "Secure Borders Protect Immigrant Communities"]}
{"comp": "ER_RC", "month": "Jan", "feats": "bow", "test": 0.7544, "summ1": ["Poll: 8-in-10 Voters Want 'Tough' Restrictions on Legal Immigration", "U.S. Will Start Returning Asylum Seekers to Mexico on Friday", "Illegal Alien Accused of Killing Four in Nevada to Face Murder Charges", "Nancy Pelosi’s Heart Sinks When Her Office Congressional Office Is Raided By Throng Of Victims of Illegal Immigration"], "summ2": ["Saudi woman fleeing alleged abuse heads for asylum in Canada", "Hungary's wall effectively halted immigrants", "Asylum seekers to wait in Mexico under new Trump administration plan", "$500K bail set for suspected illegal immigrant in Northern Nevada killings"]}
{"comp": "C_ER", "month": "Mar", "feats": "sbert", "test": 0.7543, "summ1": ["Memo From San Diego Border Patrol Chief Tells Agents to Single Out Spanish-Speaking Asylum Seekers, Require Them to Wait in Mexico", "U.S. asylum seekers returned to Mexico despite fear claims under policy challenged in court", "Trump struggles to defend his record amid setbacks on trade, North Korea", "Libya: Police Crush Asylum Seekers' Protests"], "summ2": ["Germany: Migrant Crime Covered Up to 'Avoid Stirring Up Prejudice'", "PEW POLL: GOP Voters Overwhelmingly Support Stopping Illegal Immigration", "Exclusive—Bradley Byrne: Illegal Accused of Killing Sonya Jones Benefited from Catch and Release", "The Truth About Zero-Tolerance and Family Separation, What Americans Need to Know"]}
{"comp": "ER_RC", "month": "May", "feats": "sbert", "test": 0.7534, "summ1": ["Accused Illegal Alien Serial Killer Was Granted Green Card After Overstaying", "SCARY! Illegal immigration the most common crime in America", "Democrats Displace U.S. Kids to Favor Economic Migrants", "President Trump To Give Border Patrol New Tool That Will Help End Illegals Seeking Asylum For Good"], "summ2": ["Trump slaps Mexico with 5% tariffs of EVERYTHING until it solves US immigration problem", "Asylum seekers awaiting court dates in Mexicali face another challenge: Chickenpox", "’Not acceptable': Audits of federal government's performance cancelled due to insufficient funding, AG tells committee", "Editorial: Asylum crisis can’t be fixed by putting up more barriers"]}
{"comp": "ER_LC", "month": "Apr", "feats": "sbert", "test": 0.7528, "summ1": ["Expert: 'Liberal Coalition' Silent on Environmental Impact of Immigration", "Social Justice: White House Considered Releasing Asylum Seekers into Sanctuary Cities", "Five Time Deported Alien Invader Beats Baby To Death", "Trump Administration To Expand Program That Will Boot Illegal Alien ‘Asylum Seekers’ Back To Mexico"], "summ2": ["Trump visits the border and warns: 'Our country is full...turn around'", "Federal judge blocks Trump administration program forcing asylum seekers to remain in Mexico while awaiting court hearings", "US critical of Rudd's handling of asylum seekers", "Austin's ‘Refugee Is Not My Name' aims to introduce neighbors to neighbors"]}
{"comp": "L_RC", "month": "Mar", "feats": "sbert", "test": 0.7524, "summ1": ["Kirstjen Nielsen Says ‘We Don’t Use Cages for Children’—After U.S. Put Migrant Kids in Cages", "Local Immigrant Rights Advocate Stops ICE Agents", "Trump: Shooting Down Migrants With Machine Guns Is A 'Very Effective Way' To Control The Border", "Donald Trump Openly Mocks Asylum Seekers Fleeing Violence"], "summ2": ["Church of England decries Home Office for denying asylum over ‘violence’ in Christianity", "Trump policy that sends asylum seekers back to Mexico is about to be expanded to Texas", "$77 million in cocaine seized in largest NJ bust in years", "Kirsten Gillibrand wants to guarantee asylum seekers access to a lawyer"]}
{"comp": "ER_L", "month": "Sep", "feats": "bow", "test": 0.7521, "summ1": ["Afghan Asylum Seeker Goes on Stabbing Rampage Killing One and Injuring Nine Others", "Four-Time Deported Illegal Alien with Child Abuse Record Arrested in U.S.", "California Judge Puts National Block on Donald Trump's Asylum Reform", "Watch: Hudson Calls Out Democrats’ Silence on Women Sexually Assaulted on Their Way to the Border"], "summ2": ["Warnings That 'Lives Will Be Lost' After Right-Wing Supreme Court Allows Trump Asylum Ban to Take Effect", "Migrant Children Are Being Given To An Adoption Agency Linked To Betsy DeVos", "Trump’s Asylum Policies Could Get People Killed", "Judge blocks ICE from denying parole to asylum-seekers"]}
{"comp": "C_ER", "month": "Apr", "feats": "bow", "test": 0.7515, "summ1": ["The Latest: Court allows return of asylum seekers to Mexico.", "ICE Does Princeton/New Brunswick Immigration Sweeps", "US judge blocks Trump's 'Remain in Mexico' asylum policy", "African, Syrian migrants in crosshairs of Libya war"], "summ2": ["9th Circuit Says Trump Can Legally Deport Asylum Seekers Back to Mexico", "Trump Offers To Release Detained Illegal Aliens Into Sanctuary Cities, But Democrats Lose Their Minds", "Over 1M Illegal Aliens Expected to Arrive in U.S.: 'Merkel-Style Disaster'", "Migrant Thought It Was Okay to Rape Step-Daughter Under Irish Law"]}
{"comp": "C_ER", "month": "Jun", "feats": "sbert", "test": 0.7511, "summ1": ["Australia, PNG agree compromise on security deal for asylum seekers", "US border center scrutinized after teen found with preemie", "Central American migrants plead to seek asylum in U.S., not Mexico", "Trump: Immigration raids could start Fourth of July"], "summ2": ["Dems Promise to Take Away Our Health Insurance and Give It to Illegals", "Nancy Pelosi’s INSANE illegal immigration move", "Migrant Crossed Texas Border with Molotov Cocktail, Say Police", "Dalai Lama: Europe Will Become ‘Muslim’ if Migrants Allowed to Stay"]}
{"comp": "ER_L", "month": "Jan", "feats": "sbert", "test": 0.7486, "summ1": ["POLL: Only 7% of Respondents Think Illegal Immigration is Not a Problem", "GOP and Democrats Fully Fund a Border Wall - In Jordan", "Police: Two Illegals Helped Illegal Alien Evade Arrest for Officer's Murder", "PELOSI'S ANGEL: Illegal Alien Sentenced to 401 Years in Prison For Kidnapping, Rape, Lewd Sex Acts Upon a Child Under the Age of 14"], "summ2": ["A Saudi teen fled her family to seek asylum abroad. Now the whole world is watching.", "Donald Trump’s Failure to Address the Real Crisis at the Border", "Corporate Media Condemned for Handing Trump Megaphone to Spout Racist 'Stream of Lies'", "Border Wall Nearly Collapses During Testing, 13 Prototypes 'Breached' Along Mexican Border"]}
{"comp": "C_ER", "month": "May", "feats": "sbert", "test": 0.7458, "summ1": ["After drought, famine and war, ethnic conflict now plagues Ethiopia", "Appeals court allows U.S. to keep sending asylum seekers to Mexico", "GOP lawmakers lay out border security proposals for DHS", "Dozens of border patrol agents will soon be screening asylum cases"], "summ2": ["Federation for American Immigration Reform", "109,144 Goblins Raped the Border in April, 168,000 Released This Year, 87% Skipping Asylum Hearings", "Illegal Immigrant Accused of Killing California Police Officer Pleads Not Guilty", "Beto O’Rourke’s Mothers Day Message: ‘So Many’ Mothers Deported"]}
{"comp": "L_RC", "month": "Jan", "feats": "sbert", "test": 0.7452, "summ1": ["Federal judge denies Justice Dept. request to delay deadlines in asylum ban case due to shutdown", "Fox News anchor blasts Sarah Huckabee Sanders for lying about terrorists at the southern border", "Fact-checking Trump's immigration speech", "William Arkin on Homeland Security’s Creeping Fascism and Why the CIA & FBI Won’t Save Us from Trump"], "summ2": ["Saudi refugee in Thailand headed to Canada", "Editorial: Find compromise on immigration, shutdown", "Asylum seekers can't count on same response as Saudi teen: experts", "Trump administration to force some asylum seekers to wait in Mexico beginning Friday"]}
{"comp": "ER_LC", "month": "Jul", "feats": "bow", "test": 0.7446, "summ1": ["BREAKING: Tommy Robinson Re-Convicted for Reporting on Grooming Gang -- Faces Up To Two Years in Prison", "Ilhan Omar: Americans ‘Should Be More Fearful of White Men'", "Illegal Alien Teen Released into U.S. Charged with Raping 7-Year-Old Girl", "Illegal Aliens Panicking as ICE Director Vows This Major Plan – The Bearded Patriot"], "summ2": ["Trump's new anti-asylum rule faces court test in California", "Portland mayor accused of misinforming asylum seekers ahead of deadline to close temporary shelter", "More People Than Ever Depend on the Federal Government for Help. So Why Is Public Trust at an All-Time Low?", "Asylum ban may further strain immigrant detention facilities"]}
{"comp": "L_RC", "month": "Sep", "feats": "sbert", "test": 0.7441, "summ1": ["Off-the-Rails President Takes to Twitter in Anti-Semitic and Racist Rant", "An Invisible Crisis: Thousands of African Migrants Are Stranded in Mexico Hoping to Head North", "'Victory': Federal Judge Reinstates Nationwide Injunction on Trump Effort to Block Asylum Seekers at Southern Border", "US government watchdog details trauma experienced by separated migrant children"], "summ2": ["Company that runs immigration detention centers is top donor for three Texas congressmen", "Tamil asylum seekers: Melbourne rally, Di Natale slams Dutton over deportation attempt", "‘Not Only Minorities But Even Muslims Not Safe in Pak’: Ex-MLA of Imran Khan’s Party Wants Political Asylum in India", "Supreme Court clears way for Trump's new ban on migrants seeking asylum at the border"]}
{"comp": "C_L", "month": "Jan", "feats": "sbert", "test": 0.7438, "summ1": ["It’s time to finally cut off the jobs magnet for illegal immigrants", "UN officials interview Saudi teen asylum seeker in Thailand", "Young Saudi asylum-seeker arrives in Canada to official welcome", "U.S. to return first Central American asylum seekers to Mexico"], "summ2": ["CBP: This Week, A Record Number Of Asylum Seekers Entered The US Using Tunnels", "Highlighting Systematic 'Violation of International Human Rights', Ocasio-Cortez Shreds Trump Address", "Trump ready to throw Don Jr under the bus: CNN panel explains potential motive behind Rudy Giuliani’s meltdown", "Trump Already Found a New Caravan to Hype Up After the Shutdown Embarrassment"]}
{"comp": "ER_RC", "month": "Sep", "feats": "sbert", "test": 0.7426, "summ1": ["1,500+ take to the streets in Ireland to protest plans to establish a new ‘asylum center’", "MORE WINNING: Trump Reaches Deal to Send Asylum Seekers to El Salvador", "Rosario Dawson: ICE Raids ‘Part of Larger White Nationalist Narrative’", "Supreme Court Hand Democrats Devastating Defeat, Rules That President Trump's Asylum Rules Are In Fact Constitutional ~ illicit info"], "summ2": ["Company that runs immigration detention centers is top donor for three Texas congressmen", "Tamil asylum seekers: Melbourne rally, Di Natale slams Dutton over deportation attempt", "‘Not Only Minorities But Even Muslims Not Safe in Pak’: Ex-MLA of Imran Khan’s Party Wants Political Asylum in India", "Supreme Court Allows Trump Asylum Restrictions to Take Effect"]}
{"comp": "C_L", "month": "Jun", "feats": "sbert", "test": 0.7425, "summ1": ["Cuccinelli named acting head of Citizenship and Immigration Services", "Mexico eyes Brazil for U.S. asylum deal, Trump revives tariff threat", "The plight of asylum seekers in SA: No documentation, n...", "Trump digs in on Mexican import tariffs despite uproar"], "summ2": ["The Diabolical Plot Behind Trump Cabinet’s Weekly Prayer and Bible Lessons", "Immigrant Detention Conditions Were Atrocious Under Obama. Here’s Why They’re So Much Worse Under Trump.", "Democrats Use Immigrants as Pawns in Political Fight With Donald Trump", "A second transgender woman held by ICE for weeks has died & they’re denying responsibility again"]}
{"comp": "C_ER", "month": "May", "feats": "bow", "test": 0.7414, "summ1": ["Would be abuse of French legal system if ex-Interpol chief's wife wanted political asylum in France: China", "Trump vows tariffs on Mexico, starting at 5% and rising until illegal immigration ends", "Appeals court: Trump can make asylum seekers wait in Mexico", "Dozens of border patrol agents will soon be screening asylum cases"], "summ2": ["DHS Releases 185.5K Illegal Aliens, Border Crossers into U.S. in 5 Months", "Illegal immigrant Working as Nurse charged with killing at least 12 elderly women", "Democrats on Border Crisis: Help Migrants, Not American Wage-Earners", "‘We’ve Lost Control of the Border,’ Says Border Patrol Agent"]}
{"comp": "C_ER", "month": "Mar", "feats": "bow", "test": 0.7409, "summ1": ["Sharp rise in number of asylum seekers placed in hotels", "Trump threatens to shut Mexico border - ‘not kidding around’", "Canada grants asylum to Pinay who sheltered Snowden in Hong Kong", "Asylum seekers returned from Mexico for first U.S. court hearings"], "summ2": ["Michelle Malkin: Ruling Class Doesn't Want Legal Immigration Questioned", "DHS Releases 84.5K Border Crossers, Illegals into U.S. in Two Months", "UK Home Office says, \"Christianity is not a religion of peace\", rejects asylum bid of Iranian convert to Christianity · Caldron Pool", "Illegal Alien Charged with Raping Teen Sisters Deported Four Times from U.S."]}
{"comp": "ER_L", "month": "Mar", "feats": "sbert", "test": 0.7402, "summ1": ["NATIONAL EMERGENCY: 2,000+ Migrants Quarantined After Bringing Disease Across US Southern Border", "Exclusive—Bradley Byrne: Illegal Accused of Killing Sonya Jones Benefited from Catch and Release", "Pew Poll: GOP Voters Overwhelmingly Support Stopping Illegal Immigration", "The Truth About Zero-Tolerance and Family Separation, What Americans Need to Know"], "summ2": ["Detained kids were told they wouldn't be reunited with relatives if they misbehaved, senator says", "Bolivia latest country to offer asylum to Snowden", "Trump again punts on white supremacy after New Zealand attacks", "An immigration nightmare is unfolding in El Paso, one purposely created by the Trump administration"]}
{"comp": "ER_LC", "month": "Sep", "feats": "bow", "test": 0.7395, "summ1": ["1 Killed, 9 Injured in France Knife Rampage; Authorities Say Attack 'Does Not Appear to Be Terror Related'", "California Judge Puts National Block on Donald Trump’s Asylum Reform", "Recent Surges in Illegal Immigration Drive the Illegal Alien Population to a Record 14.3 Million, Finds Analysis by FAIR", "North Carolina Jails Frees Hundreds of Illegal Immigrant Criminals wanted by Feds"], "summ2": ["Trump's Asylum Policies Sent Him Back to Mexico. He Was Kidnapped Five Hours Later By a Cartel.", "Judge restores nationwide block on Trump's asylum ban", "Tamil asylum seeker family from Biloela 'terrified' for children after move to Christmas Island", "Former Pakistan legislator from Imran Khan’s party seeks asylum in India"]}
{"comp": "ER_LC", "month": "Feb", "feats": "sbert", "test": 0.7385, "summ1": ["Alexandria Ocasio-Cortez's Green New Deal: 'Economic Transformation'", "SOTU Address Slams Dems for 'Cruel' Tolerance of Illegal Immigration", "How Many More?????", "Illegal Immigrant Uber Driver Skips Town after Rape Accusation"], "summ2": ["Harassment, sexual assault among alleged misconduct by border agents investigated by CBSA", "Top 6 Catholic takeaways from President Trump’s State of the Union address", "Bahraini footballer pleads in court against deportation", "'They're lying to us': Refugee advocates accuse Coalition of people smuggler fear campaign"]}
{"comp": "L_RC", "month": "May", "feats": "sbert", "test": 0.7383, "summ1": ["Trump Administration’s Latest Asylum Policy Likely Unconstitutional, Certainly Inhumane", "Scott Daniel Warren Faces 20-Years In Prison For Giving Asylum-Seekers Water", "This might be Trump's worst cover-up", "Guatemalan Teen Becomes 5th Migrant Child To Die After Being Detained By Border Patrol"], "summ2": ["AP finds 13,000 asylum seekers on border wait lists", "’Not acceptable': Audits of federal government's performance cancelled due to insufficient funding, AG tells committee", "Editorial: Asylum crisis can’t be fixed by putting up more barriers", "Lutheran student pastor, husband deported to Colombia weeks after ICE raid at their Chicago home"]}
{"comp": "C_ER", "month": "Feb", "feats": "bow", "test": 0.7361, "summ1": ["Seeking safety at the border", "US Sending Central American Migrant Minors Back to Mexico", "Australia's lower house passes asylum bill in defeat for government", "Private company paid €1.6 million in 4 months to find emergency accommodation for asylum seekers"], "summ2": ["In Memoriam: 12 Americans Allegedly Killed by Illegal Aliens in 2018", "Somali Pirate Arrested After Trying to Claim Asylum", "Americans Want Stronger Immigration Enforcement, Not Less", "Walls Around The World That Work: Britain Is The Latest Country Bolstering Its Borders"]}
{"comp": "ER_RC", "month": "Mar", "feats": "sbert", "test": 0.7361, "summ1": ["DHS Releases 84.5K Border Crossers, Illegals into U.S. in Two Months", "Pew Poll: GOP Voters Overwhelmingly Support Stopping Illegal Immigration", "Illegal Alien Child Rapist Caught in Kansas Just Two Weeks After Deportation", "Yet Again, Germany Horrified By Migrant Murder of Young Woman"], "summ2": ["4 Reno slaying victims killed for drug money, police say", "Canada grants refugee status to some asylum-seekers who hid Edward Snowden in Hong Kong", "How waves of immigrants are overwhelming asylum process", "US struggling with growing number of asylum seekers"]}
{"comp": "ER_RC", "month": "Aug", "feats": "bow", "test": 0.7357, "summ1": ["Report: Nearly 90 Percent of Illegals Fail to Show Up for Court Hearings", "Germany: Asylum seeker rapes 9-year-old girl", "Fox News star SHUTS DOWN 2020 Dem when he says…", "Feds: Mississippi Food Plants ‘Willfully’ Hired Illegal Aliens Over Americans"], "summ2": ["Tamil family sent to Christmas Island as HometoBilo support rises", "Maldives police arrest ex-vice president who fled to India", "A Honduran church leader won asylum in the U.S. after waiting in Mexico for a judge to decide his case. He's still not free.", "China lashes out at Taiwan over Hong Kong asylum offer"]}
{"comp": "C_L", "month": "May", "feats": "sbert", "test": 0.735, "summ1": ["Border arrests near 100K in April, highest since 2007", "Mexico worries as US keeps making asylum seekers wait there", "HK govt in a bind after two localists granted asylum in Germany", "Trump says 'good chance' Democrats will back his immigration, border plan"], "summ2": ["Confirmed Judges, Confirmed Fears: Trump Judge’s Dissent Would Make Asylum More Difficult", "READ: ICE Deputy Director Says of DNA Testing: ‘This is a Pilot Designed to Assess the Usefulness of this Technology in an Investigative Process’", "How U.S. Guns Sold to Mexico End Up With Security Forces Accused of Crime and Human Rights Abuses", "Immigrant Activists Maru Mora-Villalpando & Ravi Ragbir Keep Speaking Out Despite Deportation Threat"]}
{"comp": "ER_RC", "month": "Jun", "feats": "sbert", "test": 0.7345, "summ1": ["D.C. Region Makes ‘Sanctuary Congregations’ to Shield Illegal Migrants", "Democrats on Trump's Border Policy: 'Crimes, Kidnapping, Nativist'", "Eleanor Clift: Trump’s ICE Roundups Inflicting ‘Terrorism’ on Immigrant Communities", "Breitbart Texas Witnesses Skeleton of Illegal Migrant, Death Toll Rises"], "summ2": ["Trump’s Mexican-tariff move was a true victory", "U.S. churches, some immigration officers denounce sending asylum seekers to Mexico", "Insiders: Peter Dutton grilled over medivac bill", "Constable: After her film about Venezuela, woman seeks asylum in Bartlett"]}
{"comp": "C_L", "month": "Feb", "feats": "sbert", "test": 0.733, "summ1": ["U.S. returns migrants to \"chaos, desperation\" in Tijuana", "Text - H.R.5456 - 109th Congress (2005-2006): Illegal Immigration Crisis Response Act of 2006", "Caravan migrants stalled at Texas border eye other routes", "UPDATE 1-Australia to reopen Christmas Island detention centre after defeat on refugee policy"], "summ2": ["A Historian on How Trump’s Wall Rhetoric Changes Lives in Mexico", "Here’s how the Saudi press has been smearing the teen who fled her family", "Trump Org was aware of undocumented workers’ legal status: Immigration lawyer", "Stop This Cruelty Toward Asylum Seekers"]}
{"comp": "ER_LC", "month": "Jul", "feats": "sbert", "test": 0.7329, "summ1": ["Expert Debunks Claim Citizenship Question Reduces Census Accuracy", "Report Shows Ilhan Omar Used False Name To Seek US Asylum", "Deported Sex Offender Caught Crossing California Border", "Illegal Aliens Panicking as ICE Director Vows This Major Plan – The Bearded Patriot"], "summ2": ["Several Portland councilors say mayor misinformed asylum seekers about housing options", "How Norway turns criminals into good neighbours", "Trump administration enacts another obstacle to asylum cases", "Death of Guatemalan toddler detained by ICE sparks $60 million legal claim"]}
{"comp": "L_RC", "month": "Jan", "feats": "bow", "test": 0.7326, "summ1": ["Sarah Huckabee Sanders Dismisses Ocasio-Cortez Climate Warning: We'll Leave It to 'Much, Much Higher Authority'", "Fox News' Napolitano warns if Trump builds his wall via emergency powers, 'he's not a president, he's a prince'", "Thousands More Migrant Children in Detention Than Initially Thought According to HHS Report", "Polls agree: Americans don't like shutdown and they blame Trump"], "summ2": ["Trump golf club reportedly fires illegal immigrant workers", "Thailand, UN to confer on Saudi teen who barricaded herself in airport to escape family", "Canada grants asylum to Saudi runaway teen fleeing allegedly abusive family: Police", "US Launches Plan for Asylum Seekers to Wait in Mexico"]}
{"comp": "ER_LC", "month": "Mar", "feats": "bow", "test": 0.7317, "summ1": ["Trump Requests ‘More’ Foreign Workers as Southern Border Gets Overrun", "Rand Paul Predicts 10 GOP Senators Will Vote to End Trump National Emergency", "Border Crisis Forces Massive Catch and Release Policy", "Illegal Alien Charged with Raping Teen Sisters Deported Four Times from U.S."], "summ2": ["Japanese-American activists will bring paper cranes to show solidarity with migrant families", "US asylum policy endangers migrants' lives, groups say", "Canada Grants Asylum To Woman Who Sheltered Edward Snowden In Hong Kong", "Trump gets a U.S. Supreme Court victory on immigration detention"]}
{"comp": "ER_L", "month": "Feb", "feats": "sbert", "test": 0.7303, "summ1": ["ICE: Woman Who Assaulted MAGA Hat Man Was in U.S. Illegally", "Harrison Ford Issues Apocalyptic Climate Change Warning: ‘Greatest Moral Crisis of Our Time’", "53 Large Group Migrant Border Crossings Already Occurred in 2019, Say Feds", "Democrats have a free ride for human-traffickers in their immigration proposal"], "summ2": ["Mark Meadows to Cohen: Lynne Patton Proves Trump’s No Racist", "Groups sue Trump admin over policy forcing vulnerable asylum seekers to return to Mexico", "Daily Mail removes illegal immigrant article after fact check goes viral", "Shorten stands up"]}
{"comp": "ER_LC", "month": "Mar", "feats": "sbert", "test": 0.7303, "summ1": ["Cory Booker Tells Meat Eaters Their Days Are Numbered", "Sudden Flood of Asylum Requests At U.S./Mexico Border", "Illegal Alien Repeatedly Raped 13-Year-Old Girl In Michigan", "Pew Poll: GOP Voters Overwhelmingly Support Stopping Illegal Immigration"], "summ2": ["Turning her Baha’i faith into precedent, lawyer helps women gain asylum", "Bercow defends MPs after PM blames them for Brexit delay", "U.S. struggling with growing number of asylum seekers", "Trump threatens potential 'border closing' next week"]}
{"comp": "ER_RC", "month": "Feb", "feats": "bow", "test": 0.7302, "summ1": ["In Memoriam: 12 Americans Allegedly Killed by Illegal Aliens in 2018", "Daily Reminder: 65 Countries Have Border Walls and So Does Nancy Pelosi's Backyard", "UK: Mother Arrested for Calling Trans Activist a Man on Twitter", "Democrats’ DHS Spending Plan Stigmatizes, Chokes ICE Enforcement"], "summ2": ["Trump administration sued over shift in asylum policy", "Randy Quaid still seeking refugee status in Canada", "Medivac bill, asylum seekers: The Economist slams Liberal Party response", "Portland's best new food carts of 2018"]}
{"comp": "ER_RC", "month": "Jan", "feats": "sbert", "test": 0.728, "summ1": ["Illegal Alien Accused of Aiding Alleged Cop Killer was Deported Twice", "Seth Meyers Under Fire for Mocking Victims Killed By Illegal Aliens", "Poll: Trump's Support Among Hispanics Soars in Fight for Border Wall", "Secure Borders Protect Immigrant Communities"], "summ2": ["Shutdown, border wall dominate Sen. Mitt Romney's first town hall", "Saudi refugee in Thailand headed to Canada", "Australia will consider resettlement for Saudi teen who pleaded asylum from abusive family", "Trump administration to force some asylum seekers to wait in Mexico beginning Friday"]}
{"comp": "ER_L", "month": "Aug", "feats": "bow", "test": 0.7275, "summ1": ["Court Reverses Gun Conviction of Illegal Immigrant Who Killed Kate Steinle", "One Quarter of Germans Now Come From Migrant Backgrounds", "Feds: Mississippi Food Plants 'Willfully' Hired Illegal Aliens Over Americans", "Illegal Alien Overstayed Visa, Charged with Allegedly Raping Child"], "summ2": ["What is the Flores settlement?", "Shadow minister: Home Office is 'persecuting' LGBT asylum seekers", "'Outrageous': Lindsey Graham Breaks Senate Rules to Advance Sweeping Anti-Asylum Bill", "White Nationalist Terrorism Is a Problem. Trump Is a Bigger One."]}
{"comp": "R_RC", "month": "Sep", "feats": "sbert", "test": 0.7274, "summ1": ["Edward Snowden discovers his self-made purgatory", "Politico: Trump Administration's Border Moves Are Working", "Loco in MOCO: The newest illegal alien arrested for rape in Montgomery County had criminal history, could have been deported", "Immigration Chief: Change Allows Focus on ‘Legitimate Asylum Claims’"], "summ2": ["Iranian judo star seeking asylum after being ordered to lose fight to avoid Israeli competitor", "How Pakistan suffocates women: Gulalai Ismail, women rights activist, goes missing. The worst is possible", "Tamil asylum seekers: Melbourne rally, Di Natale slams Dutton over deportation attempt", "Trump administration begins enforcing new stricter asylum rule on southern border"]}
{"comp": "L_RC", "month": "Apr", "feats": "sbert", "test": 0.726, "summ1": ["WATCH: Ann Coulter Says There Are 'More Illegal Aliens Pouring In Than They Would Be Under President Hillary Clinton' WATCH: Ann Coulter Says There Are 'More Illegal Aliens Pouring In Than They Would", "AG Barr rules asylum seekers can be detained indefinitely: ‘Heartless punishment against vulnerable people’", "Trump Promised Pardon to Head of Customs and Border Protection if He Broke the Law by Blocking Asylum Seekers", "Trump’s War on Democracy: An Update"], "summ2": ["Buchanan: Already deep in the politics of hate", "The Latest: Minnesota House backs immigrant driver licenses", "Wikileaks Co-founder Julian Assange Arrested After Spending 7 Years In Ecuador's Embassy In London", "Trump is looking to give sanctuary cities just what they asked for"]}
{"comp": "C_ER", "month": "Jul", "feats": "bow", "test": 0.7253, "summ1": ["Judge Weighs New US Policy Keeping Asylum Seekers Locked Up", "Judge blocks Trump's latest sweeping asylum rule", "By the numbers: Migration to the US-Mexico border", "Asylum-Seekers Live Better In Tucson Than In U.S. Custody: Doctor"], "summ2": ["Democrat Congresswoman In Deep After Getting Caught Secretly Sending Staff Into Mexico To Coach Alleged “Illegals” Ie “asylum-seekers” ⋆ Joe For America", "Illegal Alien in Sanctuary City Charged with Sexually Assaulting 6-Year-Old", "BREAKING: Tommy Robinson Re-Convicted for Reporting on Grooming Gang -- Faces Up To Two Years in Prison", "Ilhan Omar Accuses Border Patrol Agents of 'Terrorizing' Illegal Aliens"]}
{"comp": "C_RC", "month": "Sep", "feats": "sbert", "test": 0.7252, "summ1": ["US-El Salvador “cooperative agreement” would send asylum-seekers into harm’s way", "Judge restores nationwide block on Trump administration's asylum ban", "U.N. reps give migrants information on applying for asylum in Mexico", "Tent courts set to open on border for U.S. asylum seekers"], "summ2": ["Boris Johnson: We must never forget diplomats who rescued Jews from Nazis", "Judge Blocks Trump Administration’s Plans for Detaining Migrant Families", "‘Not Only Minorities But Even Muslims Not Safe in Pak’: Ex-MLA of Imran Khan’s Party Wants Political Asylum in India", "Illegal Immigrant From Mexico Gets 6 Years for Trafficking Enough Fentanyl to Kill 500,000 People"]}
{"comp": "ER_LC", "month": "Jan", "feats": "bow", "test": 0.7248, "summ1": ["DACA Illegal Aliens Surged Hispanic Vote, Flipping GOP Counties Blue", "Previously Deported Illegal Immigrant Arrested For Sexual Assault Of 11-Year-Old", "NEW MAP: Cost of Illegal Immigration, By State", "Nancy Pelosi’s Heart Sinks When Her Office Congressional Office Is Raided By Throng Of Victims of Illegal Immigration"], "summ2": ["Saudi teen who fled family leaves Thailand for asylum in Canada", "Thai officials promise not to deport Saudi woman seeking asylum in Australia", "The 'doomsday' scenario: Here's what happens if the shutdown drags on", "U.S. launches plan for asylum seekers to wait in Mexico"]}
{"comp": "ER_LC", "month": "Jun", "feats": "sbert", "test": 0.7245, "summ1": ["George Will: America Needs 'As Much Immigration as Economy Can Take'", "Mexican President Confirms Alert over 3 ISIS Terror Suspects Headed to Border", "D.C. Region Makes ‘Sanctuary Congregations’ to Shield Illegal Migrants", "Illegal Alien Rapist Released In Sanctuary, Attacks Wheelchair-Bound Victim Again"], "summ2": ["Johana Medina Leon, A Trans Asylum Seeker, Dies After ICE Detention — Here's What We Know", "U.S. churches, some immigration officers denounce sending asylum seekers to Mexico", "'I think I’d take it': In exclusive interview, Trump says he would listen if foreigners offered dirt on opponents", "Calais migrants: Work begins on UK-funded border wall"]}
{"comp": "L_R", "month": "Aug", "feats": "sbert", "test": 0.7239, "summ1": ["Lindsey Graham, my asylum clients are not “gaming the system.”", "Infant asylum seeker has no nappies or food, charity warns after touring housing", "Megachurch Pastor Says Trump Has God's Approval to Start Nuclear War", "Trump Keeps Cracking Down on Legal Immigration Because His Base Loves Cruelty"], "summ2": ["ICE let loose 218,400 migrant 'family members' into the US since December", "Former ICE Director: Crimes Committed By Illegal Aliens Are ‘Preventable Crimes’", "Sudanese asylum seeker jailed for life for stabbing 21-year-old woman", "Majority of Blacks and Hispanics Support Presidential Candidates Who Are Against Illegal Immigration: Poll"]}
{"comp": "ER_L", "month": "Apr", "feats": "sbert", "test": 0.7224, "summ1": ["Serious Crimes Committed by Illegal Aliens", "Poll: Almost 80 Percent of Democrats Oppose Tougher Asylum Rules", "Asylum-Seeking Central American Discovered to Be MS-13 Gang Member", "Trump Administration To Expand Program That Will Boot Illegal Alien ‘Asylum Seekers’ Back To Mexico"], "summ2": ["'History Will Judge Her': DHS Secretary Kirstjen Nielsen Resigns After Months of Imposing Trump's Immigration Policies", "'Heartless Punishment Against Vulnerable People': AG William Barr Rules Asylum Seekers Can Be Detained Indefinitely", "Trump mocks asylum seekers, Democrats during inflammatory speech", "CNN's Jake Tapper Reports on WH Immigration Tensions: Trump Was 'Ordering Officials to Break the Law'"]}
{"comp": "C_ER", "month": "Feb", "feats": "sbert", "test": 0.7222, "summ1": ["NM governor withdraws most National Guard troops from border", "159 Eritrean asylum-seekers get access to safety after months in detention in Libya", "US sees limitations on reuniting migrant families", "Malaysian held over Mongolian model's grisly murder loses Australian asylum bid"], "summ2": ["Joni Ernst: Sarah Root's Family 'Yet to See' Illegal Alien Brought to Justice", "What Is E-Verify?", "Donald Trump: Democrats Trying to Stop ICE from Deporting Illegals", "Beto O'Rourke Immigration Plan: No Walls; Amnesty for All"]}
{"comp": "C_ER", "month": "Aug", "feats": "bow", "test": 0.7214, "summ1": ["Trump administration pushes to speed up migrant family cases", "22 AGs Urge Trump Admin. To Withdraw Rule Limiting Asylum", "UNHCR official criticises 'the radicalisation of migratory dreams'", "US, Mexico Widen Asylum Crackdown to Push Back All Migrants"], "summ2": ["Report: 1-in-14 Nevada Inmates Are Illegal Aliens, Including 150 Murderers", "Feds: Illegals Arrested in ICE Raid Stole Identities of American Citizens", "Germany: Asylum seeker rapes 9-year-old girl", "Poll: Majority of Blacks, Hispanics Support Anti-Illegal Immigration 2020 Candidates"]}
{"comp": "L_RC", "month": "Aug", "feats": "sbert", "test": 0.7198, "summ1": ["Congressman Claims Charging El Paso Domestic Terrorist With a Hate Crime Will Lead to Putting Preachers in Prison", "Trump Administration Planning to Deport Victim of Domestic Violence to Country Where She Fears for Her Life", "Trump Keeps Cracking Down on Legal Immigration Because His Base Loves Cruelty", "My 1-Year-Old Nephew Has Some Thoughts on Donald Trump"], "summ2": ["Record opposition among Canadians to taking in more immigrants, but too soon to call it a trend, pollster says", "U.S. asylum laws foster child trafficking at southern border, Utah Sen. Mike Lee says", "A Honduran church leader won asylum in the U.S. after waiting in Mexico for a judge to decide his case. He's still not free.", "Dog walker knifed to death during random attack in Washington, DC"]}
{"comp": "C_L", "month": "Apr", "feats": "sbert", "test": 0.7190000000000001, "summ1": ["Frustration grows among migrants in Mexico as support fades", "Uganda Willing to Give Bashir Asylum - Government", "US Judge blocks Trump's Mexican asylum seekers move", "Sending immigrants to sanctuary cities has consequences — and that's a good thing"], "summ2": ["AG Barr rules asylum seekers can be detained indefinitely: ‘Heartless punishment against vulnerable people’", "Trump Promised Pardon to Head of Customs and Border Protection if He Broke the Law by Blocking Asylum Seekers", "Trump’s War on Democracy: An Update", "Decriminalizing illegal immigration and 3 other 'radical' ideas in Julián Castro's new immigration plan"]}
{"comp": "C_ER", "month": "Apr", "feats": "sbert", "test": 0.7190000000000001, "summ1": ["Uganda says it is willing to consider asylum for Sudan's ousted leader Bashir", "US judge blocks Trump's 'Remain in Mexico' asylum policy", "As US releases thousands of asylum seekers at the border, volunteers struggle to keep pace", "Mexican president wants to 'bring order' to Central American migration to U.S."], "summ2": ["Trump Offers To Release Detained Illegal Aliens Into Sanctuary Cities, But Democrats Lose Their Minds", "Illegal Immigrant Is Arrested And Faces Deportation Because He Killed 4-Month-Old Boy After Learning He Wasn’t The Dad", "DHS Secretary Kirstjen Nielsen Will Return More Migrants to Mexico", "Annihilation of Christian Life and People: Where is the Outrage in the West?"]}
{"comp": "ER_L", "month": "Jul", "feats": "sbert", "test": 0.7183, "summ1": ["The Political Insider", "Failed Asylum Seeker and Convicted Robber Jailed for Kidnap and Attempted Rape in Canterbury", "BORDER CRISIS EXPLODES: 144,278 Illegals Apprehended In May, Up 32%", "Ilhan Omar Calls Illegal Aliens \"Undocumented Americans\" in Statement Opposing ICE Deportation Raids"], "summ2": ["20 Ways You Can Help Immigrants Now", "WATCH: Amid Extreme Anti-Refugee Push, Trump Displays Neither Interest Nor Knowledge of Asylum Seekers' Plight in Oval Office Meeting", "The Trump administration’s incompetence just blocked a major victory by the religious right", "Mike Pence Visits the McAllen Border Patrol Station"]}
{"comp": "C_ER", "month": "Jan", "feats": "bow", "test": 0.7157, "summ1": ["U.N. refugee agency interviews Saudi teen asylum seeker in Thailand", "Young Saudi asylum-seeker arrives in Canada to official welcome", "The emergency at the border isn’t national. It’s regional", "Official: Asylum seekers to wait in Mexico starting Friday"], "summ2": ["Previously Deported Illegal Immigrant Arrested For Sexual Assault Of 11-Year-Old", "Afghan Migrant Brutally Raped, Poured Gasoline Over, Burnt To Death Young European Girlfriend Because She Wanted To Break Up", "Nancy Pelosi’s Heart Sinks When Her Office Congressional Office Is Raided By Throng Of Victims of Illegal Immigration", "Watch: Pro-Mass Immigration Koch Brothers New Campaign for Amnesty: DACA Illegal Aliens ‘Are Patriots’"]}
{"comp": "ER_LC", "month": "Feb", "feats": "bow", "test": 0.7153, "summ1": ["Mexican Government Busing 1700 Caravan Migrants to Unsecured Texas Border Area", "Americans Want Stronger Immigration Enforcement, Not Less", "In Memoriam: 12 Americans Allegedly Killed by Illegal Aliens in 2018", "Walls Around The World That Work: Britain Is The Latest Country Bolstering Its Borders"], "summ2": ["Trump gets sued over his asylum policy. Again. Next up: his fake national emergency", "‘After nine years in direct provision I have never stopped living’", "Finding all migrant children separated from their families may be impossible, feds say", "Australia announces reopening of offshore detention center"]}
{"comp": "C_L", "month": "Mar", "feats": "bow", "test": 0.7141, "summ1": ["Trump gets a U.S. Supreme Court victory on immigration detention", "Number of asylum seekers sent back over border to grow", "'Remain in Mexico' policy prompting more illegal border crossings", "Canada grants asylum to family who sheltered Edward Snowden"], "summ2": ["Trump Threatens to Close Border Next Week 'If Mexico Doesn't Immediately Stop All Illegal Immigration'", "Five takeaways from Wednesday's hearings on immigration and family separation", "An immigration nightmare is unfolding in El Paso, one purposely created by the Trump administration", "Trump Mocks Asylum-Seekers Fleeing Violence at Michigan Rally"]}
{"comp": "ER_L", "month": "Mar", "feats": "bow", "test": 0.7136, "summ1": ["55 Migrants Transported to U.S. Hospitals Each Day, Say Feds", "ICE arrests 20 illegal alien criminals released due to NY city sanctuary policies", "DACA Illegal Alien Accused of Sexually Assaulting 68-Year-Old Woman", "Democrats Vote in Favor of Illegal Immigrant Voting"], "summ2": ["At Michigan Rally, Trump Mocks Asylum Seekers Fleeing Violence", "Five takeaways from Wednesday's hearings on immigration and family separation", "Local Immigrant Rights Advocate Stops ICE Agents", "Trump Threatens to Close Southern Border if Mexico Doesn't End Illegal Immigration By Next Week"]}
{"comp": "C_ER", "month": "Jun", "feats": "bow", "test": 0.7134, "summ1": ["Rights group says Mexico puts activists on trial to win over Trump", "Homeland Security official describes widespread 'fraudulent' families at border", "Trump says US will begin deporting millions", "Central American migrants plead to seek asylum in U.S., not Mexico"], "summ2": ["Nancy Pelosi Opposes Mexico’s Promise to Keep Migrants", "Insanity! Bernie admits, “I won’t deport illegal immigrants”", "DHS Official: ICE Arrested More Than 127,000 Criminal Aliens During FY 2017", "20 Times Breitbart Reported on Migrant Deaths During Obama-Biden Years and No One Cared"]}
{"comp": "C_L", "month": "Aug", "feats": "sbert", "test": 0.7132, "summ1": ["US, Mexico widen asylum crackdown to push back migrants", "Migrant kids separated at border faced abuse in foster homes", "Pausing Asylum Interviews Would Harm 40K, Mass. Dems Say", "Trump administration asks Supreme Court to lift order blocking asylum rule"], "summ2": ["Trump Administration Launches Attack on Flores Agreement to Indefinitely Detain Migrant Children", "Trump Keeps Cracking Down on Legal Immigration Because His Base Loves Cruelty", "DEEPER THAN A DIAGNOSIS: Psychoanalyst on what makes Donald Trump tick", "‘We Call That Love’: Marc Lambert Lamba Defended Cameroon’s LGBT Community"]}
{"comp": "L_LC", "month": "Aug", "feats": "sbert", "test": 0.7125, "summ1": ["Congressman Claims Charging El Paso Domestic Terrorist With a Hate Crime Will Lead to Putting Preachers in Prison", "Trump Administration Planning to Deport Victim of Domestic Violence to Country Where She Fears for Her Life", "Trump Keeps Cracking Down on Legal Immigration Because His Base Loves Cruelty", "My 1-Year-Old Nephew Has Some Thoughts on Donald Trump"], "summ2": ["Another federal judge rules against Trump asylum policy", "Families seeking a fresh start in Lewiston while waiting for asylum", "Hastings woman told jailed stalker was illegal immigrant", "Colombia/Venezuela: Attacks on Civilians in Border Area"]}
{"comp": "L_RC", "month": "Feb", "feats": "sbert", "test": 0.7117, "summ1": ["Stop this cruelty toward asylum seekers", "Tommy Robinson ignores former EDL member's child sex abuse", "A Historian on How Trump’s Wall Rhetoric Changes Lives in Mexico", "Here’s how the Saudi press has been smearing the teen who fled her family"], "summ2": ["Obama Tripled Migrant Processing at Legal Ports—Trump Halved It", "Christmas Island gets ready for refugee boat influx as detention centre re-opens", "Devout Mormon Camden Nicholson ‘kills parents, cleaner’ in Newport Beach", "Nauru Manus: Scott Morrison declares Bill Shorten will be to blame for boat arrivals"]}
{"comp": "LC_R", "month": "Feb", "feats": "sbert", "test": 0.7111, "summ1": ["Lawsuit challenges US gov't over sending asylum seekers to Mexico", "House passes gun background check bill after GOP undocumented amendment", "Nauru asylum seekers sew lips shut in protest over Cambodia transfer", "Australia's forgotten detention centre: the peculiar torture of Christmas Island's asylum seekers locked up with hardened criminals"], "summ2": ["Report: Mexican Authorities Relocate Caravan Riders Staying Near The U.S. Border", "CBS's O'Donnell Bolsters Schumer on Illegal Immigration", "Drug dealer, 30, jailed after police find kilo of pure cocaine in his Primark bag", "College leaders OPPOSE adding U.S. history, civics req to graduate"]}
{"comp": "ER_RC", "month": "Mar", "feats": "bow", "test": 0.7111, "summ1": ["Lamar Alexander: Trump's National Emergency Is 'Dangerous Precedent'", "DHS Releases 24K Border Crossers, Illegal Aliens into U.S. in Two Weeks", "Democrats Vote in Favor of Illegal Immigrant Voting", "Illegal Alien Charged with Raping Teen Sisters Deported Four Times from U.S."], "summ2": ["Trump threatens to close border with Mexico next week", "Yeah, this looks like a border crisis", "U.S. objections probably behind delay in granting asylum to Snowden-helping refugees, lawyer charges", "Asylum seekers waiting in Mexico seek to stay in US"]}
{"comp": "L_R", "month": "Mar", "feats": "sbert", "test": 0.7109, "summ1": ["Laura Ingraham’s advice for asylum seekers reveals her ignorance of asylum law", "Report: Trump Administration Has Deported 471 Parents Without Their Children", "GOP Rep: 'A D-Day Every Month On The Southern Border'", "Donald Trump Openly Mocks Asylum Seekers Fleeing Violence"], "summ2": ["Bishop of Durham blasts Home Office over asylum row", "Illegal Border Crossings on Pace to Hit Almost 1 Million This Year", "Nancy Pelosi Kids You Not: Lower Voting Age to 16, She Says!", "Illegal immigrant stabs California woman to death after 'sanctuary' laws protected suspect from ICE 9 times"]}
{"comp": "R_RC", "month": "Aug", "feats": "sbert", "test": 0.7101, "summ1": ["Fourth Illegal Immigrant Rapist Arrested In Maryland County In Less Than A Month", "Former ICE Director: Crimes Committed By Illegal Aliens Are ‘Preventable Crimes’", "Trump: Seriously Looking at Ending Birthright Citizenship", "Senator Graham Passes Legislation to Solve the Border Crisis Before August Recess, Democrats Object"], "summ2": ["All migrants now kept out as US, Mexico widen asylum crackdown", "El Paso Homicides Spiked After Border Fence Was Completed; The Fence Didn’t Cause It", "Sydney news: Security guard jailed for assaulting three-year-old girl in shopping centre to be deported", "China lashes out at Taiwan over Hong Kong asylum offer"]}
{"comp": "L_LC", "month": "Mar", "feats": "sbert", "test": 0.7097, "summ1": ["Trump adds a deadline on his threat to close the border", "Families Belong Together: This Is What Asylum Seekers Face at the U.S. Border", "Kirstjen Nielsen Says ‘We Don’t Use Cages for Children’—After U.S. Put Migrant Kids in Cages", "Donald Trump Openly Mocks Asylum Seekers Fleeing Violence"], "summ2": ["Illegal immigrant 'go home' posters defended by Tory minister", "A federal judge will soon decide the fate of the Trump administration's contested \"Remain in Mexico\" policy", "U.S. struggling with growing number of asylum seekers", "Sudan's Bashir orders release of detained women protesters"]}
{"comp": "L_LC", "month": "Jul", "feats": "sbert", "test": 0.7087, "summ1": ["Trump Will Soon Obliterate the Right to Asylum", "'It didn’t have to be like this': Mom describes toddler's agonizing death after ICE custody", "Trump Got $500K From Private Prisons Holding Migrant Children And Asylum Seekers: Report", "National Cathedral leaders condemn Trump’s racism, question Americans’ silence."], "summ2": ["Trump: Black leaders boycotting him go against 'own people'", "Hundreds Of Child Trafficking Victims Have Been Refused The Right To Stay In The UK", "US to send asylum seekers back to dangerous part of Mexico", "German court hands life sentence to Iraqi over teenager's rape-murder"]}
{"comp": "ER_LC", "month": "Apr", "feats": "bow", "test": 0.7083, "summ1": ["Rush Limbaugh told a truth that is bad news for the Democrat Party", "Trump’s DHS Releases More than 17K Illegal Aliens into U.S. in 12 Days", "Massachusetts Judge Charged With Helping Illegal Immigrant Evade ICE", "Illegal Immigration’s Poster Child: 5-time deported illegal alien arrested for kicking 4-month-old baby to death"], "summ2": ["Julian Assange arrested by UK police after nearly seven years in embassy", "Trudeau defends changes to asylum laws that have refugee workers alarmed", "Trump visits the border and warns: 'Our country is full...turn around'", "Judge blocks Trump policy forcing asylum-seekers to wait in Mexico"]}
{"comp": "ER_RC", "month": "May", "feats": "bow", "test": 0.7079, "summ1": ["DHS Releases 185.5K Illegal Aliens, Border Crossers into U.S. in 5 Months", "Plurality of Minority Voters Say 'Too Easy' for Foreigners to Get Asylum", "Illegal immigrant Working as Nurse charged with killing at least 12 elderly women", "Caravan Update: Africans, Bangladeshis, Syrians, Afghans in Mexico Awaiting U.S. Asylum"], "summ2": ["Keeping Fake Illegal Alien Families Together", "As border detention fills up, asylum seekers are being dropped off in the Inland Empire", "Assange works on from 'ambassadorial premises'", "Refugee system not equipped to deal with surge in asylum seekers at Canada-U.S. border, Auditor-General says"]}
{"comp": "C_ER", "month": "Aug", "feats": "sbert", "test": 0.7071, "summ1": ["US, Mexico widen asylum crackdown to push back migrants", "Migrant kids separated at border faced abuse in foster homes", "Pausing Asylum Interviews Would Harm 40K, Mass. Dems Say", "Trump administration asks Supreme Court to lift order blocking asylum rule"], "summ2": ["Illegal Immigrant Bought Baby for $80 in Guatemala to Get Priority Release in US", "ICE Chief Says Illegal Immigrant Parents Are ‘Responsible’ For Child Separation", "Sudanese Migrant Jailed for Murdering Woman Who Refused Sex", "Trump Cracked Down On Illegals — Now A Mass Exodus Is Beginning – The Bearded Patriot"]}
{"comp": "C_RC", "month": "May", "feats": "bow", "test": 0.7069, "summ1": ["U.S. will assign dozens of border agents to migrant asylum interviews", "Trump can make asylum seekers wait in Mexico, court says", "Mexico's refugee agency turns to U.N. amid asylum surge, funding cuts", "James Comey is in trouble and he knows it"], "summ2": ["Trump slaps tariffs on all imports from Mexico, sending stock futures tumbling", "Canada's 'rigid' asylum system unable to respond to spikes in refugee claims, auditor general finds", "BernCo has $100K plan to aid asylum-seekers", "As border detention fills up, asylum seekers are being dropped off in Inland Empire"]}
{"comp": "R_RC", "month": "May", "feats": "sbert", "test": 0.7067, "summ1": ["Teenage Girl Kidnapping Suspect In Seattle Suburb Is A Twice-Deported Illegal Alien", "Hillary Clinton Champions Illegal Immigration; Is it Growth, Competition, Pandering, or Outright Vengeance?", "Immigrant Advocates Push Fake Humanitarianism at the Border", "Trump insists he knows NOTHING about plan to round up and deport illegal immigrant families"], "summ2": ["Bollywood actor who campaigned for Stephen Harper was granted Canadian citizenship by Conservative government", "NM transports 55 asylum-seekers to Denver", "China calls on Germany to correct 'mistakes' over asylum for Hong Kong independence activists", "Editorial: Asylum crisis can’t be fixed by putting up more barriers"]}
{"comp": "L_RC", "month": "Sep", "feats": "bow", "test": 0.7062, "summ1": ["Judge blocks ICE from denying parole to asylum-seekers", "'Remain in Mexico' policy has left asylum-seekers stranded and immigration courts 'broken'", "Trump Administration Is Not Funding Legal Aid In 3 Migrant Children’s Shelters", "Supreme Court Allows Trump’s Asylum Ban to Take Effect"], "summ2": ["Judge reinstates nationwide halt on Trump asylum policy plan", "Baldev Kumar, ex-MLA from Imran Khan's party, seeks political asylum in India; accuses Pakistan of persecuting minorities", "Tamil family: Dutton lashes out at Tamil parents", "When will big city Democrats stop enabling illegal immigration?"]}
{"comp": "C_R", "month": "Mar", "feats": "bow", "test": 0.7044, "summ1": ["Mexico frets over U.S. plans to take divisive asylum policy to new cities", "No body double: Trump blasts #FakeMelania theories", "'A troubling situation': Health and vulnerability check concerns for asylum seekers raised", "'Unprecedented' number of migrants crossing the southern border, CBP Commissioner says"], "summ2": ["Iranian Convert Refused Asylum By UK Because Christianity Is Too Violent", "DHS secretary defends 'metering' asylum seekers at border: 'We're not turning anybody around'", "State Deputy Gunned Down by Illegal Immigrant, Leaves Behind Wife and Three Children", "SCOTUS gives Pres. Trump victory on immigration, upholds push to detain illegals"]}
{"comp": "ER_RC", "month": "Sep", "feats": "bow", "test": 0.7043, "summ1": ["North Carolina Jails Free Hundreds of Illegal Immigrant Criminals Wanted by Feds", "Study: 14.3M Illegal Aliens Living in U.S., Costing Americans $132B a Year", "HUGE VICTORY: Supreme Court backs President Trump on asylum ban at Southern border", "Knife Wielding Asylum Seeker Kills 1, Injures 9"], "summ2": ["When will big city Democrats stop enabling illegal immigration?", "US judge blocks Trump move on asylum-seekers", "Former legislator of Imran Khan's party who sought political asylum in India receives death threats", "Tamil family: Dutton lashes out at Tamil parents"]}
{"comp": "R_RC", "month": "Jan", "feats": "sbert", "test": 0.7041, "summ1": ["Found at the Border: Prayer Rugs, Illegal-alien Skeletons", "Mother Of Son Killed By Illegal Immigrant Tells Democrats To ‘Love Americans More Than You Hate The President’", "Press pounces as Trump sends first asylum-seeker back across the border under new ‘stay in Mexico’ rules", "Judicial Activism Is Alive And Well, Again"], "summ2": ["Saudi refugee in Thailand headed to Canada", "Saudi teen granted asylum in Canada arrives in Toronto", "US launches plan for asylum seekers to wait in Mexico", "Human Rights Watch has concerns about Australia cybersecurity, surveillance"]}
{"comp": "ER_L", "month": "May", "feats": "bow", "test": 0.7039, "summ1": ["424 Migrants Apprehended at Border – ‘Largest Group,’ Says CBP", "Alleged serial killer charged in deaths of 11 elderly women", "Kobach: U.S. Message to Illegals Is 'Come to America, We'll Release You'", "Democrats on Border Crisis: Help Migrants, Not American Wage-Earners"], "summ2": ["Peter Thiel’s Palantir Was Used To Bust Relatives of Migrant Children, New Documents Show", "Trump Administration Can Keep Forcing Asylum-Seekers To Wait In Mexico: Court", "Kushner's immigration plan has skeptics lining up on both sides", "\"Trump Fatigue\""]}
{"comp": "ER_L", "month": "Jun", "feats": "bow", "test": 0.7038, "summ1": ["POLL: 30 Percent of Americans Want to Halt ALL Immigration", "BREAKING: Trump Says He Will Delay Deportations of Illegal Aliens For Two Weeks at the Request of Democrats", "California Lawmakers Plan to Give Health Benefits to Illegal Immigrants", "Mexico City Deploys 6,000 National Guard Troops To Its Southern Border With Guatemala!!"], "summ2": ["Trump took to Twitter to announce that he's postponing ICE's deportation raids in 10 major cities", "A trans woman died in ICE custody on the first day of Pride Month, advocates report", "How Trump’s Tariff Threat Could Outsource the Asylum Crisis to Mexico", "'This Is Sick': Horror as Trump Administration Plans to Detain Migrant Children at Former Japanese Internment Camp"]}
{"comp": "L_LC", "month": "Sep", "feats": "sbert", "test": 0.7036, "summ1": ["'Unconscionable': Asylum-Seekers In Texas Detention Center Report Being Denied Cancer and Mental Health Treatment", "It’s official: Trump’s wall is a flop and even Fox News now calls his big campaign promise a mistake", "U.S. Agreement with Honduras Severely Restricts Asylum Seekers’ Rights", "After SCOTUS Ruling, Asylum Seekers Ask Court for Protection"], "summ2": ["Brother of killed asylum seeker: ‘Tell the judge he told the truth’", "World Report 2019: Pakistan", "Bath officials unaware of number of asylum seekers in city", "Trump administration ready to deport, turn back more asylum seekers after Supreme Court ruling"]}
{"comp": "L_R", "month": "Jun", "feats": "sbert", "test": 0.7025, "summ1": ["ICE Kept Migrant Kids In Vans For 39 Hours During Botched Family Reunifications", "A trans woman died in ICE custody on the first day of Pride Month, advocates report", "Yes, Liz Cheney, AOC Is Right That US Is Running Concentration Camps for Refugees", "Hey Donald Trump, this isn’t funny"], "summ2": ["Emergency Border Spending Bill, H.R. Passes House, 230-195, Fails Senate", "Vietnamese illegal immigrant caught growing cannabis for a THIRD time", "The Border Crisis Is Getting Worse. Why Are Democrats AWOL?", "MSNBC Guest: Trump Is ‘Enacting Terror On Families’ By Enforcing Immigration Laws"]}
{"comp": "ER_L", "month": "Jan", "feats": "bow", "test": 0.7011, "summ1": ["376 Central American Migrants Burrow Under Border Fence and Request Asylum from Border Patrol", "Police: Two Illegals Helped Illegal Alien Evade Arrest for Officer's Murder", "Exclusive: Ronna McDaniel Slams Pelosi for Hobnobbing at Grammys", "Former Democrat: The Truth is Democrats Won't Build Wall Because They're Under Influence of Mexican Mafia"], "summ2": ["Ocasio-Cortez: Migrant families seeking hope 'are acting more in the American tradition' than Trump", "First asylum seeker returned to Mexico under new—and deeply flawed—Trump policy", "Even Fox News Has Had Enough of Trump's Anti-Immigrant BS", "Barr backs Trump on the border wall and government shutdown"]}
{"comp": "L_R", "month": "Feb", "feats": "sbert", "test": 0.7004, "summ1": ["Tommy Robinson ignores former EDL member's child sex abuse", "A Historian on How Trump’s Wall Rhetoric Changes Lives in Mexico", "Here’s how the Saudi press has been smearing the teen who fled her family – ThinkProgress", "Stop This Cruelty Toward Asylum Seekers"], "summ2": ["Tear down that border wall: Is Beto's battlecry the new Dem litmus test for 2020?", "Thousands of sheriffs warn Congress about dangers associated with key component of possible immigration deal", "Illegal Alien Confesses to Murder of New York Woman: 'We Are Devastated'", "58,000 illegal immigrants in Australia have arrived by plane"]}
{"comp": "ER_RC", "month": "Aug", "feats": "sbert", "test": 0.7, "summ1": ["Germany To Strip Asylum Status of ‘Refugees’ Who Go Home on Holiday", "Illegal Immigrant Accused of Killing Teenager", "TIME Mag: Koch Brothers Helping Illegal Immigrants Get Driver’s Licenses", "Trump Cracked Down On Illegals — Now A Mass Exodus Is Beginning – The Bearded Patriot"], "summ2": ["All migrants now kept out as US, Mexico widen asylum crackdown", "Govt denies political asylum to Maldives former VP who entered India illegally, deported", "Shopping centre guard sentenced over 'haunting' stairwell assault of three year old", "On Immigration, Hillary Clinton and John Kerry Discover Their Inner Trump"]}
{"comp": "ER_LC", "month": "Jun", "feats": "bow", "test": 0.6994, "summ1": ["Nancy Pelosi Opposes Mexico’s Promise to Keep Migrants", "Insanity! Bernie admits, “I won’t deport illegal immigrants”", "DHS Official: ICE Arrested More Than 127,000 Criminal Aliens During FY 2017", "20 Times Breitbart Reported on Migrant Deaths During Obama-Biden Years and No One Cared"], "summ2": ["Trump delays ICE raids and gives lawmakers two weeks to 'work out solution' on asylum laws", "Trump’s “Remain in Mexico” Policy Has Turned Back More Than 10,000 Asylum Seekers", "Are US child migrant detainees entitled to soap and beds?", "Poor nations hosting most refugees worldwide, need more Western help - UN"]}
{"comp": "ER_RC", "month": "Jul", "feats": "sbert", "test": 0.6991, "summ1": ["Dems Won't Curb Illegal Immigration, But They Plan to Pass a Resolution Condemning Trump", "Five Charged in Texas Human Trafficking, Sex Slavery Scheme", "Fraud by African Refugees Halted Inflow After Ilhan Omar Came to U.S.", "Illegal Aliens Panicking as ICE Director Vows This Major Plan – The Bearded Patriot"], "summ2": ["Desperate Jared Fogle calls on Trump in latest bid to get out of prison", "CAIR New Trump Rule Blocking Asylum Seekers is Part of White Supremacist Agenda", "Here’s What’ll Happen to the Economy if We Deport Undocumented Immigrants", "Mary Robinson says she 'respects privacy' of wife of Dubai sheikh who has fled to Germany"]}
{"comp": "LC_R", "month": "Sep", "feats": "sbert", "test": 0.6988, "summ1": ["Brother of killed asylum seeker: ‘Tell the judge he told the truth’", "World Report 2019: Pakistan", "What's next for the Tamil family fighting to stay in Australia?", "Trump administration ready to deport, turn back more asylum seekers after Supreme Court ruling"], "summ2": ["Judge Blocks Ban on Asylum-Seekers Who Travel through Safe Third Country", "Pelosi: ‘Hell to pay’ if gun control bill doesn’t pass", "Loco in MOCO: The newest illegal alien arrested for rape in Montgomery County had criminal history, could have been deported", "Immigration Chief: Change Allows Focus on ‘Legitimate Asylum Claims’"]}
{"comp": "L_RC", "month": "May", "feats": "bow", "test": 0.6965, "summ1": ["Trump’s cruel new policy would effectively bar Central American refugees from seeking asylum", "The dangers of the government's DNA testing program", "Kushner's immigration plan has skeptics lining up on both sides", "Six Children Have Died While in ICE Custody – Why?"], "summ2": ["How did the U.S.-Mexico border come to be where it is today? Curious Texas digs into history", "Failed Immigration Policy Sustains a Lawless Cartel Empire", "AP Exclusive: Ex-Interpol chief's wife gets asylum in France", "Scheer vows to end 'illegal' border crossings as part of immigration policy plan"]}
{"comp": "L_RC", "month": "Jun", "feats": "sbert", "test": 0.6963, "summ1": ["Andrew Sullivan: Donald Trump and the Art of the Lie", "Are US immigration centres concentration camps?", "Here's A List Of The Democrats Who Voted To Shut The Door On Syrian Refugees", "HRC Joins Advocates to Call for Justice for Johana ‘Joa’ Medina"], "summ2": ["Blood Found in Trunk of Illegal Immigrant’s Car Confirmed to be Mollie Tibbetts: Prosecutors", "U.S. churches, some immigration officers denounce sending asylum seekers to Mexico", "Donald Trump’s deal for Mexico to avert tariffs falls short of new solutions to curb illegal immigration, but US president can claim ‘political win’", "Australian pilots spot sunken asylum seeker boat, refugees drowning"]}
{"comp": "ER_LC", "month": "May", "feats": "sbert", "test": 0.696, "summ1": ["Trump Wants Migrants To Pay A Fee To Request Asylum", "The Political Insider", "SCARY! Illegal immigration the most common crime in America", "DHS Flying Illegal Aliens to U.S. Cities, Releasing Them into Communities"], "summ2": ["Germany Grants Political Asylum to Two Hong Kong Independence Activists", "Appeals court rules Trump administration can make asylum seekers wait in Mexico for now", "Trump wants ‘toughness’ to deter migration, but physical measures keep failing", "Asylum seeker family finds valuable jewellery inside socks gifted through charity clothes drive"]}
{"comp": "C_L", "month": "Sep", "feats": "bow", "test": 0.6959, "summ1": ["U.S. judge restores nationwide block on Trump administration's asylum ban", "Tent courts set to open on border for US asylum seekers", "US Supreme Court Ruling Erodes Protections for Asylum Seekers, UN Says", "Athens to increase deportations after Lesvos sees biggest migrant influx since 2016"], "summ2": ["'Unconscionable': Asylum-Seekers In Texas Detention Center Report Being Denied Cancer and Mental Health Treatment", "Warnings That 'Lives Will Be Lost' After Right-Wing Supreme Court Allows Trump Asylum Ban to Take Effect", "Trump’s wall doesn’t exist ⁠— and even the GOP is backing away", "New Deal Would Force Asylum Seekers to Return to El Salvador Despite Obvious Dangers"]}
{"comp": "C_ER", "month": "Jul", "feats": "sbert", "test": 0.6958, "summ1": ["Trump administration sets new rule to make it harder for immigrants to seek asylum", "Salvadoran president: 'It is our fault' migrant father and daughter drowned in Rio Grande", "By The Numbers: Migration To The U.S.-Mexico Border", "Judge blocks Trump policy keeping asylum-seekers locked up"], "summ2": ["Illegal Immigrant Who Has Been Deported Twice Charged With Three Murders — Two Were Children", "Migrants Storm Paris Pantheon Demanding Papers and Free Housing", "Republican Establishment Redoubles Efforts to Keep Immigration Patriots Out of Senate in 2020", "TRULY AWFUL! Radical Democrat Ilhan Omar Compares US to the \"Mouth of the Shark\""]}
{"comp": "C_R", "month": "Mar", "feats": "sbert", "test": 0.6958, "summ1": ["Mexico braces for new caravan of Central American migrants", "Memo From San Diego Border Patrol Chief Tells Agents to Single Out Spanish-Speaking Asylum Seekers, Require Them to Wait in Mexico", "Tell Congress: seeking asylum isn’t a crime", "Trump struggles to defend his record amid setbacks on trade, North Korea"], "summ2": ["Illegal immigrant with criminal history stabs mom to death. Sanctuary state protected him.", "Senator Blumenthal Claims Border Crossings At 'Historic Low.' CBP Flattens Him.", "Church attacks Home Office for saying Christianity 'not peaceful' to reject asylum seeker", "How Illegal Immigrant Activity Fuels America's Opioid Crisis"]}
{"comp": "ER_L", "month": "Sep", "feats": "sbert", "test": 0.6947, "summ1": ["Police: Illegal Impregnated Teen Girl After Crossing Border as 'Family Unit'", "Bernie wants to Expand Asylum to ‘Climate Change Victims’", "Lawsuit: Illegal Aliens Worked for 10 Years Using Stolen Identities at Plant", "IT HAPPENED: Supreme Court Rules Trump Admin Can Enforce New Asylum Policy (Details)"], "summ2": ["It’s official: Trump’s wall is a flop and even Fox News now calls his big campaign promise a mistake", "Federal Judge Restores Nationwide Injunction Against Trump Asylum Rule", "US government watchdog details trauma experienced by separated migrant children", "After SCOTUS Ruling, Asylum Seekers Ask Court for Protection"]}
{"comp": "LC_R", "month": "Aug", "feats": "sbert", "test": 0.6947, "summ1": ["US, Mexico widen asylum crackdown to push back all migrants", "Families seeking a fresh start in Lewiston while waiting for asylum", "Fears of mental health epidemic as Nauru detainee self-immolates", "Judge Allows Some States to Block Migrants From Seeking Asylum"], "summ2": ["Fifth Illegal Immigrant Accused of Rape Arrested In Maryland County In Less Than A Month", "National Review Writer ‘Coyly’ Makes El Paso Killer a Conservative", "BREAKING: Federal judge issues ruling on Trump asylum policy", "CBP Chief Mark Morgan Defends Record-Breaking Illegal Immigration Raid"]}
{"comp": "ER_LC", "month": "May", "feats": "bow", "test": 0.6919, "summ1": ["Illegal immigrant Working as Nurse charged with killing at least 12 elderly women", "DHS Releases 9K Illegal Aliens into U.S. In 8 Days; 1.1K Released a Day", "‘We’ve Lost Control of the Border,’ Says Border Patrol Agent", "Report: Dream Act ‘On Hold’ After Amnesty Activists Demand Criminals Get Path to Citizenship"], "summ2": ["Trump's immigration plan fails to address key parts of debate: ANALYSIS", "UN urges Canada to take more vulnerable Central American migrants from Mexico", "US border: Sixth death of migrant child in custody", "Trump Can Keep Sending Asylum Seekers to Mexico While They Await Immigration Hearings, Court Rules"]}
{"comp": "R_RC", "month": "Aug", "feats": "bow", "test": 0.6913, "summ1": ["Joe Biden just endorsed Trump's asylum rule at the Democratic debate", "German home-schooling family faces deportation after Supreme Court denies hearing", "Trump's immigration chief REWRITES plaque on the Statue of Liberty to push immigration crackdown", "REPORT: Illegal alien rape suspect released from jail, violating detainer policy, ICE says – USSA News"], "summ2": ["India deports Maldives’ former VP seeking political asylum", "900 asylum seekers return to wait in Mexican city", "China lashes Taiwan over offer to Hong Kong protesters", "Fix Syria to solve refugee problem"]}
{"comp": "C_L", "month": "Aug", "feats": "bow", "test": 0.6913, "summ1": ["Federal judge rules against Trump asylum policy", "Migrant kids separated at border faced abuse in foster homes", "US, Mexico Widen Asylum Crackdown to Push Back All Migrants", "House Speaker Pelosi in Central America as Trump Seeks Asylum Deals"], "summ2": ["Gay asylum seeker says LGBT claims are 'not being taken seriously'", "'Outrageous': Lindsey Graham Breaks Senate Rules to Advance Sweeping Anti-Asylum Bill", "What is the Flores settlement?", "White Nationalist Terrorism Is a Problem. Trump Is a Bigger One."]}
{"comp": "C_L", "month": "Jul", "feats": "sbert", "test": 0.6893, "summ1": ["Salvadoran president: 'It is our fault' migrant father and daughter drowned in Rio Grande", "US set to admit fewest refugees in decades: report", "US Court Halts Asylum Ruling Barring Abuse, Gang Victims", "US to send asylum seekers back to dangerous part of Mexico"], "summ2": ["Trump Will Soon Obliterate the Right to Asylum", "DOJ Guts Asylum Protections for Members of Families Threatened With Violence", "Former 'nonprofit' CEO received $3.6 million salary for jailing separated migrant children", "Gerry Connolly Explodes on Thomas Homan at Hearing"]}
{"comp": "L_RC", "month": "Aug", "feats": "bow", "test": 0.6889, "summ1": ["Shadow minister: Home Office is 'persecuting' LGBT asylum seekers", "What is the Flores settlement?", "'Outrageous': Lindsey Graham Breaks Senate Rules to Advance Sweeping Anti-Asylum Bill", "El Paso Gunman’s Fear of a Migrant “Invasion” Echoed Donald Trump and Fox News"], "summ2": ["India rejects asylum to former Maldives vice president fleeing his country's police after embezzlement of state funds", "900 asylum seekers return to wait in Mexican city", "No entry: Apart from those living in Africa, everyone, everywhere is an illegal immigrant", "China lashes Taiwan over offer to Hong Kong protesters"]}
{"comp": "C_L", "month": "Jan", "feats": "bow", "test": 0.6882, "summ1": ["Wall debate obscures other struggles at the border", "U.N. refugee agency interviews Saudi teen asylum seeker in Thailand", "Young Saudi asylum-seeker arrives in Canada to official welcome", "Fact-checking Trump's claim on cost of illegal immigration, number of immigrants here illegally"], "summ2": ["After Donald Trump's Border Security Speech, Trump Jr. Uses Zoo as Example of Walls Working", "First asylum seeker returned to Mexico under new—and deeply flawed—Trump policy", "'Literally What Jesus Told People to Do': In Arizona, Possible Prison Time for Leaving Food and Water for Migrants", "Polls agree: Americans don't like shutdown and they blame Trump"]}
{"comp": "L_R", "month": "Mar", "feats": "bow", "test": 0.6881, "summ1": ["At Michigan Rally, Trump Mocks Asylum Seekers Fleeing Violence", "Five takeaways from Wednesday's hearings on immigration and family separation", "Rep. Steve King Still Promotes White Supremacists On His Website", "Trump administration kept secret database targeting journalists and immigration activists at US-Mexico border"], "summ2": ["Immigration court backlog up 300%, system ‘on brink of collapse’", "San Jose – Illegal Alien Arrested for Killing Woman – Nine ICE Detainers Declined – USSA News", "DHS secretary defends 'metering' asylum seekers at border: 'We're not turning anybody around'", "All but 6 Democrats oppose resolution against illegal aliens voting"]}
{"comp": "L_RC", "month": "Feb", "feats": "bow", "test": 0.6875, "summ1": ["Trans Immigrant Who Died in Federal Custody Was Abused, Activists Say", "Pipeline of Undocumented Workers for Trump Golf Course Was ‘Open Secret’: WaPo", "Trump Supporters Form Human Chain at Mexican Border Chanting 'Build a Wall' Before El Paso Rally", "Three Trump Officials Were Warned Family Separation Would Be Illegal and Scar Children"], "summ2": ["Illegal immigrant charged with possession of cocaine, heroin in Peabody", "RCMP has spent more than $6.6M to process migrants at Canada's busiest illegal crossing", "Scott Morrison prime minister pushes back on refugee medical transfer bill news Australia", "The local cost of reopening the Christmas Island detention centre"]}
{"comp": "ER_RC", "month": "Feb", "feats": "sbert", "test": 0.6875, "summ1": ["Police: Baby Due Next Month Killed By Drunk Illegal Alien", "Rapper 21 Savage Arrested By ICE in Atlanta: ‘His Whole Public Persona Is False’", "Donald Trump: Democrats Trying to Stop ICE from Deporting Illegals", "Walls Around The World That Work: Britain Is The Latest Country Bolstering Its Borders"], "summ2": ["Paul Murray: Bill Shorten’s support of medivac bill for asylum seekers a very risky tactic", "Obama Tripled Migrant Processing at Legal Ports—Trump Halved It", "Lawmakers quiet on Trump, Northern Nevada killings", "Toronto receives $11-million from feds to deal with spike in asylum seekers"]}
{"comp": "C_R", "month": "Aug", "feats": "sbert", "test": 0.6859999999999999, "summ1": ["US, Mexico widen asylum crackdown to push back migrants", "Pausing Asylum Interviews Would Harm 40K, Mass. Dems Say", "Trump administration asks Supreme Court to lift order blocking asylum rule", "Psychiatrist to CNN's Stelter: Trump 'may be responsible for many more million deaths' than Hitler, Stalin, Mao"], "summ2": ["This Meet The Press Exchange Shows Why We Won’t Deal With Growing White Nationalism As a Society", "Court sets asylum rules for CA and AZ that are different from those in TX and NM", "Security guard who kidnapped a lost girl, 3, in a mall and sexually assaulted her will be DEPORTED", "CBP Chief Mark Morgan Defends Record-Breaking Illegal Immigration Raid"]}
{"comp": "C_R", "month": "Sep", "feats": "bow", "test": 0.6857, "summ1": ["Judge reinstates nationwide halt on Trump asylum policy plan", "U.S. credits Mexico, Central America for sharp drop in border arrests", "Tent courts set to open on border for U.S. asylum seekers", "U.N. refugee agency regrets U.S. ruling on asylum applications"], "summ2": ["Top Asylum Official Reassigned to Virginia Processing Center", "Federal Judge Reinstates Injunction Against Trump Administration's Asylum Rule", "White House: More work needed to reduce illegal immigration", "Loco in MOCO: The newest illegal alien arrested for rape in Montgomery County had criminal history, could have been deported"]}
{"comp": "ER_L", "month": "Feb", "feats": "bow", "test": 0.6856, "summ1": ["Mexican Government Busing 1700 Caravan Migrants to Unsecured Texas Border Area", "Americans Want Stronger Immigration Enforcement, Not Less", "In Memoriam: 12 Americans Allegedly Killed by Illegal Aliens in 2018", "Surprise! Woman Who Attacked Massachusetts Man Over MAGA Hat Is Illegal Alien; Arrested By ICE Tuesday"], "summ2": ["SPLC sues Trump administration for policy forcing asylum seekers to wait in Mexico", "ICE Used Taxpayer Money to Pay Private Prisons $800 Million to Detain Migrants in 2018: Report", "Trump Supporters Form Human Chain at Mexican Border Chanting 'Build a Wall' Before El Paso Rally", "Wife of White House communications director pushes false anti-vaccination claims"]}
{"comp": "L_LC", "month": "May", "feats": "sbert", "test": 0.6846, "summ1": ["The US Is Making Immigrants Pay for Its Red Tape With Asylum Application Fees", "Asylum-seeker separated from son for 378 days by Trump admin wins immigration case", "Maria Bartiromo: ‘Is There Any Reason Why We Should Not Be Trusting President Trump?’", "READ: ICE Deputy Director Says of DNA Testing: ‘This is a Pilot Designed to Assess the Usefulness of this Technology in an Investigative Process’"], "summ2": ["Appeals court rules Trump administration can make asylum seekers wait in Mexico for now", "The US is spending $37 million on two new tent cities for detained immigrant children and families", "Trump favors democracy’s enemies. An Oval Office meeting Monday makes the point.", "Asylum seeker family finds valuable jewellery inside socks gifted through charity clothes drive"]}
{"comp": "LC_R", "month": "Mar", "feats": "sbert", "test": 0.6832, "summ1": ["Japanese-American activists will bring paper cranes to show solidarity with migrant families", "Playing politics with a child’s life shames us all, Mr Javid | Jess Phillips", "U.S. struggling with growing number of asylum seekers", "U.S. judge blocks Trump crackdown on asylum seekers, bars blanket detentions of those with persecution claims"], "summ2": ["Senator Blumenthal Claims Border Crossings At 'Historic Low.' CBP Flattens Him.", "Principled Libertarian Justin Amash Votes in Support of Illegal Alien’s Right To Vote – USSA News", "Church attacks Home Office for saying Christianity 'not peaceful' to reject asylum seeker", "How Illegal Immigrant Activity Fuels America's Opioid Crisis"]}
{"comp": "L_LC", "month": "Feb", "feats": "bow", "test": 0.6817, "summ1": ["U.S. border violence stalks Tijuana every day", "Donald Trump has bizarre meltdown, threatens to have ISIS attack Europe or something", "ICE Arrests 200 Illegal Immigrants in North Carolina, Calling it 'The New Normal'", "Trump tries to recover some momentum with a bunch of freshly baked lies after emerging from his White House cocoon"], "summ2": ["Trump gets sued over his asylum policy. Again. Next up: his fake national emergency", "‘After nine years in direct provision I have never stopped living’", "Finding all migrant children separated from their families may be impossible, feds say", "Australia announces reopening of offshore detention center"]}
{"comp": "ER_RC", "month": "Jul", "feats": "bow", "test": 0.6805, "summ1": ["REPORT: Ilhan Omar's Father and Other Somalian War Crimes Perpetrators Now Living Illegally in the US", "Influential Democrat: Why Is Our Party Supporting Criminal Illegal Aliens?", "Only 35 Out of 2K Illegal Aliens Arrested by ICE in Highly-Publicized Raids", "Charge: Twice Deported Guatemalan Murdered Iowa Woman, Her Two Children"], "summ2": ["CBSA has increased deportations, though removals of irregular asylum seekers remain low", "Taiwan will consider granting Hong Kong protesters asylum, President Tsai Ing-wen says", "‘Britain has fallen, freedom’s gone’ – Tommy Robinson asks Trump for political asylum in US", "US judge blocks Donald Trump's latest sweeping asylum rule"]}
{"comp": "L_R", "month": "Sep", "feats": "bow", "test": 0.6802, "summ1": ["Judge blocks ICE from denying parole to asylum-seekers", "Migrant Children Are Being Given To An Adoption Agency Linked To Betsy DeVos", "An Invisible Crisis: Thousands of African Migrants Are Stranded in Mexico Hoping to Head North", "Supreme Court Ruling Carries Dire Implications for Asylum-Seekers"], "summ2": ["Eighth Illegal Immigrant Arrested For Rape in Montgomery County, Maryland", "White House slams judge's order against new asylum rule: A 'gift to human smugglers and traffickers'", "Border Force intercepts 22 migrants trying to cross the Channel in two boats", "Biden Defends Obama Immigration Policies: 'We Didn't Lock People Up in Cages'"]}
{"comp": "R_RC", "month": "Feb", "feats": "bow", "test": 0.6799, "summ1": ["Trump administration sued over shift in asylum policy", "Democrats move to block Trump's emergency border wall", "Early morning traffic stop nabs convicted illegal immigrant child sex abuser, deported twice before", "Trump says Pelosi is 'very bad for our country'"], "summ2": ["Why Trump's National Emergency Sets An Alarming Precedent", "Trump administration sued over major shift in asylum policy", "Police identify Aurora gunman as Gary Martin; 5 killed and 5 police officers wounded", "Scott Morrison prime minister pushes back on refugee medical transfer bill news Australia"]}
{"comp": "L_LC", "month": "Feb", "feats": "sbert", "test": 0.6798, "summ1": ["Tommy Robinson ignores former EDL member's child sex abuse", "A Historian on How Trump’s Wall Rhetoric Changes Lives in Mexico", "Here’s how the Saudi press has been smearing the teen who fled her family – ThinkProgress", "Stop This Cruelty Toward Asylum Seekers"], "summ2": ["House passes gun background check bill after GOP undocumented amendment", "A Pilgrim's Journey", "Bahraini footballer pleads in court against deportation", "'They're lying to us': Refugee advocates accuse Coalition of people smuggler fear campaign"]}
{"comp": "L_RC", "month": "Apr", "feats": "bow", "test": 0.6784, "summ1": ["FBI Arrests Leader Of Right-Wing Anti-Immigrant Militia In New Mexico", "Judge tells Trump to stop sending Central American asylum seekers back to Mexico", "WH Wanted to Release Migrants in Sanctuary Cities: Report", "Attorney General Barr just handed ICE more power to keep asylum seekers in detention"], "summ2": ["'Our country is full': Trump says migrants straining system after border visit", "Wikileaks founder Julian Assange arrested by London police after Ecuador withdraws asylum", "US judge orders halt to Trump asylum policy", "State House passes bill to strengthen sanctuary status for illegal immigrants"]}
{"comp": "ER_L", "month": "Jun", "feats": "sbert", "test": 0.6783, "summ1": ["George Will: America Needs 'As Much Immigration as Economy Can Take'", "Mexican President Confirms Alert over 3 ISIS Terror Suspects Headed to Border", "D.C. Region Makes ‘Sanctuary Congregations’ to Shield Illegal Migrants", "Illegal Alien Rapist Released In Sanctuary, Attacks Wheelchair-Bound Victim Again"], "summ2": ["DMZ: Donald Trump steps into North Korea with Kim Jong Un -- live updates", "Are US immigration centres concentration camps?", "A little girl and her father tragically drown trying to reach the U.S. to seek political asylum", "The Crisis at the Border is an LGBTQ Issue. Here’s Why."]}
{"comp": "C_R", "month": "Jul", "feats": "sbert", "test": 0.677, "summ1": ["Trump administration sets new rule to make it harder for immigrants to seek asylum", "Salvadoran president: 'It is our fault' migrant father and daughter drowned in Rio Grande", "By The Numbers: Migration To The U.S.-Mexico Border", "Judge blocks Trump policy keeping asylum-seekers locked up"], "summ2": ["Protests erupt outside Phoenix ICE office after arrest of illegal immigrant", "Decision 2020: The Fake Election For Non-America", "Dem Jayapal Joins Migrant Caravan for Border Crossing, Helps 5 Asylum Seekers Enter U.S.", "REPORT: DHS Veterans Blast Democrats For Wanting To Decriminalize Illegal Immigration"]}
{"comp": "L_LC", "month": "Aug", "feats": "bow", "test": 0.6761, "summ1": ["What is the Flores settlement?", "Trump Keeps Cracking Down on Legal Immigration Because His Base Loves Cruelty", "'Outrageous': Lindsey Graham Breaks Senate Rules to Advance Sweeping Anti-Asylum Bill", "Reporter calls out Trump to his face: You and El Paso shooter use the same ‘invasion’ rhetoric"], "summ2": ["900 asylum seekers returned to wait in Mexican border city", "Biloela Tamil family moved to Christmas Island", "Channel migrants: Sixty six people found in small boats", "Trump asks U.S. Supreme Court to allow full enforcement of asylum crackdown"]}
{"comp": "R_RC", "month": "Sep", "feats": "bow", "test": 0.6759, "summ1": ["NY City bans speech that might offend illegal aliens, up to $250,000 per offense", "'We'll turn them back': Cuccinelli cites absolute limit to persecuted Christians entering the U.S.", "Federal Judge Reimposes Nationwide Injunction on Trump Asylum Policy in Defiance of Court Decision", "Sheriff Slams Sanctuary County After Seventh Illegal Immigrant Arrested for Alleged Sexual Abuse"], "summ2": ["Indian man flees to US to escape BJP wrath, forced to sit on 70-day hunger strike to seek asylum", "US judge blocks Trump move on asylum-seekers", "Baldev Kumar, ex-MLA from Imran Khan's party, seeks political asylum in India; accuses Pakistan of persecuting minorities", "Tamil family: Dutton lashes out at Tamil parents"]}
{"comp": "C_RC", "month": "Apr", "feats": "sbert", "test": 0.6748, "summ1": ["Five ways Trump's moves to stem asylum seekers have hit hurdles", "Trump Administration Seeks Emergency Court Order to Continue Asylum Policy", "Rwandan convicted of lying while seeking US asylum after genocide", "Mexico won't block caravans from entering through Guatemala, top official says"], "summ2": ["WikiLeaks Founder Julian Assange Arrested by British Police", "Facing the hardest facts on illegal immigration", "Trump pushes hard-line asylum policy", "Peduto: Sending immigrant detainees to Pittsburgh not a punishment"]}
{"comp": "C_R", "month": "Jun", "feats": "sbert", "test": 0.6743, "summ1": ["Cold, cramped, filthy: Migrants describe border centers", "Central American migrants plead to seek asylum in U.S., not Mexico", "Romney Pens New Bill to Help End Employment of Illegal Immigrants, Make E-Verify System Permanent", "Trump: Immigration raids could start Fourth of July"], "summ2": ["TRUMP TWEET: Major announcement on Illegal Immigration Removal Process (Deportation) – USSA News", "Mumps outbreak at Texas jail strikes 14 and forces another 300 into quarantine", "Illegal immigrant opens fire at Arizona border", "Pelosi: Overstaying Visas, Status Violations 'Shouldn't Be a Crime'"]}
{"comp": "R_RC", "month": "Jan", "feats": "bow", "test": 0.6743, "summ1": ["WATCH: Victims of Illegal Immigration Storm Pelosi’s Office, Chant 'Build The Wall'", "New Migrant Caravan Departs, Headed for United States", "A History Lesson on the Shifting Political Stances on Illegal Immigration", "‘Manufactured crisis’ update: Previously arrested illegal immigrant suspected of 4 murders in Nevada"], "summ2": ["Australia considering resettlement for fleeing Saudi teen Rahaf", "Canada grants asylum to Saudi woman who pleaded for help on Twitter in Bangkok", "Trump’s border crisis is disingenuous, nonexistent, say Dems as they tour border facilities", "US Starts Returning Asylum-Seekers to Mexico Under New Policy"]}
{"comp": "L_RC", "month": "Jun", "feats": "bow", "test": 0.6743, "summ1": ["A trans woman died in ICE custody on the first day of Pride Month, advocates report", "99-Year-Old Nuremberg Prosecutor Calls Trump's Detention of Children a 'Crime Against Humanity'", "Congress has been fighting over aid to the border for weeks. Trump just got in the middle of it.", "'This Is Sick': Horror as Trump Administration Plans to Detain Migrant Children at Former Japanese Internment Camp"], "summ2": ["Taxpayers picked up Judge Joseph’s $127,000 legal bill", "Washington DC Politics", "Mexico Sends Almost 15,000 Troops to US-Mexico Border to Curb Illegal Immigration", "Migrant drownings US news: Dad and daughter died in each other's arms"]}
{"comp": "LC_R", "month": "Jul", "feats": "sbert", "test": 0.6742, "summ1": ["As asylum seekers move outside Portland, communities look to add cultural supports", "Yarl's Wood: Trafficking victims 'detained for months'", "Opponents sue to block Trump’s new asylum rules", "Top ICE official suggests census citizenship question could help with ‘burden’ of illegal immigration"], "summ2": ["Protests erupt outside Phoenix ICE office after arrest of illegal immigrant", "Beto’s claim America was ‘founded on white supremacy’ sparks heated battle on ‘The Five’", "Commentary: Can President Trump’s New Asylum Rules Stem the Illegal Tide?", "REPORT: DHS Veterans Blast Democrats For Wanting To Decriminalize Illegal Immigration"]}
{"comp": "C_R", "month": "Apr", "feats": "sbert", "test": 0.6735, "summ1": ["Uganda says it is willing to consider asylum for Sudan's ousted leader Bashir", "US judge blocks Trump's 'Remain in Mexico' asylum policy", "As US releases thousands of asylum seekers at the border, volunteers struggle to keep pace", "Mexican president wants to 'bring order' to Central American migration to U.S."], "summ2": ["Illegal Immigrant Deported In 2005 Is arrested In Louisiana On More Than 100 Counts Of Child Sex Crimes, Including Producing Child Pornography", "For a Week, ABC, NBC Ignore Yuma’s Migration-Caused State of Emergency", "Trump Considers Copying Obama: May Send Illegals to Political Foes’ (Sanctuary) Cities", "William Barr Asylum Rule: Common-Sense Border Enforcement"]}
{"comp": "C_RC", "month": "Sep", "feats": "bow", "test": 0.6726, "summ1": ["Nonprofits Urge High Court To Maintain Block On Asylum Bar", "Judge restores nationwide block on Trump administration's asylum ban", "Tent Courts Set to Open on Border for US Asylum Seekers", "Athens to increase deportations after Lesvos sees biggest migrant influx since 2016"], "summ2": ["'Got my freedom': Indian seeking asylum in US released after 70-day hunger strike", "Activists hold protest against Pak brutalities in New York", "Australian Border Force stops Sri Lanka asylum boat in fourth intercept since May", "SCOTUS overrules federal judge, lets Trump’s ‘safe 3rd country’ asylum restrictions take effect"]}
{"comp": "L_LC", "month": "Apr", "feats": "sbert", "test": 0.6721, "summ1": ["‘Heartless Punishment Against Vulnerable People’: AG William Barr Rules Asylum Seekers Can Be Detained Indefinitely", "Trump Promised Pardon to Head of Customs and Border Protection if He Broke the Law by Blocking Asylum Seekers", "Trump’s War on Democracy: An Update", "Decriminalizing illegal immigration and 3 other 'radical' ideas in Julián Castro's new immigration plan"], "summ2": ["More Than 3,100 Migrants Found With Fake Documents In Past Year, Federal Agents Say", "Federal judge blocks Trump administration program forcing asylum seekers to remain in Mexico while awaiting court hearings", "The Heat: The arrest of Julian Assange", "Beto O’Rourke calls for tearing down existing border barriers in El Paso"]}
{"comp": "LC_R", "month": "Mar", "feats": "bow", "test": 0.6719, "summ1": ["Why I support the president’s national emergency", "The scandal-ridden industry of migrant child shelters", "US asylum policy endangers migrants' lives, groups say", "From refugee camp to the runway: Brisbane designer gives back to Congo"], "summ2": ["Canada ramps up border security to stop the flow of asylum-seekers coming from the US", "ICE Officials In New York Arrested More Than 20 Illegal Immigrants After Sanctuary City Policies Released Them", "Trump: Democrats are only calling me a 'racist' because I'm WINNING", "BREAKING: Democrat House Votes In Favor Of Illegal Alien Voting, Report Says – USSA News"]}
{"comp": "C_R", "month": "Aug", "feats": "bow", "test": 0.6714, "summ1": ["US, Mexico widen asylum crackdown to push back all migrants", "Mumps sickens hundreds of detained migrants in 19 states", "22 AGs Urge Trump Admin. To Withdraw Rule Limiting Asylum", "House Speaker Pelosi in Central America as Trump Seeks Asylum Deals"], "summ2": ["California Court Overturns Conviction Against Illegal Immigrant in Kate Steinle Death Case", "Biden On Illegal Immigration: ‘People Should Have To Get In Line’", "ICE chief on Mississippi raids: Parents 'responsible for placing their children in this situation'", "Fourth Illegal Alien Arrested on Rape Charges in Sanctuary County in Less Than One Month"]}
{"comp": "L_LC", "month": "Jan", "feats": "sbert", "test": 0.6704, "summ1": ["US asylum seekers face long waits or risky crossings due to supposed capacity crunch", "Trump’s Leverage in the Shutdown Fight: His Own Nihilism", "Will Parents Separated from Their Children at the Border Be Forced to Separate Again to Win Asylum?", "Highlighting Systematic 'Violation of International Human Rights', Ocasio-Cortez Shreds Trump Address"], "summ2": ["Despite Trump's claims, most illegal immigration is not at the southern border", "UN interviews Saudi teen seeking asylum in Thailand", "U.S. sends first Central American asylum seeker to Mexico under new policy", "Asia Bibi: Pakistan’s top court upholds blasphemy acquittal"]}
{"comp": "LC_R", "month": "Sep", "feats": "bow", "test": 0.6704, "summ1": ["US tells migrant woman 8 months pregnant to wait in Mexico", "Federal judge blocks Trump policy on Central Americans seeking U.S. asylum", "Former Pakistan legislator from Imran Khan’s party seeks asylum in India", "EXCLUSIVE: Arrests of suspected undocumented migrants soar in Sheffield, the UK’s first City of Sanctuary"], "summ2": ["NY City bans speech that might offend illegal aliens, up to $250,000 per offense", "'We'll turn them back': Cuccinelli cites absolute limit to persecuted Christians entering the U.S.", "8th Illegal Alien Rapist in Montgomery County Since Sanctuary Order", "Supreme Court greenlights nationwide enforcement of Trump’s new asylum policy"]}
{"comp": "L_LC", "month": "Jan", "feats": "bow", "test": 0.6691, "summ1": ["Here’s the offer Trump is making to Democrats to end the shutdown", "After Donald Trump's Border Security Speech, Trump Jr. Uses Zoo as Example of Walls Working", "Saudi teen refugee arrives safely in Canada after dramatic asylum plea", "‘Remain in Mexico’ policy could also be the Trump administration’s most dangerous"], "summ2": ["Saudi Woman Fleeing Alleged Abuse Granted Asylum In Canada", "Rahaf al-Qunun: Saudi woman pleads for asylum", "DHS plans to begin turning asylum-seekers back to Mexico to await court dates", "Oz-bound immigrants are Indians, say police"]}
{"comp": "LC_R", "month": "Apr", "feats": "sbert", "test": 0.669, "summ1": ["Federal judge blocks Trump administration program forcing asylum seekers to remain in Mexico while awaiting court hearings", "Trump's support of renewed child separation policy led to collision with Nielsen", "Assange's Ecuador Embassy life: 'discourteous and aggressive' behavior and bad hygiene reports", "Switzerland: Authorities must drop absurd charges against priest who showed compassion to asylum-seeker"], "summ2": ["CBS Disapproves of Trump’s ‘Remain in Mexico’ Policy for Asylum Seekers", "Massachusetts Judge and Court Officer Indicted for Allegedly Helping Illegal Immigrant Evade ICE Officials", "It’s SIMPLE math! Rep. Dan Crenshaw gets REAL about the crisis at the border and Lefties come un-glitter-glued", "Immigration: President Trump Considers Releasing Detainees into Sanctuary Cities"]}
{"comp": "C_R", "month": "Feb", "feats": "sbert", "test": 0.6673, "summ1": ["Hope and anguish in a Mexican refugee shelter: Researcher records stories of Central American asylum seekers", "Top Swedish Newspaper Editorialist: \"Ban Cars To Stop Terror\"", "Australian government seeks to block bid to relax tough law on migrants", "US sees limitations on reuniting migrant families"], "summ2": ["Afghan asylum seeker who made car noises as he raped backpacker is jailed for seven years", "CBS's O'Donnell Bolsters Schumer on Illegal Immigration", "Democrats Protect Illegal Alien Criminals Who Fail Firearm Background Checks – USSA News", "Migrant Caravan Detained in Old Factory, Across From Texas"]}
{"comp": "LC_R", "month": "Jun", "feats": "sbert", "test": 0.667, "summ1": ["Trump Threatens To Deport 'Millions,' As He Kicks Off Campaign For Reelection", "Transgender detainee was beaten before dying of dehydration in ICE custody, independent autopsy finds", "Passengers describe drama of turning asylum seeker boats back", "Central American migrants plead to seek asylum in U.S., not Mexico"], "summ2": ["Immigration Debate: Trump’s Border Crisis Is Like Obama’s", "Serial killer illegal alien in Texas may be linked to 6 more deaths, says Dallas D.A. – USSA News", "Nancy Pelosi proposes emergency border bill. Here’s a list of what is in it.", "After Trump Delays ICE Raids, Pelosi Celebrates And Makes Another Outrageous Demand"]}
{"comp": "C_L", "month": "Jun", "feats": "bow", "test": 0.6669, "summ1": ["Trump could have tough time meeting his deportation threat", "Homeland Security official describes widespread 'fraudulent' families at border", "Mexico has yet to expand asylum-seeker program agreed to with U.S.", "H.R. 2820, the Dream Act of 2019"], "summ2": ["4 Severely Ill Migrant Toddlers Hospitalized After Lawyers Visit Border Patrol Facility", "Trump took to Twitter to announce that he's postponing ICE's deportation raids in 10 major cities", "A trans woman died in ICE custody on the first day of Pride Month, advocates report", "'This Is Sick': Horror as Trump Administration Plans to Detain Migrant Children at Former Japanese Internment Camp"]}
{"comp": "C_R", "month": "Jan", "feats": "bow", "test": 0.6658, "summ1": ["Exclusive: US to begin returning asylum seekers to Mexico on Friday - official", "U.N. refugee agency interviews Saudi teen asylum seeker in Thailand", "Government shutdown stymies immigrants' asylum cases", "Young Saudi asylum-seeker arrives in Canada to official welcome"], "summ2": ["US Starts Sending Asylum-Seekers Back to Mexico to Wait Out Claims", "Illegal immigrant, 29, who 'murdered three and critically injured another' at an Oregon pot farm had been deported SIX TIMES", "EDITORIAL: Rahaf Mohammed al-Qunun and Asia Bibi — two cases that deserve our attention", "WATCH: Victims of Illegal Immigration Storm Pelosi’s Office, Chant 'Build The Wall'"]}
{"comp": "C_R", "month": "Jan", "feats": "sbert", "test": 0.6657, "summ1": ["Asylum applications in Germany fall for second year in a row", "Saudi asylum seeker in Thailand en route to Canada after saga", "Trump administration pulls US out of UN human rights council", "The emergency at the border isn’t national. It’s regional"], "summ2": ["Germany could deport asylum-seekers who hide their identity", "Illegal immigrant from El Salvador accused of killing four people", "Dems and NeverTrumpers Are 'the Cruelest,' as They Treat Victims of Illegal Immigrant Crime with Scorn", "Chuck and Nancy (Sad)"]}
{"comp": "L_R", "month": "Apr", "feats": "sbert", "test": 0.6643, "summ1": ["Julian Assange arrested by the Met police after Ecuador withdraws his asylum", "Trump's staff are sweating bullets he'll find out they told Mueller the truth", "Rights group condemns U.S. ‘vigilante’ treatment of migrants on border", "9th Circuit Judge Blocks Major Trump Immigration Policy — ACLU Celebrates"], "summ2": ["Denver-area school districts cancel classes amid ‘credible threat’ of woman ‘infatuated’ with Columbine shooting", "White House Rips California Judge’s Ruling On Asylum", "Is 2020 Dem candidate Cory Booker a RACIST? Isn’t that what you are if you think illegal immigration is unsafe?", "BUSTED: Lauren Southern CATCHES an NGO Laundering $500,000"]}
{"comp": "C_L", "month": "May", "feats": "bow", "test": 0.6642, "summ1": ["If you don't think illegal immigrants are voting for president, think again", "U.S. will assign dozens of border agents to migrant asylum interviews", "Trump can make asylum seekers wait in Mexico, court says", "Mexico's refugee agency turns to U.N. amid asylum surge, funding cuts"], "summ2": ["New Trump immigration overhaul will force asylum seekers to pay a fee", "Guatemalan migrant, 2, dies in U.S. custody, in 4th such child death since December", "Officials just sounded the alarm as Trump launches diabolical plan to use migrants to punish Democrats", "Trump's reported new immigration rule would sneakily ban Central American migrants from claiming asylum"]}
{"comp": "C_R", "month": "Apr", "feats": "bow", "test": 0.6638, "summ1": ["Trump administration seeks emergency court order to continue asylum policy", "Trump proposal for sanctuary cities infuriates Dems", "Ecuador's President: Assange Breached Terms of London Embassy Asylum", "Trump’s threat to close border stirs fears of economic harm"], "summ2": ["California man arrested for allegedly posing as an ICE agent to rob illegal immigrant construction workers", "Federal Authorities Charge Judge and Court Officer for Aiding Illegal Immigrant in Escape From ICE", "Old clip of Trump calling MS-13 animals gets edited and recirculated as new, and look who fell for it …", "Why Are Democrats Upset at Illegal Aliens Being Sent to Their Sanctuary Cities?"]}
{"comp": "ER_R", "month": "May", "feats": "bow", "test": 0.6626, "summ1": ["Illegal immigrant Working as Nurse charged with killing at least 12 elderly women", "Orban: 'We Want Change, We Want a Europe that Protects Its Borders'", "DHS Flying Illegal Aliens to U.S. Cities, Releasing Them into Communities", "Caravan Update: Africans, Bangladeshis, Syrians, Afghans in Mexico Awaiting U.S. Asylum"], "summ2": ["Thousands of Alleged Asylum-Seekers Booted Out of US Under Trump’s ‘Remain In Mexico’ Policy", "'My family supports him': Family of slain police Cpl. Ronil Singh thanks Trump during speech", "PressTV-Trump vows more tariffs on Mexico to end immigration", "Oh My: NYT Editorial Board Concedes Trump is Right on Border Crisis, Urges Congress to Fulfill New WH Budget Request"]}
{"comp": "L_R", "month": "Sep", "feats": "sbert", "test": 0.6622, "summ1": ["Off-the-Rails President Takes to Twitter in Anti-Semitic and Racist Rant", "An Invisible Crisis: Thousands of African Migrants Are Stranded in Mexico Hoping to Head North", "'Victory': Federal Judge Reinstates Nationwide Injunction on Trump Effort to Block Asylum Seekers at Southern Border", "US government watchdog details trauma experienced by separated migrant children"], "summ2": ["Edward Snowden discovers his self-made purgatory", "Politico: Trump Administration's Border Moves Are Working", "Loco in MOCO: The newest illegal alien arrested for rape in Montgomery County had criminal history, could have been deported", "Immigration Chief: Change Allows Focus on ‘Legitimate Asylum Claims’"]}
{"comp": "R_RC", "month": "Feb", "feats": "sbert", "test": 0.6616, "summ1": ["Beto O'Rourke says he 'absolutely' supports destroying existing walls on southern border", "Democrat Invites Illegal Immigrant to State of the Union Address", "Thousands of sheriffs warn Congress about dangers associated with key component of possible immigration deal", "Illegal Alien Confesses to Murder of New York Woman: 'We Are Devastated'"], "summ2": ["Sheriff: Undocumented immigrant admitted 2 Nevada slayings; gun used in 4", "The local cost of reopening the Christmas Island detention centre", "Coalition, Labor battle on asylum seekers", "People use int'l student programme to foster illegal immigration status: State Dept Spokesperson"]}
{"comp": "C_R", "month": "May", "feats": "sbert", "test": 0.6613, "summ1": ["Julian Assange gets 50 weeks in jail for skipping bail in 2012", "Alan Dershowitz: Are congressional investigations of Trump the new McCarthyism?", "Appeals court allows U.S. to keep sending asylum seekers to Mexico", "New Mexico city of Deming declares emergency over migrant releases"], "summ2": ["Illegal Immigrant Raped, Impregnated 11-Year-Old Ohio Girl Before Hiding Her in Closet", "Less than 2 in 15 American Voters Aware of Soaring Illegal Immigration", "Lindsey Graham claims the only ones against releasing Russia probe details 'are worried about being exposed'", "Immigrant Advocates Push Fake Humanitarianism at the Border"]}
{"comp": "ER_RC", "month": "Jun", "feats": "bow", "test": 0.6609, "summ1": ["POLL: 30 Percent of Americans Want to Halt ALL Immigration", "BREAKING: Trump Says He Will Delay Deportations of Illegal Aliens For Two Weeks at the Request of Democrats", "California Lawmakers Plan to Give Health Benefits to Illegal Immigrants", "Texas Illegal Immigration Surge Leads to Human Warehousing Problems"], "summ2": ["Asylum seekers: 'Unusual' activity at Christmas Island reported by local resident", "New Mexico sues feds over migrant policy", "Andres Manuel Lopez Obrador, Mexico celebrate deal in Tijuana rally", "Migrant drownings US news: Dad and daughter died in each other's arms"]}
{"comp": "LC_R", "month": "May", "feats": "sbert", "test": 0.6599, "summ1": ["US President Trump calls for asylum seekers to be charged fee", "Asia Bibi arrives in Canada after leaving Pakistan", "Dozens drown as migrant boat capsizes off Tunisia", "Democrats look to block Trump housing proposal that could displace thousands of immigrant families"], "summ2": ["Abortion & CNN Segment: Christine Quinn Says Unborn Babies Aren’t Human Beings", "ICE deported him seven times. Now he's going to prison following an eighth illegal reentry", "Immigrant Advocates Push Fake Humanitarianism at the Border", "Graham pushing to declassify key 'document' on Steele dossier, announces new asylum law package"]}
{"comp": "C_L", "month": "Apr", "feats": "bow", "test": 0.6593, "summ1": ["White House will appeal ruling against returning asylum seekers to Mexico", "Migrants continue to arrive; county's Triage Crisis Center to house migrants", "Ecuador's president says Assange breached terms of London embassy asylum", "Trump visits California-Mexico border, declares 'our country is full'"], "summ2": ["FBI Arrests Leader Of Right-Wing Anti-Immigrant Militia In New Mexico", "White House: We’re not considering busing migrants to “sanctuary cities.” Trump: Yes, we are!", "Attorney General Barr orders immigration judges to deny bail for migrants seeking asylum", "Trump Reportedly Told CBP Chief He Would Pardon Him for Illegally Blocking Asylum Seekers"]}
{"comp": "C_R", "month": "Jul", "feats": "bow", "test": 0.6592, "summ1": ["Trump pushes on with immigration crackdown despite legal hurdles", "US to send asylum seekers back to dangerous part of Mexico", "Judge blocks Trump policy keeping asylum-seekers locked up", "Mass immigration roundups in U.S. to start Sunday: New York Times"], "summ2": ["Ilhan Omar Questions the Patriotism of American-Born Citizens", "Flashback Bill Clinton: 'We Won’t Tolerate Immigration By People Whose First Act Is To Break The Law'", "AOC tweets four-part plan to address the immigration crisis—here's what she proposes", "ICE Tracks Down Illegal Alien Released By Local Authorities After Allegedly Killing 7-Year-Old Boy"]}
{"comp": "ER_R", "month": "Sep", "feats": "bow", "test": 0.6591, "summ1": ["Sanders: ‘I Would Be Positively Disposed to’ Expanding Asylum to Include Climate Refugees", "France: Military-aged Afghan migrant kills 1 and injures 9 during stabbing rampage in Lyon", "Four-Time Deported Illegal Alien with Child Abuse Record Arrested in U.S.", "Supreme Court Hand Democrats Devastating Defeat, Rules That President Trump's Asylum Rules Are In Fact Constitutional ~ illicit info"], "summ2": ["Acting Director of Citizenship and Immigration Ken Cuccinelli Joins the Tennesseee Star Report to Talk About His Recent Regulation Victory on Asylum", "Biden: Illegal immigration is 'part of the reason' for booming US economy", "Federal Judge Reinstates Injunction Against Trump Administration's Asylum Rule", "Eighth Illegal Immigrant Arrested For Rape in Montgomery County, Maryland"]}
{"comp": "L_RC", "month": "Jul", "feats": "bow", "test": 0.659, "summ1": ["Democratic Senators Call Migrant Detention Facility Conditions 'Heart-Wrenching'", "Trump DOJ guts asylum protections for members of families threatened with violence and persecution", "US lost track of 1,500 immigrant children, but says it's not 'legally responsible'", "Guatemalan Family Takes ‘Sanctuary’ in Austin Church — Again"], "summ2": ["Nationwide immigration crackdown planned over weekend", "Illegal Indian immigrant eats ‘once a day’, does ‘odd jobs on Gumtree for cash’", "Little Changes at U.S. Border Amid Confusion Over Trump Asylum Rules Facing Lawsuits", "US to send asylum seekers back to dangerous part of Mexico"]}
{"comp": "LC_R", "month": "Jun", "feats": "bow", "test": 0.6581, "summ1": ["Trump’s “Remain in Mexico” Policy Has Turned Back More Than 10,000 Asylum Seekers", "Transgender asylum seeker from El Salvador held by ICE dies at El Paso hospital", "Trump Claims Latino Voters Want Him To Deport Millions Of Undocumented Immigrants", "Nauru refugees: The island where children have given up on life"], "summ2": ["Nancy Pelosi Says House Will Pass Emergency Funding For Border. But There's One Big Problem.", "CA County Retains Sanctuary Policy Despite Murder Of Woman Allegedly Committed By Illegal Immigrant", "The Biggest Winners of Thursday Night's Dem Debate? Illegal Immigrants.", "Trump: Immigration Raids to Target Those Who 'Broke the Law'"]}
{"comp": "C_RC", "month": "Jun", "feats": "bow", "test": 0.6579, "summ1": ["House passes emergency funding bill for migrant care crisis", "Mexico eyes Brazil for U.S. asylum deal, Trump revives tariff threat", "U.S. ramps up returns of asylum seekers to Mexico, adding Cubans", "O'Rourke to visit Mexico, meet turned away US asylum seekers"], "summ2": ["New Mexico sues feds over migrant policy", "No asylum seekers on Christmas Island despite $185m reopening of detention centre", "Four-day ICE sweep that led to 75 arrests predated Trump’s threat of ‘raids,’ officials say", "Why the first Democratic primary debates are shaping up to be a mess"]}
{"comp": "C_LC", "month": "Sep", "feats": "sbert", "test": 0.6579, "summ1": ["US-El Salvador “cooperative agreement” would send asylum-seekers into harm’s way", "Judge restores nationwide block on Trump administration's asylum ban", "Tent courts set to open on border for U.S. asylum seekers", "Criticism of asylum seeker education restrictions"], "summ2": ["Indonesia raises minimum age for marriages in a bid to end child brides", "If This Isn’t Impeachable, Nothing Is", "Anti-immigrant trend in voter sentiment sparking fear in politicians", "‘This takes away all hope’: Rule bars most applicants for asylum in US"]}
{"comp": "R_RC", "month": "Mar", "feats": "sbert", "test": 0.6575, "summ1": ["Church attacks Home Office for saying Christianity 'not peaceful' to reject asylum seeker", "Nancy Pelosi Kids You Not: Lower Voting Age to 16, She Says!", "How Illegal Immigrant Activity Fuels America's Opioid Crisis", "Brand new apprehension numbers from U.S. Customs and Border Protection confirm border emergency"], "summ2": ["Trump policy that sends asylum seekers back to Mexico is about to be expanded to Texas", "Major taxi scam uncovered as 180 non-EU nationals obtain licences despite having no legal status in Ireland", "‘They’re watching us watch them’", "U.S. objections probably behind delay in granting asylum to Snowden-helping refugees, lawyer charges"]}
{"comp": "L_LC", "month": "Jun", "feats": "sbert", "test": 0.6575, "summ1": ["ICE Kept Migrant Kids In Vans For 39 Hours During Botched Family Reunifications", "A trans woman died in ICE custody on the first day of Pride Month, advocates report", "McConnell sits on 100 bills as the GOP tries to blame Democrats for inaction in Congress", "Hey Donald Trump, this isn’t funny"], "summ2": ["Rathdowney locals call for clarity over asylum accommodation", "Passengers describe drama of turning asylum seeker boats back", "Cramer slams Trump tariffs: He should 'stop beating' Mexico up, 'they haven't done anything'", "Central American migrants plead to seek asylum in U.S., not Mexico"]}
{"comp": "L_R", "month": "Jan", "feats": "sbert", "test": 0.6574, "summ1": ["'My Family Threatens to Kill Me,' Asylum-Seeking Saudi Woman Says After Denouncing Islam", "Fact-checking Trump's immigration speech", "Barr backs Trump on the border wall and government shutdown", "Thousands More Migrant Children in Detention Than Initially Thought According to HHS Report"], "summ2": ["Dems and NeverTrumpers Are 'the Cruelest,' as They Treat Victims of Illegal Immigrant Crime with Scorn", "United Nations rules Saudi teenager is a refugee as Australia considers granting asylum", "EXCLUSIVE: Twice Arrested Illegal Alien Kills Sheriff’s Deputy In DUI", "Activists Jump Nancy Pelosi’s Mansion Wall With Illegal Immigrants, Demand Entry To Her Home"]}
{"comp": "L_R", "month": "Jul", "feats": "sbert", "test": 0.6563, "summ1": ["How to Help Detained Migrant Families", "Watch: Mother of 19-Month-Old Girl Who Died After ICE Detention Testifies on Abject Cruelty of Trump's Anti-Immigrant Agenda", "If left unchecked, Trump will obliterate the right to asylum", "\"It’s a farce\": Legal experts slam new report that justifies Bill Barr’s corrupt defense of Trump"], "summ2": ["Protests erupt outside Phoenix ICE office after arrest of illegal immigrant", "Israel will send 16,000 African asylum seekers to Western countries", "REPORT: DHS Veterans Blast Democrats For Wanting To Decriminalize Illegal Immigration", "Here’s how far from CURRENT law our border debate has shifted"]}
{"comp": "LC_R", "month": "Jan", "feats": "sbert", "test": 0.6542, "summ1": ["Despite Trump's claims, most illegal immigration is not at the southern border", "UN interviews Saudi teen seeking asylum in Thailand", "Saudi Arabia expels Canadian ambassador over criticism of arrests", "U.S. to Start Sending Asylum Seekers to Mexico on Friday"], "summ2": ["Family of Cop Killed by Illegal Alien Shares Trump Had ‘Good Conversation’ Offering Comfort to Widow – USSA News", "Here's a Heartbreaking List of Victims Killed by Illegal Immigrants", "Saudi woman barricaded in Thai hotel while seeking asylum won't be deported", "Why President Donald Trump Will Win The Shutdown"]}
{"comp": "ER_RC", "month": "Apr", "feats": "sbert", "test": 0.6541, "summ1": ["U.S. Struggling with Growing Number of Asylum Seekers", "California Passes ‘Willful Defiance’ Law, Putting Children In Charge", "Trump Offers To Release Detained Illegal Aliens Into Sanctuary Cities, But Democrats Lose Their Minds", "Illegal Immigrant Is Arrested And Faces Deportation Because He Killed 4-Month-Old Boy After Learning He Wasn’t The Dad"], "summ2": ["Wikileaks Co-founder Julian Assange Arrested After Spending 7 Years In Ecuador's Embassy In London", "Trump pushes hard-line asylum policy", "English-language schools shouldn't help facilitate illegal immigration", "Rep. Joyce: Immigrant ‘crisis is real’ at Arizona border"]}
{"comp": "L_R", "month": "Apr", "feats": "bow", "test": 0.6538, "summ1": ["The law or the President: The Trump appointees' dilemma", "Trump's Attorney General Just Moved to Keep Some Asylum-Seekers Detained Indefinitely", "More attacks on asylum-seekers reportedly in the works as Stephen Miller consolidates power", "On The Border, A Right Wing Militia Is Detaining Asylum Seekers At Gun Point"], "summ2": ["Illegal Immigration is Not the New Civil Rights Movement!", "It was MS-13 Trump called 'animals,' not undocumented immigrants", "Shocking: Rio Grande Valley Sector Border Patrol Already Reports More Apprehensions This Year Than All Of Last Year", "Federal Authorities Charge Judge and Court Officer for Aiding Illegal Immigrant in Escape From ICE"]}
{"comp": "LC_R", "month": "Aug", "feats": "bow", "test": 0.6529, "summ1": ["What is political asylum? Q & A", "Trump administration plans rule change that allows indefinite detention for migrants", "Asylum seekers in Maine could face further delays", "Sent back to dangerous border cities, migrants feel like ‘chickens among wolves’"], "summ2": ["Majority of Blacks and Hispanics Support Presidential Candidates Who Are Against Illegal Immigration: Poll", "Senator Graham Passes Legislation to Solve the Border Crisis Before August Recess, Democrats Object", "Democrats Don't Care About Baltimore", "REPORT: Illegal alien rape suspect released from jail, violating detainer policy, ICE says – USSA News"]}
{"comp": "C_RC", "month": "Feb", "feats": "bow", "test": 0.652, "summ1": ["When unaccompanied young asylum seekers turn 18, many face an immigration cliff edge", "US Sending Central American Migrant Minors Back to Mexico", "Stephen Miller calls George W. Bush's immigration record 'astonishing betrayal' of American people", "Australia to reopen Christmas Island detention center after defeat on refugee policy"], "summ2": ["Since 2012 Obama Gave ACORN Replacement $644,000,000—for Illegal Aliens!", "Scott Morrison prime minister pushes back on refugee medical transfer bill news Australia", "ICE agents in North Carolina arrest hundreds of illegal immigrants", "Hungary begins building second portion of its border wall"]}
{"comp": "ER_R", "month": "Jun", "feats": "sbert", "test": 0.6507, "summ1": ["Lefty logic: Wayfair's employees decide to stop shipping beds to migrants in detention centers to ... help them?", "Mexico Proclaims 6,000 National Guardsman Deployment Is Complete", "20 Times Breitbart Reported on Migrant Deaths During Obama-Biden Years and No One Cared", "Obama Judge Invents Sanctuary Courthouses"], "summ2": ["Jeremy Hunt vows to abandon Theresa May's immigration target if he becomes Prime Minister", "Immigration Debate: Trump’s Border Crisis Is Like Obama’s", "Serial killer illegal alien in Texas may be linked to 6 more deaths, says Dallas D.A. – USSA News", "After Trump Delays ICE Raids, Pelosi Celebrates And Makes Another Outrageous Demand"]}
{"comp": "L_R", "month": "Aug", "feats": "bow", "test": 0.6503, "summ1": ["'Outrageous': Lindsey Graham Breaks Senate Rules to Advance Sweeping Anti-Asylum Bill", "Trump's chilling plan punishes children", "Nearly 38,000 vulnerable asylum-seekers have been forced out of the U.S. under illegal policy", "Trump blames everything but his own words for hate in America"], "summ2": ["REPORT: Sixth illegal alien arrested in same county this month for sex crimes – USSA News", "Immigrant advocate, father of 5, killed in crash by illegal alien facing deportation", "ICE chief on Mississippi raids: Parents 'responsible for placing their children in this situation'", "Court ruling upholds Trump asylum restrictions for migrants in some states"]}
{"comp": "C_RC", "month": "Aug", "feats": "bow", "test": 0.6484, "summ1": ["22 AGs Urge Trump Admin. To Withdraw Rule Limiting Asylum", "Migrant kids separated at border faced abuse in foster homes", "US, Mexico Widen Asylum Crackdown to Push Back All Migrants", "House Speaker Pelosi in Central America as Trump Seeks Asylum Deals"], "summ2": ["How more and more Indians are illegally entering the US to seek asylum", "Bisexual asylum-seeker who fears for his life will not be deported", "China lashes Taiwan over offer to Hong Kong protesters", "Fix Syria to solve refugee problem"]}
{"comp": "LC_R", "month": "May", "feats": "bow", "test": 0.6477, "summ1": ["Hungary’s Migrant Abuse Is ‘Matter of Urgency,’ European Agency Finds", "Trump team defends president on Twitter after supporter shouts 'shoot' migrants at border", "UN urges Canada to take more vulnerable Central American migrants from Mexico", "Court Rules Trump Can Keep Sending Asylum Seekers to Mexico While They Await Immigration Hearings"], "summ2": ["Ninth Circuit Court: Trump Administration Can Deport Migrants While They Await Asylum Decision", "Trump Vows 'Harsh Measures' If Dems Don't Close 'Loopholes'", "Mexico dispatches team to DC negotiate tariff solution, as Trump demands illegal immigration remedy", "EXCLUSIVE: Outrage over illegal alien crisis reaches new high; THE TRUTH comes from hard-hitting documentary (includes bonus gift) – USSA News"]}
{"comp": "ER_R", "month": "Aug", "feats": "bow", "test": 0.6468, "summ1": ["Germany To Strip Asylum Status of ‘Refugees’ Who Go Home on Holiday", "US, Mexico widen asylum crackdown to push back all migrants", "Illegal Immigrant Accused of Killing Teenager", "Feds: Mississippi Food Plants 'Willfully' Hired Illegal Aliens Over Americans"], "summ2": ["Senator Graham Passes Legislation to Solve the Border Crisis Before August Recess, Democrats Object", "Court sets asylum rules for CA and AZ that are different from those in TX and NM", "Media fails to report on illegal aliens killing their own family members", "Illegals Who Make A Living Criticizing ICE Are Shocked To Find Themselves Being Deported"]}
{"comp": "LC_R", "month": "Jan", "feats": "bow", "test": 0.6468, "summ1": ["Saudi woman seeking asylum in Australia remains in hotel, despite bid to deport her", "Saudi teen who fled family leaves Thailand for asylum in Canada", "DHS plans to begin turning asylum-seekers back to Mexico to await court dates", "Trump's border wall pledge may be his 'read my lips' moment"], "summ2": ["Illegal Alien Arrested 8 Times Charged With Sickening Crime Against 7-Year-Old Girl", "Illegal Immigrant Previously Deported For Rape Arrested Trying To Illegally Enter The Country Again", "WATCH: 'Angel families' impacted by illegal immigration protest at Nancy Pelosi's office — and she refuses to meet with them", "New migrant caravan crosses into Mexico, President Trump says ‘build wall’"]}
{"comp": "R_RC", "month": "Mar", "feats": "bow", "test": 0.6459999999999999, "summ1": ["Illegal immigrant ordered detained by ICE 9 times arrested for murder of Bambi Larson in San Jose", "DHS secretary defends 'metering' asylum seekers at border: 'We're not turning anybody around'", "State Deputy Gunned Down by Illegal Immigrant, Leaves Behind Wife and Three Children", "SCOTUS gives Pres. Trump victory on immigration, upholds push to detain illegals"], "summ2": ["Trump threatens to shut U.S.-Mexico border after accusing asylum seekers of 'con job'", "Yeah, this looks like a border crisis", "U.S. objections probably behind delay in granting asylum to Snowden-helping refugees, lawyer charges", "Asylum seekers waiting in Mexico seek to stay in US"]}
{"comp": "LC_R", "month": "Apr", "feats": "bow", "test": 0.6457, "summ1": ["FBI arrests member of armed group stopping migrants in New Mexico", "Judge blocks Trump policy forcing asylum-seekers to wait in Mexico", "Assange used Ecuador's embassy for 'spying', says president", "Trudeau defends changes to asylum laws that have refugee workers alarmed"], "summ2": ["Pelosi fumes over White House plan to release immigrant detainees in sanctuary cities", "It’s SIMPLE math! Rep. Dan Crenshaw gets REAL about the crisis at the border and Lefties come un-glitter-glued", "Federal Authorities Charge Judge and Court Officer for Aiding Illegal Immigrant in Escape From ICE", "Previously deported illegal alien arrested on 100 counts of child porn"]}
{"comp": "C_L", "month": "Jul", "feats": "bow", "test": 0.645, "summ1": ["Judge blocks Trump policy keeping asylum-seekers locked up", "Mexico says no to safe third-country asylum discussion with U.S.", "U.S. to send asylum-seekers back to dangerous Mexican border town of Matamoros", "U.S. rights groups ask courts to freeze Trump asylum rule"], "summ2": ["Nurses Redouble Commitment to Provide Critical Medical Aid to Migrants and Asylum Seekers as Details Emerge of Inhumane and Brutal Conditions in Federal Detention", "As Asylum Ban Takes Effect, Rights Groups Sue Trump Over Effort to 'Inflict Maximal Cruelty on Vulnerable People'", "Here's What You Should Know About Upcoming ICE Raids", "Donald Trump has been making disturbing comments about young girls for years"]}
{"comp": "L_R", "month": "May", "feats": "sbert", "test": 0.6437, "summ1": ["New Trump immigration overhaul will force asylum seekers to pay a fee", "Trump to unveil new ‘patriotic assimilation’ immigration plan after canceling plans to attend Statue of Liberty museum opening", "READ: ICE Deputy Director Says of DNA Testing: ‘This is a Pilot Designed to Assess the Usefulness of this Technology in an Investigative Process’", "How U.S. Guns Sold to Mexico End Up With Security Forces Accused of Crime and Human Rights Abuses"], "summ2": ["CBP Caring for 8,000 Illegals in Rio Grande Sector; $18M Drug Seizure Announced", "£1m a week in child benefit paid to children living overseas", "Appeals Court Rules Trump Can Send Asylum Seekers To Mexico", "Rep. Ilhan Omar Goes on Anti-Semitic Twitter Rampage; Advocacy Group Demands Apology"]}
{"comp": "L_R", "month": "Feb", "feats": "bow", "test": 0.6435, "summ1": ["U.S. border violence stalks Tijuana every day", "ICE confirms asylum seekers on hunger strike over abusive conditions are being forced-fed", "Here’s how the Saudi press has been smearing the teen who fled her family", "Trump tries to recover some momentum with a bunch of freshly baked lies after emerging from his White House cocoon"], "summ2": ["3-time deported illegal immigrant protected by Cali’s sanctuary laws fatally shot after opening fire on county cop", "Border Patrol chief warns of 'dangerous new trend' in illegal immigration", "Democrats move to block Trump's emergency border wall", "Illegal immigrant ex-boyfriend arrested in death of New York woman found stuffed in suitcase, report says"]}
{"comp": "C_LC", "month": "Sep", "feats": "bow", "test": 0.6429, "summ1": ["U.S. judge restores nationwide block on Trump administration's asylum ban", "Aid budget raided to pay for refugees", "Tent Courts Set to Open on Border for US Asylum Seekers", "US Supreme Court permits Trump's asylum restrictions"], "summ2": ["Trump's Asylum Policies Sent Him Back to Mexico. He Was Kidnapped Five Hours Later By a Cartel.", "Tamil asylum seeker family from Biloela 'terrified' for children after move to Christmas Island", "Supreme Court rules for Trump on asylum ban at southern border", "Former Pakistan legislator from Imran Khan’s party seeks asylum in India"]}
{"comp": "L_R", "month": "May", "feats": "bow", "test": 0.6425, "summ1": ["Trump’s cruel new policy would effectively bar Central American refugees from seeking asylum", "The dangers of the government's DNA testing program", "Ten trans asylum-seekers win cases, are freed from detention: 'I’m heading to my new life'", "Officials just sounded the alarm as Trump launches diabolical plan to use migrants to punish Democrats"], "summ2": ["Illegal Immigrant Accused Of 12 Murders In Texas Had Been Arrested Several Times Before, But Never Deported", "Appeals Court Rules Trump Can Send Asylum Seekers To Mexico", "Trump Vows 'Harsh Measures' If Dems Don't Close 'Loopholes'", "EXCLUSIVE: Outrage over illegal alien crisis reaches new high; THE TRUTH comes from hard-hitting documentary (includes bonus gift) – USSA News"]}
{"comp": "L_R", "month": "Jun", "feats": "bow", "test": 0.6421, "summ1": ["The class war on migrant children", "A trans woman died in ICE custody on the first day of Pride Month, advocates report", "Mexico, U.S. business groups urge Trump to back down on tariff threat", "Julián Castro’s Plan for Fixing Our Immigration System Is As Radical As It Is Excellent"], "summ2": ["Nancy Pelosi Says House Will Pass Emergency Funding For Border. But There's One Big Problem.", "Father of five, 59, jailed for 20 years for murdering wife", "Surprise! Illegals Aren’t Showing for Asylum Hearings", "ICE arrests 52 Illegal Aliens in South, Central Texas Enforcement Surge"]}
{"comp": "ER_R", "month": "Jan", "feats": "sbert", "test": 0.6415, "summ1": ["Illegal Alien Accused of Aiding Alleged Cop Killer was Deported Twice", "Guyanese Immigrant Went On Fire-Bombing Spree In New York", "Secure Borders Protect Immigrant Communities", "Progressives Denounce Trump's 'UAC' Asylum Reform"], "summ2": ["Here's a Heartbreaking List of Victims Killed by Illegal Immigrants", "Saudi woman barricaded in Thai hotel while seeking asylum won't be deported", "Illegal immigrant arrested for starting wildfires in Colorado", "Why President Donald Trump Will Win The Shutdown"]}
{"comp": "C_RC", "month": "Jul", "feats": "bow", "test": 0.6406, "summ1": ["Trump administration sets new rule to make it harder for immigrants to seek asylum", "No 'day in court': U.S. deportation orders blindside some families", "Judge blocks Trump policy keeping asylum-seekers locked up", "US, Mexico Set Talks Amid Tension over New Curbs on Asylum-seekers"], "summ2": ["Little Change at U.S. Border Amid Confusion Over Trump Asylum Rules Facing Lawsuits", "ICE Begins Rounding Up Illegal Aliens for Deportation", "Decapitated MS-13 victim stabbed 100 times, heart ripped out of chest", "Let Them Work"]}
{"comp": "C_R", "month": "May", "feats": "bow", "test": 0.6402, "summ1": ["More Asylum Seekers Sue Trump Administration Over Prolonged U.S. Detention", "Appeals court: Trump can make asylum seekers wait in Mexico", "Mexico president says illegal immigration to U.S. 'not up to us'", "Dozens of border patrol agents will soon be screening asylum cases"], "summ2": ["Ninth Circuit Court: Trump Administration Can Deport Migrants While They Await Asylum Decision", "BREAKING: Trump Takes MAJOR Action Against Mexico To Stop Illegal Immigration", "EXCLUSIVE: Outrage over illegal alien crisis reaches new high; THE TRUTH comes from hard-hitting documentary (includes bonus gift) – USSA News", "Top sheriff warns: Trump’s ‘done’ if illegal immigration isn’t slashed"]}
{"comp": "LC_RC", "month": "Jun", "feats": "sbert", "test": 0.6386, "summ1": ["Beto O'Rourke and other Democrats urge public to keep Tornillo migrant facility in spotlight", "At US-Mexico border, migrants from Africa, Haiti wait to seek asylum", "Peter Dutton says he does not know if refugees charged with serious crimes brought to Australia under medevac bill", "NJ Mother Knocked Out in Possible Hate Attack After Picking Up Son From School Where He’s Told ‘Go Back to Mexico’"], "summ2": ["Trump’s Mexico Tariffs Are Forever", "U.S. churches, some immigration officers denounce sending asylum seekers to Mexico", "Insiders: Peter Dutton grilled over medivac bill", "AOC-backed candidate Tiffany Cabán declares victory in tightly contested Queens DA race"]}
{"comp": "LC_RC", "month": "Mar", "feats": "bow", "test": 0.6384, "summ1": ["In McAllen, Volunteers From Near and Far Provide Aid to Asylum-Seeking Families – Texas Monthly", "‘In Syria I used to hate school but here it’s really different", "US asylum policy endangers migrants' lives, groups say", "Undocumented immigrant says he worked at property co-owned by Trump sons"], "summ2": ["Federal government to spend $400K compensating residents of rural Quebec road for asylum seeker disruption", "Trump Threatens to Close Border If Mexico Doesn’t Stop Illegal Entries", "New US asylum policy dealt setback in immigration court", "U.S. objections likely behind delay in granting asylum to Snowden-helping refugees, lawyer charges"]}
{"comp": "L_LC", "month": "May", "feats": "bow", "test": 0.6382, "summ1": ["Trump Reportedly Dreaming Up Even More Ways to Shut Immigrants Out", "The dangers of the government's DNA testing program", "Ten trans asylum-seekers win cases, are freed from detention: 'I’m heading to my new life'", "President Trump To Release Migrants Into Heavily Democratic South Florida Area"], "summ2": ["Five ways Trump's moves to stem asylum seekers have hit hurdles", "Africans, Cubans pack Mexican shelters, hoping for a shot at asylum", "Scheer vows to end 'illegal' border crossings as part of immigration policy plan", "Tommy Robinson faces new contempt case"]}
{"comp": "ER_L", "month": "Apr", "feats": "bow", "test": 0.6374, "summ1": ["Illegal Alien Sentenced to 25 Years in Prison for Raping 12-Year-Old Girl", "Lines Have Been Drawn On Illegal and Legal Immigration For 2020! Which Will You Choose?", "President Trump Supports Using Sanctuary Cities to Centralize Housing for Illegal Aliens – (Transcript)…", "More ‘Asylum Seekers’ Going Back To Native Countries for ‘Holidays’"], "summ2": ["Judge tells Trump to stop sending Central American asylum seekers back to Mexico", "Attorney General Barr just handed ICE more power to keep asylum seekers in detention", "Armed white nationalist militias are now coordinating with U.S. Border Patrol to 'detain' migrants", "On Special Report, Fox's Marc Thiessen calls Trump's possibly illegal plan to transport migrants to sanctuary cities \"pure genius\""]}
{"comp": "L_LC", "month": "Apr", "feats": "bow", "test": 0.6362, "summ1": ["Attorney General Barr just handed ICE more power to keep asylum seekers in detention", "Trump escalates attack against asylum-seekers from Central America", "Trump Crime Spree Grows As He Told DHS Head That He Would Pardon Him If He Broke Immigration Laws", "Armed white nationalist militias are now coordinating with U.S. Border Patrol to 'detain' migrants"], "summ2": ["Ecuador's president says Assange tried to use its embassy to spy", "Immigration System At The 'Breaking Point,' Homeland Security Official Warns", "Judge blocks Trump administration's policy of returning asylum seekers to Mexico while they wait for court hearings", "Cory Booker Says Trump Relocating Migrants To Sanctuary Cities Would Make America ‘Less Safe’"]}
{"comp": "C_RC", "month": "May", "feats": "sbert", "test": 0.6359, "summ1": ["Five ways Trump's moves to stem asylum seekers have hit hurdles", "CDT Leads Coalition of Over 100 Organizations Opposing DHS Surveillance of Activists, Journalists, and Lawyers", "Mexico worries as US keeps making asylum seekers wait there", "As Europe closes its borders, Wales becomes a 'nation of sanctuary'"], "summ2": ["’Not acceptable': Audits of federal government's performance cancelled due to insufficient funding, AG tells committee", "Editorial: Asylum crisis can’t be fixed by putting up more barriers", "Woman raises thousands in a week for young asylum seekers' safe houses", "Lutheran student pastor, husband deported to Colombia weeks after ICE raid at their Chicago home"]}
{"comp": "L_LC", "month": "Mar", "feats": "bow", "test": 0.6355, "summ1": ["Trump Threatens to Close Border Next Week 'If Mexico Doesn't Immediately Stop All Illegal Immigration'", "Nielsen claims asylum seekers are not being turned away at ports of entry", "Federal judge says thousands more could be included in lawsuit over family separations", "Donald Trump Openly Mocks Asylum Seekers Fleeing Violence"], "summ2": ["Asylum seekers say they fear return to Mexico under new US policy", "Australia to send asylum seekers to remote island for treatment", "Brexit: Theresa May ponders fourth bid to pass deal", "Official: Border situation is at the ‘breaking point’"]}
{"comp": "C_LC", "month": "Feb", "feats": "bow", "test": 0.6347, "summ1": ["New caravan of up to 2,000 migrants seeks to cross border into Texas", "Fact check: What is the national emergency? Do we need a wall?", "Pentagon sending 3,750 extra U.S. forces to border with Mexico", "Thailand to investigate disappearance of Vietnamese asylum-seeker"], "summ2": ["“If the Police Aren’t Safe Here, What About Us?” Asylum Seekers Fear “Remain in Mexico” Policy", "2019 Presidents Day Protests Against Trump's Wall Are About To Happen Nationwide", "Coast Guard officer wanted to kill Democrats, TV hosts, say prosecutors", "Australia announces reopening of offshore detention center"]}
{"comp": "C_R", "month": "Feb", "feats": "bow", "test": 0.6342, "summ1": ["When unaccompanied young asylum seekers turn 18, many face an immigration cliff edge", "Australia has moved on from Tampa, Bill Shorten says", "U.S. sends first Central American asylum seeker to Mexico under new policy", "H.R.3884 - 94th Congress (1975-1976): National Emergencies Act"], "summ2": ["The Argument Against Illegal Immigration No One Wants to Make", "REPORT: Previously deported illegal alien convicted of child sex abuse busted again in Texas – USSA News", "Dozens of pro-Trump supporters form 'human wall' along US border with Mexico", "The Washington Times: “ICE, Shut Out of Border Talks, Warns Democrats’ Plans Would Free Thousands of Criminals”"]}
{"comp": "ER_RC", "month": "Apr", "feats": "bow", "test": 0.6339, "summ1": ["Trump: Change the Laws or We're Putting More Illegals in Sanctuary Cities", "Mexico: 300,000 Migrants Came Through Country First 3 Months of 2019", "Massachusetts Judge Charged With Helping Illegal Immigrant Evade ICE", "Trump’s DHS Releases 12,500 Illegal Aliens into U.S. in One Week"], "summ2": ["WikiLeaks Founder Julian Assange Arrested by British Police", "Ottawa’s tougher line on asylum seekers no cause for alarm: head of UN refugee agency in Canada", "Trump's return policy for asylum seekers blocked by US judge", "Trump tears into ‘Radical Left’ for opposing sanctuary city proposal"]}
{"comp": "LC_RC", "month": "Sep", "feats": "sbert", "test": 0.6338, "summ1": ["Wife of former Marine to be deported to Mexico Friday, after 20 years in U.S.", "Noel Grealish’s views of asylum seekers are based on myth", "Transforming the EU's response to forced displacement", "‘This takes away all hope’: Rule bars most applicants for asylum in US"], "summ2": ["Company that runs immigration detention centers is top donor for three Texas congressmen", "Tamil asylum seekers: Melbourne rally, Di Natale slams Dutton over deportation attempt", "Hindus, Sikhs tortured in Pakistan, says ex-PTI MLA; seeks asylum in India", "Supreme Court Allows Trump Asylum Restrictions to Take Effect"]}
{"comp": "LC_RC", "month": "Jun", "feats": "bow", "test": 0.6329, "summ1": ["Trump delays ICE raids and gives lawmakers two weeks to 'work out solution' on asylum laws", "Mozambique: End five-month arbitrary detention of refugees and asylum seekers", "Record number of African migrants coming to Mexican border", "Central American migrants plead to seek asylum in U.S., not Mexico"], "summ2": ["Activists concerned Metro Detroit will be target in immigration raids", "Migrant drownings US news: Dad and daughter died in each other's arms", "Judge Shelley Joseph wants her $184,000-plus pay reinstated", "Dutton in Colombo to head off asylum boats"]}
{"comp": "L_R", "month": "Jul", "feats": "bow", "test": 0.6326, "summ1": ["Yes, Obama deported more people than Trump but context is everything", "Judge Blocks Trump Policy Keeping Asylum-Seekers Locked Up", "DOJ Guts Asylum Protections for Members of Families Threatened With Violence", "The U.S. Is Quietly Opening Detention Camps for Small Children"], "summ2": ["The Department of Justice and Department of Homeland Security Issue Third Country Asylum Rule", "Man arrested for murdering mother and her two kids is ILLEGAL alien and was already deported…TWICE", "Afghan asylum seeker 'was fuelled by desire to kill English people'", "Mexico Says Immigration Through Its Country Down Nearly 40%"]}
{"comp": "LC_RC", "month": "Apr", "feats": "sbert", "test": 0.6325, "summ1": ["Federal judge blocks Trump administration program forcing asylum seekers to remain in Mexico while awaiting court hearings", "If Your Country Were Committing War Crimes Would You Want to Know?", "'We’ve never seen anything like this': As Trump threatens to close border, migrants overwhelm Texas cities", "Trump told border agents to break the law but bosses told them to ignore him, report claims"], "summ2": ["Buchanan: Already deep in the politics of hate", "Criminal Illegal Immigration Drops 75 Percent", "Trump is looking to give sanctuary cities just what they asked for", "Julian Assange: Embassy ‘spread lies’ about WikiLeaks founder"]}
{"comp": "ER_R", "month": "Jan", "feats": "bow", "test": 0.6317, "summ1": ["Reformers Worry Trump Deal will Encourage More Illegal Immigration", "U.S. to Start Returning Asylum Seekers to Mexico on Friday", "Previously Deported Illegal Immigrant Arrested For Sexual Assault Of 11-Year-Old", "Nancy Pelosi’s Heart Sinks When Her Office Congressional Office Is Raided By Throng Of Victims of Illegal Immigration"], "summ2": ["During Trump Visit to Border, Slain Officers' Families Call for Border Wall", "Trump's Golf Course Fires 12 Illegal Immigrants, So Their Lawyer Demands 'Full Investigation'", "Coming to Canada 'worth the risk,' says Saudi teen refugee", "Dept. of Homeland Security sends first Central American asylum seeker to wait in Mexico"]}
{"comp": "C_LC", "month": "Aug", "feats": "bow", "test": 0.6307, "summ1": ["Trump rule restricting asylum seekers struck down by court", "How US Government's 'Remain in Mexico' Plan Unfurled Into Confusion", "Pausing Asylum Interviews Would Harm 40K, Mass. Dems Say", "US House Speaker Pelosi in Central America as Trump seeks asylum deals"], "summ2": ["Trump administration to roll out plan for longer-term detention of migrant families", "Deportation of Tamil asylum seeker family interrupted midair by last-minute injunction", "Concern over rise in people seeking asylum from ‘safe’ countries", "Asylum Officers Are Being Used As An Immigration Deterrent, Tjersland says"]}
{"comp": "LC_R", "month": "Feb", "feats": "bow", "test": 0.6299, "summ1": ["Central Americans seeking path to US have few legal options", "Rights groups sue Trump admin for making asylum-seekers wait in Mexico", "Syrians held in Germany for suspected crimes against humanity", "Australia announces reopening of offshore detention center"], "summ2": ["BREAKING: Trump Administration Has Sent First Asylum-Seeking Families Back To Mexico", "WSJ Columnist Takes Little 'Socialist That Could' Ocasio-Cortez To The Woodshed Over Her Moronic New Green Deal", "Illegal immigrant ex-boyfriend arrested in death of New York woman found stuffed in suitcase, report says", "ICE: Democratic Party Efforts To Restrict Beds Will Lead To Release Of Criminal Illegal Immigrants"]}
{"comp": "C_RC", "month": "Jun", "feats": "sbert", "test": 0.6299, "summ1": ["Immigration shapes the politics of California and Texas", "Threats of ICE sweep – sooner or later – have Southern California immigrant community on edge", "Trump says US will begin deporting millions", "Central American migrants plead to seek asylum in U.S., not Mexico"], "summ2": ["Trump’s Mexican-tariff move was a true victory", "U.S. churches, some immigration officers denounce sending asylum seekers to Mexico", "Insiders: Peter Dutton grilled over medivac bill", "Constable: After her film about Venezuela, woman seeks asylum in Bartlett"]}
{"comp": "LC_RC", "month": "Aug", "feats": "bow", "test": 0.6299, "summ1": ["Malaysia says Turkish asylum seeker deported on police advice", "Another Needless Death in US Immigration Detention", "Channel migrants: Children among 61 people to arrive by boat", "Trump Asks Supreme Court to Allow Full Enforcement of Asylum Crackdown"], "summ2": ["US, Mexico widen asylum crackdown to push back all migrants", "India rejects asylum to former Maldives vice president fleeing his country's police after embezzlement of state funds", "China lashes Taiwan over offer to Hong Kong protesters", "EDITORIAL: Uncovered: The high cost of illegal immigration in Nevada"]}
{"comp": "L_RC", "month": "Mar", "feats": "bow", "test": 0.6298, "summ1": ["DHS Secretary Nielsen defends the administration's immigration policies in contentious hearing", "Republicans Are Denying Trump’s Completely Open Bigotry Against Muslims", "Local Immigrant Rights Advocate Stops ICE Agents", "Donald Trump Openly Mocks Asylum Seekers Fleeing Violence"], "summ2": ["Federal government to spend $400K compensating residents of rural Quebec road for asylum seeker disruption", "New US asylum policy dealt setback in immigration court", "US struggling with growing number of asylum seekers", "Trump threatens to close border with Mexico next week"]}
{"comp": "C_LC", "month": "Jun", "feats": "sbert", "test": 0.6296, "summ1": ["U.S. tariff threat backs Mexican president into corner, facing Trump", "‘We Build The Wall’ Leader Accuses Official of Overreach for Ordering Gate to Be Kept Open Indefinitely", "Half of federal arrests are immigration-related", "Central American migrants plead to seek asylum in U.S., not Mexico"], "summ2": ["Nearly 900 migrants found at Texas facility with 125-person capacity: DHS watchdog", "To all parents who can picture themselves in Valeria and her dad | Debbie Weingarten", "Morning Bits: Trump reliably does exactly the wrong thing", "HIV-positive South Africans seek asylum in Canada"]}
{"comp": "LC_RC", "month": "Jan", "feats": "bow", "test": 0.6257, "summ1": ["Rahaf al-Qunun: Saudi woman pleads for asylum", "DHS plans to begin turning asylum seekers back to Mexico to await court dates", "Fact check: Trump says his border wall is under construction. It's not.", "Indonesia: Children Seeking Refuge Find Abuse, Neglect"], "summ2": ["Saudi woman seeking asylum barricades herself in Thailand", "Saudi asylum seeker Rahaf granted asylum in Canada", "Trump demands $5.7 bln for steel barrier on US-Mexico border", "Scott Morrison seizes on asylum boat bust"]}
{"comp": "R_RC", "month": "May", "feats": "bow", "test": 0.6252, "summ1": ["DHS Chief: 80,000 Migrants in Custody as Illegal Crossings Spike", "Mexican President Responds to Trump’s Tariff on Mexican Goods to Curb Illegal Immigration", "Illegal Immigrant Arrested After Impregnating His 11 Year Old ‘Girlfriend’", "SHOCK: Ninth Circuit Approves Trump Admin's 'Wait In Mexico' Asylum Policy"], "summ2": ["Failed Immigration Policy Sustains a Lawless Cartel Empire", "US to hit Mexico with tariffs over ‘illegal migrants’", "AP Exclusive: Ex-Interpol chief's wife gets asylum in France", "Scheer vows to end 'illegal' border crossings as part of immigration policy plan"]}
{"comp": "R_RC", "month": "Jul", "feats": "sbert", "test": 0.625, "summ1": ["CNN’s Fareed Zakaria Makes Surprising Comments About Trump’s Remarks On Asylum", "Protests erupt outside Phoenix ICE office after arrest of illegal immigrant", "68 Percent of White Evangelicals Believe the U.S. Has No Responsibility to Accept Refugees, Pew Study Finds", "REPORT: DHS Veterans Blast Democrats For Wanting To Decriminalize Illegal Immigration"], "summ2": ["Central American newspapers encouraging illegal immigration", "Federal government quietly ends asylum seeker triage pilot program", "Buckets of heads & penises, ‘Frankenstein’ corpses found in FBI raid on horror body donation center", "White House moves to block asylum for migrants crossing Mexico"]}
{"comp": "C_R", "month": "Jun", "feats": "bow", "test": 0.624, "summ1": ["U.S. plan to make Guatemala take asylum seekers called ludicrous by rights group", "Mexico says U.S. migration deal could draw in other Latam countries", "Homeland Security official describes widespread 'fraudulent' families at border", "Were More People Deported Under the Obama Administration Than Any Other?"], "summ2": ["Nancy Pelosi Says House Will Pass Emergency Funding For Border. But There's One Big Problem.", "Illegal Immigrant Who Murdered Elderly Woman With Fire Extinguisher Gets 22 Years in Jail", "Trump: Immigration Raids to Target Those Who 'Broke the Law'", "Father of Man Killed By Illegal Immigrant Slams Ocasio Cortez for Concentration Camp Comments"]}
{"comp": "LC_R", "month": "Jul", "feats": "bow", "test": 0.624, "summ1": ["Portland officials scramble as asylum seekers refuse housing offers outside city", "Fear, Confusion And Separation As Trump Administration Sends Migrants Back To Mexico", "U.N. human rights chief \"deeply shocked\" by border processing center conditions in Texas", "Judge blocks Trump policy keeping asylum-seekers locked up"], "summ2": ["Assailing Trump Won't Abate Border Crisis", "Flashback Bill Clinton: 'We Won’t Tolerate Immigration By People Whose First Act Is To Break The Law'", "Attorney General William Barr Puts Additional Limits on Asylum Claims", "Central American migrants are giving up on asylum because of this Trump policy — and going home"]}
{"comp": "C_RC", "month": "Apr", "feats": "bow", "test": 0.6204, "summ1": ["Trump administration seeks emergency court order to continue asylum policy", "An inside look at how the IRC is helping asylum seekers in the U.S.", "Trump proposal for 'sanctuary cities' infuriates Dems", "Ecuador's President: Assange Breached Terms of London Embassy Asylum"], "summ2": ["'Our country is full': Trump says migrants straining system after border visit", "Wikileaks founder Julian Assange arrested by London police after Ecuador withdraws asylum", "McHenry County, Illinois makes $10 million detaining illegal immigrants in 2018", "Peduto: Sending immigrant detainees to Pittsburgh not a punishment"]}
{"comp": "LC_RC", "month": "Apr", "feats": "bow", "test": 0.6199, "summ1": ["Julian Assange arrested in London: UK Police", "Militia in New Mexico detains migrant asylum-seekers at gunpoint", "White House considered dumping migrants in 'sanctuary cities'", "Judge blocks Trump policy forcing asylum-seekers to wait in Mexico"], "summ2": ["'Our country is full': Trump says migrants straining system after border visit", "Wikileaks founder Julian Assange arrested by London police after Ecuador withdraws asylum", "Ottawa’s tougher line on asylum seekers no cause for alarm: head of UN refugee agency in Canada", "State House passes bill to strengthen sanctuary status for illegal immigrants"]}
{"comp": "ER_R", "month": "Aug", "feats": "sbert", "test": 0.6179, "summ1": ["Beto O’Rourke: ‘Never Forget’ Trump’s ‘Role’ in El Paso Shooting", "Germany: Samurai Sword Killing Migrant Was Fake Refugee", "TIME Mag: Koch Brothers Helping Illegal Immigrants Get Driver’s Licenses", "Trump Cracked Down On Illegals — Now A Mass Exodus Is Beginning – The Bearded Patriot"], "summ2": ["ACLU Sues Over Trump’s Fast-Tracked Deportations Policy", "'David Koch is gone. It's a celebration': Liberal activists exult over death of billionaire conservative philanthropist", "Sixth Illegal Immigrant Arrested On Sexual Offense Charges In Maryland County In Less Than A Month", "Maine Homeless Left in Cold as Officials Scramble to House ‘Asylum Seekers’"]}
{"comp": "C_RC", "month": "Jul", "feats": "sbert", "test": 0.6174, "summ1": ["U.S. Moves Stop Granting Asylum to Migrants Threatened Because of Family Ties", "Is there a crisis at the US-Mexico border? 6 essential reads", "Trump administration sets new rule to make it harder for immigrants to seek asylum", "ACLU: Border agents physically abused migrant children"], "summ2": ["Desperate Jared Fogle calls on Trump in latest bid to get out of prison", "CAIR New Trump Rule Blocking Asylum Seekers is Part of White Supremacist Agenda", "Here’s What’ll Happen to the Economy if We Deport Undocumented Immigrants", "Mary Robinson says she 'respects privacy' of wife of Dubai sheikh who has fled to Germany"]}
{"comp": "ER_R", "month": "Feb", "feats": "bow", "test": 0.617, "summ1": ["In Memoriam: 12 Americans Allegedly Killed by Illegal Aliens in 2018", "Sweden Admits It Cannot Control Its Own Borders", "Democrats Offer Plan to Release All Child Traffickers at Border into U.S.", "Illegal Immigrant Arrested for Raping Child in Kentucky"], "summ2": ["Trump administration sued over shift in asylum policy", "Democrats move to block Trump's emergency border wall", "Sheriffs Warn ICE Could Be Forced To Release 8,300 Criminal Aliens", "Illegal immigrant ex-boyfriend arrested in death of New York woman found stuffed in suitcase, report says"]}
{"comp": "R_RC", "month": "Apr", "feats": "sbert", "test": 0.6155, "summ1": ["38k American veterans still homeless, but sanctuary cities want to take care of illegal immigrants", "ICE speaks out after nanny rape-murder suspect is twice deported illegal immigrant and New Jersey offered ‘limited cooperation’", "William Barr Asylum Rule: Common-Sense Border Enforcement", "Old clip of Trump calling MS-13 animals gets edited and recirculated as new, and look who fell for it …"], "summ2": ["WikiLeaks Founder Julian Assange Arrested by British Police", "Facing the hardest facts on illegal immigration", "Mom of boy killed by unlicensed driver demands justice", "Trump pushes hard-line asylum policy"]}
{"comp": "L_R", "month": "Jan", "feats": "bow", "test": 0.6131, "summ1": ["Here’s the offer Trump is making to Democrats to end the shutdown", "Trump's Immigration Address Was An Epic Failure", "Saudi teen refugee arrives safely in Canada after dramatic asylum plea", "Trump administration’s ‘Remain in Mexico’ policy threatens the lives of Central American migrants"], "summ2": ["Authorities capture illegal immigrant fugitive wanted in the murder of California police officer", "Saudi teenage girl, 18, touches down in Toronto wearing CANADA hoodie after fleeing family", "Why Democrats Allow Illegal Aliens to Enter America", "U.S. sends first Central American asylum seeker to Mexico under new policy"]}
{"comp": "C_L", "month": "Feb", "feats": "bow", "test": 0.6125, "summ1": ["Australia’s government stirs up hysteria about illegal immigration", "Fact check: What is the national emergency? Do we need a wall?", "Amnesty International: U.S. returns migrants to 'chaos' in Tijuana", "Ontario police free 43 from 'modern day slavery'"], "summ2": ["ICE Used Taxpayer Money to Pay Private Prisons $800 Million to Detain Migrants in 2018: Report", "Latino Gangsters Tried to Firebomb Blacks Out of Eastside Neighborhood, Feds Say", "Trump Supporters Form Human Chain at Mexican Border Chanting 'Build a Wall' Before El Paso Rally", "The fate of reproductive rights in the U.S. will be decided by five men this Thursday"]}
{"comp": "LC_RC", "month": "Aug", "feats": "sbert", "test": 0.6124, "summ1": ["Another federal judge rules against Trump asylum policy", "Tamil family's deportation from Australia halted mid-air", "Dirty Water, Spoiled Food: Report Details Conditions for Asylum-Seekers in Detention", "Boris Johnson wants EU to rewrite 'undemocratic' Brexit divorce deal"], "summ2": ["Tamil family sent to Christmas Island as HometoBilo support rises", "Lou Dobbs Slams WH Staff: \"I Really Don't Know Who The Hell Is Advising This President, Is It Mulvaney?\"", "A Honduran church leader won asylum in the U.S. after waiting in Mexico for a judge to decide his case. He's still not free.", "EDITORIAL: The high cost of illegal immigration in Nevada uncovered"]}
{"comp": "R_RC", "month": "Jun", "feats": "bow", "test": 0.6114, "summ1": ["President Trump Delaying Planned ICE Deportations for 2 Weeks", "Pelosi under pressure after Senate passes bipartisan border funding bill", "ROGERS: Trump’s Mexico Tariffs Place The Border Crisis Burden Where It Belongs", "Flashback: Obama HHS Placed Migrant Children Into Custody Of Human Traffickers"], "summ2": ["Asylum seekers: 'Unusual' activity at Christmas Island reported by local resident", "Trump’s Mexican-tariff move was a true victory", "NM files lawsuit against feds over migrant policy", "Heartbreaking Picture Of Drowned Father-Daughter At US-Mexico Border Is Reminding People Of Aylan Kurdi"]}
{"comp": "L_LC", "month": "Sep", "feats": "bow", "test": 0.6113, "summ1": ["'Unconscionable': Asylum-Seekers In Texas Detention Center Report Being Denied Cancer and Mental Health Treatment", "Warnings That 'Lives Will Be Lost' After Right-Wing Supreme Court Allows Trump Asylum Ban to Take Effect", "It’s official: Trump’s wall is a flop and even Fox News now calls his big campaign promise a mistake", "7 Million People Displaced by Extreme Weather in First Half of 2019"], "summ2": ["Tent courts open as latest hurdle for migrants seeking asylum in the U.S.", "Tamil asylum seeker family from Biloela 'terrified' for children after move to Christmas Island", "Former Pakistan legislator from Imran Khan’s party seeks asylum in India", "Trump administration ready to deport, turn back more asylum seekers after Supreme Court ruling"]}
{"comp": "ER_R", "month": "Jun", "feats": "bow", "test": 0.6108, "summ1": ["D.C. Region Makes ‘Sanctuary Congregations’ to Shield Illegal Migrants", "DHS Frees 5.5K Illegals into U.S. in a Week; 196K Released in 5 Months", "The Political Insider", "20 Times Breitbart Reported on Migrant Deaths During Obama-Biden Years and No One Cared"], "summ2": ["Nancy Pelosi Says House Will Pass Emergency Funding For Border. But There's One Big Problem.", "'Sick and tired of the deaf ears': Mayor of border town overrun by illegal immigrants blasts federal government", "Trump: Immigration Raids to Target Those Who 'Broke the Law'", "Father of Man Killed By Illegal Immigrant Slams Ocasio Cortez for Concentration Camp Comments"]}
{"comp": "R_RC", "month": "Apr", "feats": "bow", "test": 0.6091, "summ1": ["Trump says illegal immigrants will be bussed to sanctuary cities", "Judge Blocks Trump Administration's Asylum Policy. Here's Why.", "Charges Dropped Against UofA Students Who Stalked, Harassed Border Patrol Agents", "William Barr declares that asylum seekers who enter the US illegally do not have to be released if they post bond"], "summ2": ["Wikileaks Co-founder Julian Assange Arrested After Spending 7 Years In Ecuador's Embassy In London", "'Our country is full': Trump says migrants straining system after border visit", "Trump's return policy for asylum seekers blocked by US judge", "Ottawa’s tougher line on asylum seekers no cause for alarm: head of UN refugee agency in Canada"]}
{"comp": "ER_R", "month": "Jul", "feats": "bow", "test": 0.6084, "summ1": ["Illegal Alien in Sanctuary City Charged with Sexually Assaulting 6-Year-Old", "Tommy Robinson asks President Trump for help: ‘grant me and my family political asylum’", "Report: Democratic Congresswoman Allegedly Sending Staff Into Mexico to Train Asylum Seekers", "SQUAD REJECTED: House Overwhelmingly Shoots Down Omar’s Anti-Israeli Legislation"], "summ2": ["Booker 'personally accompanied' asylum seekers across the border", "NYT: Feds Must Force Middle-Class Americans To Sacrifice Suburbs for Immigrant Housing", "DOJ moves to limit asylum claims based on family relationships", "The Impending ICE Raids: Legal, Necessary, and Bound to Misrepresented by the Left"]}
{"comp": "L_LC", "month": "Jun", "feats": "bow", "test": 0.6067, "summ1": ["Trump took to Twitter to announce that he's postponing ICE's deportation raids in 10 major cities", "How Trump’s Tariff Threat Could Outsource the Asylum Crisis to Mexico", "'This Is Sick': Horror as Trump Administration Plans to Detain Migrant Children at Former Japanese Internment Camp", "A trans woman died in ICE custody on the first day of Pride Month, advocates report – ThinkProgress"], "summ2": ["Record 70.8 Million People Displaced At End Of 2018, Says United Nations", "Trump Delays Immigration Raids, Giving Democrats 'Two Weeks' To Reform Asylum Laws", "A Look Into What Immigrant Families Face At Busiest Border Crossing", "Central American migrants plead to seek asylum in U.S., not Mexico"]}
{"comp": "LC_RC", "month": "Feb", "feats": "sbert", "test": 0.6048, "summ1": ["Lawsuit challenges US gov't over sending asylum seekers to Mexico", "Australia's Lower House Passes Asylum Bill in Historic Defeat for Government", "‘After nine years in direct provision I have never stopped living’", "Human Trafficking or Human Smuggling? Why the Two Crimes Aren't Interchangeable"], "summ2": ["The Cost of the Border Wall Keeps Climbing and It’s Becoming Less of a Wall", "Paul Murray: Bill Shorten’s support of medivac bill for asylum seekers a very risky tactic", "Obama Tripled Migrant Processing at Legal Ports—Trump Halved It", "Lawmakers quiet on Trump, Northern Nevada killings"]}
{"comp": "C_LC", "month": "Mar", "feats": "sbert", "test": 0.6031, "summ1": ["Nigeria: Court Declares Deportation of Cameroonians From Nigeria Illegal", "Memo From San Diego Border Patrol Chief Tells Agents to Single Out Spanish-Speaking Asylum Seekers, Require Them to Wait in Mexico", "Anti-immigrant sentiments fuel Ku Klux Klan resurgence", "US struggling with growing number of asylum seekers"], "summ2": ["Why Trump Wants to Detain Families Indefinitely, and Why He Can't", "\"Bizarre Vendetta\": Nauru Bans Telehealth After Doctors Without Borders Starts Seeing Patients", "Border agent smuggled $1 million in cash, 255 pounds of cocaine, indictment says", "The racist attack on Reker Ahmed was rooted in May's asylum policies"]}
{"comp": "C_RC", "month": "Mar", "feats": "bow", "test": 0.6025, "summ1": ["Sharp rise in number of asylum seekers placed in hotels", "Trump threatens to shut down border with Mexico next week", "Trump cuts aid to Central American countries as migrant crisis deepens", "First asylum seekers returned from Mexico for U.S. court hearings"], "summ2": ["Peter Dutton: Kerryn Phelps slams Home Affairs Minister’s asylum seeker claims", "President Trump Threatens To Shut Down Southern Border Unless Mexico Stops Migrant Caravan", "Guidelines ask agents to target Spanish speakers at border", "Previously deported Mexican national charged in rape of young girl; indicted federally for illegal re-entry"]}
{"comp": "ER_R", "month": "Apr", "feats": "sbert", "test": 0.6006, "summ1": ["Hispanic Approval of Trump Surges to 50% as Employment Sets Record", "DHS Blocks White House Plan to Bus Migrants into Democrats' Districts", "Five Time Deported Alien Invader Beats Baby To Death", "Trump Administration To Expand Program That Will Boot Illegal Alien ‘Asylum Seekers’ Back To Mexico"], "summ2": ["Democrat candidates fall for and repeat false claim Trump called asylum-seekers 'animals'", "White House Rips California Judge’s Ruling On Asylum", "DHS bloodletting designed to clear path for tougher immigration regulations: Senior official", "Illegal immigrant who was deported in 2005 arrested in Louisiana on 100 child porn charges"]}
{"comp": "LC_RC", "month": "Sep", "feats": "bow", "test": 0.6002, "summ1": ["Trump administration blocks most asylum seekers in ‘profound’ change to system as legal fights continue", "Trump's Asylum Policies Sent Him Back to Mexico. He Was Kidnapped Five Hours Later By a Cartel.", "Tamil asylum seeker family from Biloela 'terrified' for children after move to Christmas Island", "The Asylum Seekers Who Sheltered Snowden Are Still Stuck in an Increasingly Violent Hong Kong"], "summ2": ["When will big city Democrats stop enabling illegal immigration?", "Judge blocks Trump administration’s asylum ban for the second time", "Baldev Kumar, ex-MLA from Imran Khan's party, seeks political asylum in India; accuses Pakistan of persecuting minorities", "Tamil family: Dutton lashes out at Tamil parents"]}
{"comp": "C_LC", "month": "Jul", "feats": "sbert", "test": 0.599, "summ1": ["Trump administration sets new rule to make it harder for immigrants to seek asylum", "Hundreds protest immigrant incarceration and deportation", "Federal Judge Blocks Trump Admin Policy Keeping Asylum-Seekers Locked up While Cases Continue", "How the US is outsourcing border enforcement to Mexico"], "summ2": ["O'Rourke Visits Mexico, Meets Turned Away US Asylum Seekers", "Seven arrested at KIA for illegal stay in Malaysia", "Shukri Yahya Abdi’s death should have sparked resistance against the bullying refugee children face", "At border, grim realities of crisis collide with 2020 campaign politics"]}
{"comp": "LC_RC", "month": "Mar", "feats": "sbert", "test": 0.5973, "summ1": ["Why Trump Wants to Detain Families Indefinitely, and Why He Can't", "War, amputation, refuge: A Salvadoran migrant's story", "Scott Morrison defends Fiona Scott over asylum seeker comments", "House Passes Democrats’ Centerpiece Anti-Corruption and Voting Rights Bill"], "summ2": ["Lawmakers quiet on Trump, Northern Nevada killings", "Blow for illegal Irish after Immigrant Bill stalls", "Statue of Liberty climber gets her freedom curbed", "How waves of immigrants are overwhelming asylum process"]}
{"comp": "C_LC", "month": "Feb", "feats": "sbert", "test": 0.5965, "summ1": ["Australia’s government stirs up hysteria about illegal immigration", "Fact check: What is the national emergency? Do we need a wall?", "Authorities say suspect in suitcase death is in US illegally", "US farmers fuel surge in guest-worker visas as illegal labor dwindles"], "summ2": ["Lawsuit challenges US gov't over sending asylum seekers to Mexico", "Heather Nauert Withdraws From Consideration as U.N. Ambassador", "Australia's forgotten detention centre: the peculiar torture of Christmas Island's asylum seekers locked up with hardened criminals", "Feds make largest fentanyl bust in U.S. history"]}
{"comp": "C_LC", "month": "Jul", "feats": "bow", "test": 0.5949, "summ1": ["Safe 'third country rule' isn't actually safe for asylum seekers", "Mexico buses home migrants who gave up on U.S. asylum claims", "Judge blocks Trump policy keeping asylum-seekers locked up", "Mass immigration roundups in U.S. to start Sunday: New York Times"], "summ2": ["Chechnya LGBT: Dozens 'detained in new gay purge'", "Jacob Rees-Mogg: Is he right to ban these words?", "Expansion of \"remain in Mexico\" policy brings tension, fear to border cities", "A federal judge has ordered the Trump administration to reunite migrant children who were separated from their parents"]}
{"comp": "R_RC", "month": "Jun", "feats": "sbert", "test": 0.5949, "summ1": ["The Border Crisis Is Getting Worse. Why Are Democrats AWOL?", "Previously Deported Asylee And Child Molester Indicted On Child Porn Charges In California", "MSNBC Guest: Trump Is ‘Enacting Terror On Families’ By Enforcing Immigration Laws", "O’Donnell: There Are Over 100,000 Concentration Camps In Nearly Every State"], "summ2": ["At least 95 slain in Mali village amid violent surge in ethnic, extremist tensions", "Trump’s Mexican-tariff move was a true victory", "U.S. churches, some immigration officers denounce sending asylum seekers to Mexico", "Insiders: Peter Dutton grilled over medivac bill"]}
{"comp": "LC_RC", "month": "Feb", "feats": "bow", "test": 0.5941, "summ1": ["The Home Office Is Still Owed Most Of The Fines It Has Issued To Employers Using Undocumented Migrants", "Lawsuit challenges US gov't over sending asylum seekers to Mexico", "Thousands of allegations of sexual misconduct toward migrant children reported", "Warning of 14,000 asylum seekers 'ready to make boat journeys' from Indonesia"], "summ2": ["Since 2012 Obama Gave ACORN Replacement $644,000,000—for Illegal Aliens!", "Scott Morrison prime minister pushes back on refugee medical transfer bill news Australia", "The local cost of reopening the Christmas Island detention centre", "Ex-boyfriend arrested in killing of Valerie Reyes, missing woman found in suitcase"]}
{"comp": "C_LC", "month": "Jan", "feats": "bow", "test": 0.5937, "summ1": ["UNHCR examining Saudi woman's asylum bid as family due in Bangkok", "Runaway Saudi teen settles in Canada after being granted asylum", "US Sends First Central American Asylum Seeker to Mexico Under New Policy", "Obama ICE chief: Trump's border wall proposal makes 'so little sense'"], "summ2": ["Central American migrants keep heading toward US, even as Trump focuses on stopping caravans", "Canada helped pressure Thailand to protect Saudi woman, says Human Rights Watch", "Official: Asylum seekers to wait in Mexico starting Friday", "Police hunt for man accused of killing his parents and three others"]}
{"comp": "ER_R", "month": "May", "feats": "sbert", "test": 0.5924, "summ1": ["Asylum Seeker Shot by Police After Stabbing Five-Year-Old to Death", "Pelosi Trashes Pro-Life Bill, Then Says Every Illegal Immigrant Has ‘Dignity and Worth’", "900 Migrants Apprehended in 2 Days After Crossing Remote AZ Border Area", "DHS Flying Illegal Aliens to U.S. Cities, Releasing Them into Communities"], "summ2": ["Staggering: Border Agents In Texas Claim 5,500 Illegal Aliens Cross The Texas-Mexico Border Every Day", "Appeals Court Rules Trump Can Send Asylum Seekers To Mexico", "Rep. Ilhan Omar Goes on Anti-Semitic Twitter Rampage; Advocacy Group Demands Apology", "Illegal Immigrant Arrested After Impregnating 11-Year-Old Girl, Likely to be Deported"]}
{"comp": "C_LC", "month": "Apr", "feats": "bow", "test": 0.5923, "summ1": ["Ecuador leader says WikiLeaks' Julian Assange breached terms of London embassy asylum", "White House to Congress: top Trump immigration aide won't testify", "US judge blocks Trump's 'Remain in Mexico' asylum policy | Bangkok Post: news", "Mexican president wants to 'bring order' to Central American migration to U.S."], "summ2": ["'No one is above the law': UK police enter Ecuador embassy, arrest Julian Assange", "Asylum Seekers Face New Restraints Under Latest Trump Orders", "Trump Laid a Trap on Immigration—And Only O’Rourke Sees It", "White House considered dumping migrants in 'sanctuary cities'"]}
{"comp": "L_LC", "month": "Jul", "feats": "bow", "test": 0.5917, "summ1": ["Democratic Senators Call Migrant Detention Facility Conditions 'Heart-Wrenching'", "The Home Office quizzed a bisexual asylum seeker on LGBT terminology during his interview process", "STATEMENT: Trump’s New Asylum Rule Is Illegal, Plain and Simple, Says CAP’s Tom Jawetz", "Here's What You Should Know About Upcoming ICE Raids"], "summ2": ["UPDATE 1-Mexico buses home migrants who gave up on U.S. asylum claims", "Trump: Illegal immigrant crackdown to start Sunday", "Federal Court Blocks Trump Asylum Ban Again", "Australia asylum seeker 'brain dead' after infection - activists"]}
{"comp": "C_LC", "month": "May", "feats": "bow", "test": 0.5888, "summ1": ["FACT CHECK: Does a 1996 U.S. Law Say Non-Citizens Who Vote Must Be Deported?", "More Aid Won’t Stop Central America’s Migrant Crisis", "U.S. will assign dozens of border agents to migrant asylum interviews", "Trump can make asylum seekers wait in Mexico, court says"], "summ2": ["Africans, Cubans pack Mexican shelters, hoping for a shot at asylum", "EXPLAINER - Five ways Trump's moves to stem asylum seekers have hit hurdles", "Scheer vows to end 'illegal' border crossings as part of immigration policy plan", "Tommy Robinson faces new contempt case"]}
{"comp": "C_RC", "month": "Mar", "feats": "sbert", "test": 0.5884, "summ1": ["Nigeria: Court Declares Deportation of Cameroonians From Nigeria Illegal", "Memo From San Diego Border Patrol Chief Tells Agents to Single Out Spanish-Speaking Asylum Seekers, Require Them to Wait in Mexico", "Senate GOP goes down to wire in showdown with Trump", "Around the World, More Say Immigrants Are a Strength Than a Burden"], "summ2": ["'Grubby': Labor fires back at Dutton's refugee waiting lines claim", "Lawmakers quiet on Trump, Northern Nevada killings", "DHS Sec. Nielsen: \"Children Are Being Used As Pawns\" By Human Traffickers, Smugglers On The Border", "How waves of immigrants are overwhelming asylum process"]}
{"comp": "C_LC", "month": "Mar", "feats": "bow", "test": 0.5875, "summ1": ["Sharp rise in number of asylum seekers placed in hotels", "Migrants encounter snafus with new US asylum policy", "Trump cuts foreign aid, threatens to close Mexico border", "First asylum seekers returned from Mexico for U.S. court hearings"], "summ2": ["‘In Syria I used to hate school but here it’s really different", "Alleged axe-wielding carjacker arrested", "US asylum policy endangers migrants' lives, groups say", "OMB acting Director Russell Vought on Trump $8.6 billion wall request"]}
{"comp": "C_RC", "month": "Jan", "feats": "bow", "test": 0.5863, "summ1": ["Asylum assessment of Saudi woman in Thailand to take days: UNHCR", "Runaway Saudi teen settles in Canada after being granted asylum", "The emergency at the border isn’t national. It’s regional", "Illegal immigrants $18 bln boost to Texas: report"], "summ2": ["Trump calls illegal immigration a ‘crisis,’ but doesn’t declare emergency", "Australia considering resettlement for fleeing Saudi teen Rahaf", "Canada grants asylum to Saudi woman who pleaded for help on Twitter in Bangkok", "Trump administration to force asylum seekers to wait in Mexico, U.S. official says"]}
{"comp": "ER_R", "month": "Mar", "feats": "bow", "test": 0.5843, "summ1": ["Trump Cites 'Need' for More Immigration at Event for American Worker", "DHS Releases 24K Border Crossers, Illegal Aliens into U.S. in Two Weeks", "Twice-Deported Illegal Charged for Raping Child in Alabama", "Washington Post: Coyotes Create Bus Network to Deliver Migrants into U.S. Jobs"], "summ2": ["DHS secretary defends 'metering' asylum seekers at border: 'We're not turning anybody around'", "Man Stabs California Woman To Death; The Number Of Times Suspect Protected By ‘Sanctuary’ Laws Is Stunning", "Pentagon finds $12.8 billion for Trump's border wall", "SCOTUS gives Pres. Trump victory on immigration, upholds push to detain illegals"]}
{"comp": "LC_RC", "month": "Jan", "feats": "sbert", "test": 0.5820000000000001, "summ1": ["Judge rules that Trump administration has been wrongly detaining asylum seekers", "A Wall and Two Prayers, but Little Progress at Weekend Meetings on Shutdown", "Saudi woman seeking asylum can stay temporarily in Thailand", "Murders in Mexican resort of Tijuana top 1,700 in 2017 as rival drug gangs battle for control"], "summ2": ["Saudi refugee in Thailand headed to Canada", "'A brave new Canadian': Freeland welcomes Saudi teen granted asylum after fleeing family", "Everything Is Bigger in Texas — Except the Illegal Immigrant Crime Rate", "Asylum seekers worry new US policy will mean more waiting"]}
{"comp": "C_LC", "month": "Jun", "feats": "bow", "test": 0.5816, "summ1": ["U.S. deportations of immigrants reach record high in 2013", "Mexico has yet to expand asylum-seeker program agreed to with U.S.", "Trump claims his support among Latino voters is rising", "H.R. 2821, the American Promise Act of 2019"], "summ2": ["Mozambique: End five-month arbitrary detention of refugees and asylum seekers", "Guatemala votes for new president, runoff likely to decide outcome", "Lawyer who visited Texas border protection facility describes \"inhumane\" conditions", "Trump Administration May Build Temporary Immigration Courts"]}
{"comp": "C_RC", "month": "Feb", "feats": "sbert", "test": 0.5798, "summ1": ["Fact check: What is the national emergency? Do we need a wall?", "Australian government seeks to block bid to relax tough law on migrants", "El Salvador prosecutors request extradition of former president Funes", "Residents of Hachita, in southwest New Mexico, vexed by surge of migrants"], "summ2": ["President Trump's Childhood Home Lists For $2.9 Million", "ICE agents in North Carolina arrest hundreds of illegal immigrants", "Coalition, Labor battle on asylum seekers", "Attacks on hotel earmarked for asylum seekers 'were not spontaneous'"]}
{"comp": "C_LC", "month": "May", "feats": "sbert", "test": 0.579, "summ1": ["Five ways Trump's moves to stem asylum seekers have hit hurdles", "CDT Leads Coalition of Over 100 Organizations Opposing DHS Surveillance of Activists, Journalists, and Lawyers", "Mexico worries as US keeps making asylum seekers wait there", "As Europe closes its borders, Wales becomes a 'nation of sanctuary'"], "summ2": ["Trump Calls For New Restrictions On Asylum Seekers", "Fleeing Norway: An International Crisis over a Little Girl", "Cabinet papers 1988-89: Bob Hawke acted alone in offering asylum to Chinese students", "Anti-Immigrant Group Dumps Trash at DNC as 'Donation' for Asylum Seekers"]}
{"comp": "C_RC", "month": "Jan", "feats": "sbert", "test": 0.5787, "summ1": ["AP-NORC Poll: Immigration among the top concerns in 2019", "Fire at Rooskey hotel marked for use by asylum seekers", "Watch: I wanted to be free from abuse, women in Saudi Arabia treated like children, says Saudi teen after Canada grants asylum", "U.S. to send migrants back to Mexico to wait out asylum requests"], "summ2": ["‘Suicide towers’ Sydney: Public housing hell in Redfern", "Saudi refugee in Thailand headed to Canada", "Everything Is Bigger in Texas — Except the Illegal Immigrant Crime Rate", "Asylum seekers worry new US policy will mean more waiting"]}
{"comp": "C_LC", "month": "Aug", "feats": "sbert", "test": 0.5784, "summ1": ["US, Mexico widen asylum crackdown to push back migrants", "Support for Allowing Border Refugees Into U.S. Edges Up", "Biden camp jumped into damage control after upsetting Latino leaders", "US Appeals Court Deals Partial Setback to Trump Rule to Curtail Asylum"], "summ2": ["Another federal judge rules against Trump asylum policy", "Dirty Water, Spoiled Food: Report Details Conditions for Asylum-Seekers in Detention", "Trump administration appears to violate law in forcing asylum seekers back to Mexico, officials warn", "Flying without pride: How British Airways is complicit in the dep"]}
{"comp": "ER_R", "month": "Feb", "feats": "sbert", "test": 0.5775, "summ1": ["Three-Time Deported Illegal Alien SHOT AND KILLED During Attempted Murder Of California Officer", "Border Security Bill Provides Aid, Buses, Legal Shields to Migrants", "Austria: Half of Suspects in Murders of Women in 2017 Were Foreigners", "SOTU Address Slams Dems for 'Cruel' Tolerance of Illegal Immigration"], "summ2": ["Pa. Dem governor accused of blocking bombshell report over 11,000 illegal immigrants registered to vote", "Trump's tweeting is undercutting his own asylum policy", "The Washington Times: “ICE, Shut Out of Border Talks, Warns Democrats’ Plans Would Free Thousands of Criminals”", "Jihadi bride from east London Shamima Begum family lawyer says they want her baby son home"]}
{"comp": "ER_R", "month": "Apr", "feats": "bow", "test": 0.5739, "summ1": ["Lindsey Graham Promises Bill to Block Central American Migration", "Five-Time Deported Illegal Alien Beat 4-Month-Old Baby To Death", "Trump Scores Major Court Win, Asylum Seekers Being Sent Back To Mexico", "Trump’s DHS Releases 12,500 Illegal Aliens into U.S. in One Week"], "summ2": ["It was MS-13 Trump called 'animals,' not undocumented immigrants", "Trump Attorney General Barr Cracks Down on Phony Asylum Seekers", "White House Mulled Dumping Illegal Border Crossers In Sanctuary Cities", "California judge blocks Trump's policy forcing asylum-seekers to stay in Mexico"]}
{"comp": "C_RC", "month": "Aug", "feats": "sbert", "test": 0.5718, "summ1": ["US, Mexico widen asylum crackdown to push back migrants", "Breakthrough as Ireland agrees to help with relocation of people stranded on migrant rescue ship", "Trump Admin. Penalizes Immigrants Seeking Public Aid", "Michele Bachmann Named ‘Pastor To The United Nations’"], "summ2": ["Start behaving like a normal nation, stop exporting terror, India tells Pakistan", "Lawmakers Skeptical of Asylum-Law Changes in Two Weeks", "A Honduran church leader won asylum in the U.S. after waiting in Mexico for a judge to decide his case. He's still not free.", "Shopping centre guard sentenced over 'haunting' stairwell assault of three year old"]}
{"comp": "ER_R", "month": "Mar", "feats": "sbert", "test": 0.5712, "summ1": ["Germany: Migrant Crime Covered Up to 'Avoid Stirring Up Prejudice'", "Exclusive—Bradley Byrne: Illegal Accused of Killing Sonya Jones Benefited from Catch and Release", "Pew Poll: GOP Voters Overwhelmingly Support Stopping Illegal Immigration", "The Truth About Zero-Tolerance and Family Separation, What Americans Need to Know"], "summ2": ["Iranian Christian DENIED asylum in Great Britain because they say Christianity is VIOLENT, and they cite Bible verses to make this claim!", "Number of illegal immigrants crossing border surges after US ends family separations", "Trump Mulls Designating Mexican Cartels As Foreign Terrorist Organizations", "On their 'blind date' to the border, MPs debate fairness, fear of the unknown, and asylum seekers"]}
{"comp": "C_LC", "month": "Apr", "feats": "sbert", "test": 0.5643, "summ1": ["U.S. Democrats seek up to $2 trillion to invest in aging infrastructure", "US judge blocks Trump's 'Remain in Mexico' asylum move", "How Unvaccinated Texans, Not Asylum-Seekers, Pose Biggest Risk For Disease Outbreaks", "News Roundup: ACLU Wants Answers After Migrants Detained Under El Paso Bridge"], "summ2": ["If Your Country Were Committing War Crimes Would You Want to Know?", "US hits 'breaking point' at southern border, Customs and Border Protection commissioner says", "Federal judge blocks Trump administration program forcing asylum seekers to remain in Mexico while awaiting court hearings", "Austin's ‘Refugee Is Not My Name' aims to introduce neighbors to neighbors"]}
{"comp": "R_RC", "month": "Jul", "feats": "bow", "test": 0.5628, "summ1": ["Beto crosses Rio Grande to campaign in Mexico, courts asylum seekers", "Scalise: Broken Asylum Laws 'Magnet' for Immigrants", "Attorney General William Barr Puts Additional Limits On Asylum Claims – Conservative Daily News", "WATCH: Ilhan Omar refuses to answer reporter asking if she condemns antifa firebomb attack"], "summ2": ["Mexico Deported More Central Americans Than the U.S. in 2018", "Afghan asylum seeker asked shoppers if they were English, before attacking them with 10-INCH KNIFE", "Judge blocks Trump policy keeping asylum-seekers locked up", "Taiwan to consider granting asylum to HK protesters"]}
{"comp": "ER_R", "month": "Sep", "feats": "sbert", "test": 0.56, "summ1": ["Sanders: 'Yes' I'm Courageous Enough to Talk About Population Control", "France: Military-aged Afghan migrant kills 1 and injures 9 during stabbing rampage in Lyon", "Lawsuit: Illegal Aliens Worked for 10 Years Using Stolen Identities at Plant", "California Judge Puts National Block on Donald Trump's Asylum Reform"], "summ2": ["Supreme Court Decision Allows Focus on ‘Legitimate Asylum Claims,’ Immigration Chief Says", "Cost of educating new class of illegal immigrant minors estimated at over $760M", "Loco in MOCO: The newest illegal alien arrested for rape in Montgomery County had criminal history, could have been deported", "Vaping: Banning Smoke (& Mirrors)"]}
{"comp": "ER_R", "month": "Jul", "feats": "sbert", "test": 0.5596, "summ1": ["15-Year-Old Girl Stabbed to Death by ‘Child Migrant’ in Drug Store", "1,000 Haitian Migrants Apprehended Since June 10 at Texas Border", "Republican Establishment Redoubles Efforts to Keep Immigration Patriots Out of Senate in 2020", "Ilhan Omar Calls Illegal Aliens \"Undocumented Americans\" in Statement Opposing ICE Deportation Raids"], "summ2": ["Afghan-Asylum Seeker Pulled Knife on 3 Men in London After Asking If They Were English – Reports", "Protests erupt outside Phoenix ICE office after arrest of illegal immigrant", "68 Percent of White Evangelicals Believe the U.S. Has No Responsibility to Accept Refugees, Pew Study Finds", "REPORT: DHS Veterans Blast Democrats For Wanting To Decriminalize Illegal Immigration"]}
{"comp": "C_LC", "month": "Jan", "feats": "sbert", "test": 0.5586, "summ1": ["AP-NORC Poll: Immigration among the top concerns in 2019", "Fire at Rooskey hotel marked for use by asylum seekers", "Watch: I wanted to be free from abuse, women in Saudi Arabia treated like children, says Saudi teen after Canada grants asylum", "U.S. to send migrants back to Mexico to wait out asylum requests"], "summ2": ["Judge rules that Trump administration has been wrongly detaining asylum seekers", "Government Shutdown Leaves Workers Reeling: ‘We Seem to Be Pawns’", "Rahaf al-Qunun: Saudi teen granted asylum in Canada", "Guatemalan officials calling for an investigation into deaths of 2 minors who died in US custody in under a month"]}
{"comp": "LC_RC", "month": "Jul", "feats": "bow", "test": 0.5519, "summ1": ["UPDATE 1-Mexico buses home migrants who gave up on U.S. asylum claims", "Some asylum seekers to move from Portland Expo Center to housing in Brunswick", "Federal Judge Blocks Trump Policy Ordering Indefinite Detention For Asylum-Seekers", "Trump’s mass arrests are set to begin. Here’s the Democratic answer."], "summ2": ["‘Nobel Prize in stupidity’: Holocaust survivor wants AOC out of Congress", "When Mexico enforces its own laws, immigration drops", "Little Changes at U.S. Border Amid Confusion Over Trump Asylum Rules Facing Lawsuits", "Taiwan to consider granting asylum to HK protesters"]}
{"comp": "LC_RC", "month": "May", "feats": "bow", "test": 0.5451, "summ1": ["President Donald Trump announces 5% tariff on all goods from Mexico", "US Asylum Limits Spawn Mishmash Wait Systems in Mexico", "Appeals Court Rules Trump Administration Can Keep Sending Asylum Seekers To Mexico", "Homeland Security to test DNA of families at border in cases of suspected fraud"], "summ2": ["Trump slaps Mexico with 5% tariffs of EVERYTHING until it solves US immigration problem", "As border detention fills up, asylum seekers are being dropped off in the Inland Empire", "AP Exclusive: Ex-Interpol chief's wife gets asylum in France", "Scheer vows to end 'illegal' border crossings as part of immigration policy plan"]}
{"comp": "LC_RC", "month": "May", "feats": "sbert", "test": 0.5414, "summ1": ["Trump Calls For New Restrictions On Asylum Seekers", "Teenager Is Latest Migrant Child To Die In U.S. Custody", "The Terrorism That Doesn’t Spark a Panic", "China wants Germany to correct 'mistakes' over asylum for HK activists"], "summ2": ["Stock futures tumble as Trump slaps tariffs against all imports from Mexico", "Suspect Cristhian Bahena Rivera in Iowa student Mollie Tibbetts' death in custody, held on immigration detainer", "SENSATIONAL: \"By Deploying CRPF In West Bengal, The BJP Is Forcefully Pushing BJP And RSS Activists Into The State\", Claims Trinamool Chief Mamata Banerjee", "Editorial: Asylum crisis can’t be fixed by putting up more barriers"]}
{"comp": "LC_RC", "month": "Jul", "feats": "sbert", "test": 0.5408, "summ1": ["Democrats say U.S.-Guatemala asylum deal outsources America's responsibility to help desperate migrants", "Opponents sue to block Trump’s new asylum rules", "Rotherham child abuse scandal: 1,400 children exploited, report finds", "Mike Pence got a first-hand look at border detention facilities in McAllen and Donna, Texas. What he saw"], "summ2": ["CAIR New Trump Rule Blocking Asylum Seekers is Part of White Supremacist Agenda", "US returns first group of asylum seekers to Nuevo Laredo", "Churches jump into action with threat of immigration sweeps", "Sens. Mike Lee, Rand Paul are holding up 9/11 victims fund"]}
