{"NONE": ["Our cause is making definite marks. Never stop.   #Think #SemST", "You have not to be indifferent to those children who are starving in the desert. They and you are being connected to each other. #SemST", "A #kingdom has a particular #culture, a way of doing things (Ed Welch). #SemST", "RT @IntrovertAngry: Too much #MinorityAppeasement in India. No room for #SemST"], "FAVOR": ["There's no religion but sex and music. ~Sting #SemST", "Yes Islam is the mother load of bad ideas!  Christianity is not far behind!  #athiest #SemST", "Religious people are people too...... Just bigoted,genitalia mutilating, angry gullible people #SemST", "@neiltyson the more afraid you're wrong the stronger you fight to avoid facing facts. Belief based in fear just compounds that #SemST"], "AGAINST": ["Faith is being in the impossibilities that we don't believe will happen #SemST", "#NewsAlert from Heaven: In an effort to minimize the workload #God decides to only answer #gay #prayers #criticalthinking  #SemST", "RT @prayerbullets: Lord, let me prosper like Abraham -Gen. 24:35 #SemST", "If you look around you, there is much to be enraptured by. Be awake. #spirituality #SemST"], "name": "emb_rbf_greedy-diff", "mk": 4}
{"NONE": ["Our cause is making definite marks. Never stop.   #Think #SemST", "You have not to be indifferent to those children who are starving in the desert. They and you are being connected to each other. #SemST", "A #kingdom has a particular #culture, a way of doing things (Ed Welch). #SemST", "@HijabiSmile @NAInfidels @captains_pick @Pinchey1964 Both are utterly stupid and useless anyway. #liberalism #democracy #SemST", "All the  you've given. All the ways you've made. The fact that I'm still living!! How dare I wear  on my face. I'll  #LyricTweet #SemST", "RT @IntrovertAngry: Too much #MinorityAppeasement in India. No room for #SemST", "How to be a Happy CAMPER? Competency Autonomy Mastery Purpose Engagement Relationships create well being/meaning #100AEUAssembly #SemST", "Beware of the prosperity doctrines of greed and vanity! #deception #Greed #vanity #truth #wisdom #SemST"], "FAVOR": ["On balance, religion does more harm than good.   #freethinker #SemST", "Is there a way to get Free Atheist literature to pass out at an upcoming protest I'm planning? #ffrf #SemST", "Yes Islam is the mother load of bad ideas!  Christianity is not far behind!  #athiest #SemST", "It was a lot of fun hearing @SethAndrewsTTA talk about his new book #SacredCows. @ThinkingAtheist #GodlessGala #SemST", "@WBCSaysRepent How do you feel now you evil, hompohobic, hypocritical, lying bunch of lunatics? YOU LOST. GOD LOST. LOVE WON. #SemST", "Happiness is the pursuit of life and liberty. #TheLUPOL #theism #futurism #SemST", "8 years ago today my son was taken from me. If there's a god, fuck you, fuck you very much. #SemST", "Religions stopped being credible the minute the first dinosaur fossil was found.   #SemST"], "AGAINST": ["Faith is being in the impossibilities that we don't believe will happen #SemST", "RT @prayerbullets: Let the scepter of Your kingdom be released -Heb. 1:8 #SemST", "You can hate me or you can love me but in the end of the day, only #God can judge me. #Love #SemST", "10 Holy Mary Mother of God, pray for us sinners now and at the hour of our death. Amen. #rosary #teamjesus #SemST", "@nytopinion I hope they begin to face reality. There's no God. Loving eo unconditionally is what matters. #WakeUpAmerica #Peace #SemST", "Interestingly burning your wife alive suspecting her chastity is a great justice Ram style. @RamaY_BRF @madhukishwar @authoramish #SemST", "Souls are so CONNECTED to their creator no matter how hard you tried to DISCONNECT #islam #SemST", "In the absence of God, What are you? You are nothing more than an accident or a re-arrangement of molecules. #bible #SemST"], "name": "emb_rbf_greedy-diff", "mk": 8}
{"NONE": ["@RepTomMarino my priority is to address #SemST", "National announces plan to put out fire in pantry. Rest of the house can burn baby, burn. #sameoldshit #SemST", "It's nights like this when I'm not so fond of my long hair. I just wanna chop it all off! #heatwave #pnwgirl #SemST", "@cschultzwx there has been a ton of lightning up there every other day for the past week! #lolz #SemST"], "FAVOR": ["Climate change is a solvable problem but we need to start today. #HHDL80 #SemST", "If sea levels get any higher flooding in lowlands could become dire. #SemST", "#Mission:#Climate @ home > Purchase green power (if available) (by @EPA) #Tip #SemST", "A Dutch court has ruled that the gov must cut emissions under human rights law! Interesting. #climatejustice2015 #SemST"], "AGAINST": ["Last time I checked, Al Gore is a politician, not a scientist.. #WCS15 #SemST", "Global Warming! Global Warming! Global Warming!  Oh wait, it's summer.  #SemST", "[Man] cannot change the climate of any country; he adds no new element to the soil ~ Charles Darwin #anthropocene #SemST", "BREAKING: This just in, an ocean wave just broke an inch further on the beach than normal! #SemST"], "name": "emb_rbf_greedy-diff", "mk": 4}
{"NONE": ["@RepTomMarino my priority is to address #SemST", "National announces plan to put out fire in pantry. Rest of the house can burn baby, burn. #sameoldshit #SemST", "@cschultzwx there has been a ton of lightning up there every other day for the past week! #lolz #SemST", "Road to #Paris2015 \"#ADP2015 co-chairs' new tool will be presented on July 24th\" @manupulgarvidal at @UN_PGA event on #SemST", "Seriously, how many times can #Republicans be wrong? #ACA #LGBTRights #GovernmentShutdown #AutoBailout #StimulusSpending #SemST", "It's \"mindblowing\" to me to watch this, #SirDavidAttenborough. #SemST", "@shalyn67 religion / race have already been disproven by reason and science. I wonder what we can do about politics #drought #SemST", "Honestly I don't understand why I like California so much. I'm so bad in the heat. #SemST"], "FAVOR": ["Climate change is a solvable problem but we need to start today. #HHDL80 #SemST", "RT @abhinav_khanal: 700 people dead in Pakistan due to heatwave. #SemST", "#Mission:#Climate @ home > Purchase green power (if available) (by @EPA) #Tip #SemST", "Not to worry, sediment cores prove shellfish & coral will recover in just 160,000 years. #oilandgas #rbe #tvp #SemST", "@shalomshuli I'm guessing there was a lot less humidity back in the time of Moses. #SemST", "The facts are in. It is clear as our numbered days. Climate change is humanity's fault. And we are facing extinction. #SemST", "World Futures Council man at #fsds15 points out absurdity of cost benefit analysis discounting future lives #sustainability #SemST", "Rent a theatre and show the movie #ChasingIce to my friends and family to spread the message of global warming. #My1500 #SemST"], "AGAINST": ["Last time I checked, Al Gore is a politician, not a scientist.. #WCS15 #SemST", "Global Warming! Global Warming! Global Warming!  Oh wait, it's summer.  #SemST", "Climate change?! Explain the definition of climate change.. #fraud #CCOT #liberty #CruzCrew #SemST", "The Climate Change people are disgusting assholes. Money transfer scheme for elite. May you rot.   #SemST", "[Man] cannot change the climate of any country; he adds no new element to the soil ~ Charles Darwin #anthropocene #SemST", "I'm sick of celebrities who think being a well known actor makes them an authority on anything else. #robertredford #UN #SemST", "If ther clmate change alarmists come out in sept this year and tell me this was the hottest winter on record ill go postal #SemST", "BrettGarrot: BrettGarrot: GlblWarmingNews And the tooth fairy might be causing kids to lose teeth! #carbontaxscam #Chemtrails #SemST"], "name": "emb_rbf_greedy-diff", "mk": 8}
